{
  "news": [
    {
      "title": "US senator says 'traumatised' man deported to El Salvador moved to new prison",
      "link": "https://www.bbc.com/news/articles/cjdx0gp0kd0o",
      "published": "2025-04-19",
      "summary": "Sen Chris Van Hollen returned from El Salvador and spoke about his time meeting with Kilmar Ábrego García.",
      "content": "A Maryland man who the Trump administration mistakenly deported to El Salvador has been moved to a new prison, US Senator Chris Van Hollen has said.\nThe Democratic senator was speaking after returning from El Salvador where he met Kilmar Abrego Garcia, who was sent to the notorious mega-jail Cecot (Centre for the Confinement of Terrorism) last month.\nMr Abrego Garcia was \"traumatised\" and fearful of other prisoners while inside the facility, Van Hollen said, adding that he was moved to another facility in the country over a week ago.\nThe Supreme Court has ordered the government to \"facilitate\" his return, however Trump administration officials have continued to push back against the order.\nThe White House accuses him of being a member of the transnational Salvadoran gang MS-13, a designated foreign terrorist organisation, and has said he will not return to the US. \nMr Abrego Garcia has never been convicted of a crime. His family and attorneys have fiercely denied he is a member of MS-13. \nChris Van Hollen said he was initially blocked from meeting Mr Abrego Garcia by Salvadoran authorities. Later, he said government officials helped facilitate a meeting and Mr Abrego Garcia was brought to the senator's hotel.\n\"His conversation with me was the first communication that he had with anybody outside of prison since he was abducted,\" Van Hollen said.\n\"He said he felt very sad about being in a prison because he had not committed any crimes.\"\nVan Hollen added that conditions in the new prison, in the Salvadoran city of Santa Ana, were better.\n\"He still has no access to any news from the outside world and no ability to communicate with anybody in the outside world,\" Van Hollen said.\nMr Abrego Garcia's case is part of a simmering showdown between the Trump administration and the US courts system on the issue of immigration. \nA separate feud has been brewing after a judge said he could hold the Trump administration in contempt for its \"wilful disregard\" of his order barring deportation flights. \nMultiple judges - including a unanimous US Supreme Court ruling - said the government should facilitate Mr Abrego Garcia's return to the US. But the White House has insisted the Maryland man will \"never\" live in the US again.\n\"If he [Mr Abrego Garcia] ever ends up back in the United States, he would immediately be deported again,\" White House press secretary Karoline Leavitt said.\nPresident Donald Trump told reporters at the White House Mr Abrego Garcia was \"not a very innocent guy\".\nMr Abrego Garcia has faced at least two other allegations of criminal activity, neither of which resulted in a conviction.\nHis wife alleged in a 2021 protective order request that he'd physically attacked her on multiple occasions, according to documents shared by the US Department of Homeland Security.\nJennifer Vasquez Sura decided not to follow through with the court process, saying she and her husband were \"able to work through this situation privately as a family, including by going to counselling\".\nA separate incident was reported in 2022, when Mr Abrego Garcia was pulled over in Tennessee for allegedly speeding. \nAn officer speculated that he was involved in human trafficking, due to him having multiple people in the car and telling authorities he'd been travelling from Texas to Maryland, according to information shared by the Department of Homeland Security that was obtained by the BBC's partner CBS. \nNo criminal case was launched from the incident. His wife said he \"worked in construction and sometimes transported groups of workers between job sites\". \nAt the heart of the case, though, are the allegations of his involvement in MS-13, which the Trump administration used to expel him under the Alien Enemies Act.\nThe president has evoked the law to deport hundreds so far, by arguing the alleged gang members were terrorists. \nSen Van Hollen said the Trump administration wants to \"flat out lie about what this case is about\". \n\"If you want to make claims about Abrego Garcia, you should present them in the courts, not on social media,\" he said.\nMr Abrego Garcia was arrested by immigration authorities on 12 March in Baltimore, before being deported from Texas to El Salvador on 15 March. \nThe accused gang members are being sent to a notorious jail in El Salvador under a 19th-Century law.\n\"Olo\" is said to be a saturated blue-green - but some say the existence of a new colour is \"open to argument\".\nIranian and US officials agree to continue with a third round of high-stakes talks on a new nuclear deal.\nThe US says the attack on the Red Sea coast aimed to restrict supplies and funds for the Houthis, who called it a war crime.\nBBC Verify looks at the evidence behind allegations that the Salvadoran mistakenly deported to a mega-prison was a dangerous gang member.\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.\n ",
      "ml_hf_summary": "Kilmar Ábrego García, a Maryland man mistakenly deported to El Salvador in March 2023, has been moved to a new prison facility in Santa Ana, El Salvador. Senator Chris Van Hollen met with Ábrego García after his initial detention and reported that he was \"traumatized\" and fearful of other prisoners. The Trump administration maintains that Ábrego García is a member of the MS-13 gang and will not return to the US, citing the Alien Enemies Act.  The Supreme Court has ordered the government to facilitate Ábrego García's return, but the White House continues to oppose this order.  Multiple judges have ruled in favor of facilitating his return, including a unanimous ruling from the US Supreme Court. \n"
    },
    {
      "title": "US strikes on Yemen oil terminal kill at least 74, Houthis say",
      "link": "https://www.bbc.com/news/articles/clywg335680o",
      "published": "2025-04-19",
      "summary": "The US says the attack on the Red Sea coast aimed to restrict supplies and funds for the Houthis, who called it a war crime.",
      "content": "US air strikes on a key oil terminal on Yemen's Red Sea coast controlled by the Houthi movement have killed at least 74 people and wounded 171 others, the Houthi-run health ministry says.\nThe US military said it had destroyed Ras Isa \"to eliminate this source of fuel for the Iran-backed Houthi terrorists and deprive them of illegal revenue\".\nThe Houthi-led government in north-west Yemen said the terminal was a civilian facility and that the strikes constituted a \"war crime\".\nIt was the deadliest known attack since President Donald Trump ordered an intensification of the US bombing campaign last month in response to Houthi attacks on Red Sea shipping and Israel linked to the Gaza war.\nSeveral hours after the strikes on Ras Isa, the Israeli military said it had intercepted a missile launched from Yemen. \nSirens sounded in several Israeli areas but there were no reports of any casualties or damage.\nHouthi-run Al-Masirah TV reported that 14 air strikes hit Ras Isa late on Thursday.\nVideos posted online purportedly showed several explosions, large fires and destroyed fuel tankers at the facility, which is about 60km (35 miles) north of the Red Sea city of Hudaydah.\n\"We ran away. The strikes came one after the other, then everything was on fire,\" one man who said he worked there told the channel.\nOn Thursday afternoon, Houthi health ministry spokesman Anees al-Asbahi said the death toll had reached 74, adding that rescue teams were still searching for casualties.\nAl-Masirah had earlier cited local health authorities as saying many of the dead were workers at Ras Isa. It also reported that five paramedics were killed in secondary US strikes as they arrived at the scene.\nThe casualty reports could not be immediately verified, but graphic footage from Al-Masirah appeared to show at least 10 charred bodies near the burning tankers, including one driver, as well as men being treated for serious burns in hospital.\n\"We affirm that the targeting of the Ras Isa oil port is a full-fledged war crime, as the port is a civilian facility and not a military one,\" the Houthi-run government said in a statement.\n\"We hold the US administration fully responsible for the consequences resulting from its escalation in the Red Sea,\" it warned. \n On Friday, thousands of Houthi supporters held a rally in the capital Sanaa, condemning the US strikes.\nThe US military's Central Command said in a statement that the \"objective of these strikes was to degrade the economic source of power of the Houthis, who continue to exploit and bring great pain upon their fellow countrymen\".\n\"The Houthis, their Iranian masters, and those who knowingly aid and abet their terrorist actions should be put on notice that the world will not accept illicit smuggling of fuel and war material to a terrorist organisation,\" it added.\nIran's foreign ministry said it strongly condemned the strikes as \"barbaric\".\nOn Thursday, the Houthis' leader gave a defiant speech in which he claimed the recent US strikes failed to stop their attacks.\nAbdul Malik al-Houthi said the group's forces had carried out almost 80 operations involving around 170 missiles and drones since mid-March, including 30 attacks targeting the US aircraft carrier USS Harry S Truman and 26 attacks on Israel.\nYemen has been devastated by a civil war that escalated 10 years ago, when the Houthis seized control of the country's north-west from the internationally-recognised government and a Saudi-led coalition supported by the US intervened in an effort to restore its rule.\nThe fighting has reportedly left more than 150,000 people dead and triggered a humanitarian disaster, with 4.8 million people displaced and 19.5 million - half of the population - in need of some form of aid.\nSince November 2023, the Houthis have targeted dozens of merchant vessels with missiles, drones and small boat attacks in the Red Sea and the Gulf of Aden. They have sunk two vessels, seized a third, and killed four crew members.\nThe Houthis have said they are acting in support of the Palestinians in the war between Israel and Hamas in Gaza, and have claimed - often falsely - that they are targeting ships only linked to Israel, the US or the UK.\nThe Houthis were not deterred by the deployment of Western warships in the Red Sea and Gulf of Aden to protect merchant vessels last year, or by multiple rounds of US strikes on military targets ordered by former President Joe Biden.\nAfter taking office in January, Trump redesignated the Houthis as a \"Foreign Terrorist Organisation\" - something the Biden administration had removed due to what it said was the need to mitigate the country's humanitarian crisis.\nLast month, Trump ordered large-scale strikes on areas controlled by the Houthis and threatened that they would be \"completely annihilated\". He has also warned Iran not to arm the group - something it has repeatedly denied doing.\nHouthi-run authorities have said the strikes have killed dozens of civilians in recent weeks, but they have reported few casualties among the group's members.\nEarlier this month, Trump posted a black-and-white video from an aircraft that showed a strike targeting about 70 people gathered in a circle whom he identified as Houthis. But the Houthi-run Saba news agency cited a source as saying it was \"a social Eid visit\" in Hudaydah province.\nIsrael has also carried out air strikes against the Houthis since last July in retaliation for the hundreds of missiles and drones that the Israeli military says have been launched at the country from Yemen, most of which have been shot down.\nThe accused gang members are being sent to a notorious jail in El Salvador under a 19th-Century law.\n\"Olo\" is said to be a saturated blue-green - but some say the existence of a new colour is \"open to argument\".\nThe wartime Alien Enemies Act has been controversially used to deport Venezuelans to a mega-jail in El Salvador.\nWhat is happening with US bonds, why Donald Trump cares and how ordinary Americans could be affected. \nSen Chris Van Hollen returned from El Salvador and spoke about his time meeting with Kilmar Abrego Garcia.\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.\n ",
      "ml_hf_summary": "On Thursday, US airstrikes on Ras Isa oil terminal in Yemen killed at least 74 people and wounded 171 others, according to the Houthi-run health ministry. The US military stated that the strikes were aimed at degrading the Houthis' economic power and depriving them of fuel revenue. The Houthi government condemned the attack as a war crime, claiming the terminal was a civilian facility.  The Israeli military intercepted a missile launched from Yemen shortly after the US airstrikes. This incident follows a series of attacks by the Houthis on merchant vessels in the Red Sea and the Gulf of Aden, which have been met with retaliatory strikes from Israel and the US. The conflict in Yemen has caused a humanitarian crisis, with over 150,000 deaths and millions displaced.  The US government's involvement in the conflict escalated under President Trump, who designated the Houthis as a \"Foreign Terrorist Organization\" and ordered large-scale strikes against them. \n"
    },
    {
      "title": "Zelensky says Russian attacks ongoing despite Putin announcing 'Easter truce'",
      "link": "https://www.bbc.com/news/articles/c787v5gxny7o",
      "published": "2025-04-19",
      "summary": "The Ukrainian president accused Moscow of breaking the truce, but said Ukraine would follow it if Russian attacks ceased.",
      "content": "Russian President Vladimir Putin says he has ordered his forces to \"stop all military activity\" in Ukraine, as he declared an \"Easter truce\" until the end of Sunday. \nHe said the 30-hour truce would last until 22:00 BST on Sunday (00:00 Moscow time), adding that Russian forces should be prepared to respond to \"any possible violations\". \nUkrainian President Volodymyr Zelensky said Kyiv would adhere to the truce, but accused Moscow of breaking it.\n\"If Russia is now suddenly ready to truly engage in a format of full and unconditional silence, Ukraine will act accordingly - mirroring Russia's actions,\" he said.\n\"Our actions are and will be symmetrical. The proposal for a full and unconditional 30-day silence remains on the table -- the answer to it must come from Moscow,\" he wrote on X. \nHe said fighting continued in Russia's Kursk and Belgorod regions and Russian drones were still in use, but added that some areas had become quieter. \nZelensky said Ukraine would be ready to extend a truce beyond 20 April, seemingly referring to an earlier proposal from the US for a 30-day ceasefire which Ukraine had already agreed to. \nResponding to Putin's initial announcement, Ukraine's Foreign Minister Andriy Sybiha wrote on X: \"Putin has now made statements about his alleged readiness for a cease-fire. 30 hours instead of 30 days.\" \n\"Unfortunately, we have had a long history of his statements not matching his actions. We know his words cannot be trusted and we will look at actions, not words,\" he added. \nPutin announced the temporary truce at a meeting with his chief of general staff, Valery Gerasimov.\n\"Based on humanitarian considerations... the Russian side announces an Easter truce. I order a stop to all military activities for this period,\" Putin told Gerasimov.\n\"We assume that Ukraine will follow our example. At the same time, our troops should be prepared to repel possible violations of the truce and provocations by the enemy, any aggressive actions.\"\nThe Russian defence ministry said its troops would adhere to the ceasefire provided it was \"mutually respected\" by Ukraine.\nIt is not the first time a pause in fighting has been suddenly announced - a previous attempt at a ceasefire during Orthodox Christmas in January 2023 fell apart after both sides failed to agree on a proposal. \nReacting to Putin's truce announcement, a Foreign Office spokesman in the UK said: \"Now is the moment for Putin to truly show he is serious about peace by ending his horrible invasion and committing to a full ceasefire, as the Ukrainian government has called for - not just a one day pause for Easter.\"\nRussia launched a full-scale invasion of Ukraine on 24 February 2022. It is estimated that hundreds of thousands of people - the vast majority of them soldiers - have been killed or injured on all sides. \nThe US has been directly talking to Russia as part of its efforts to end the war, but has struggled to make major progress. \nLast month, Moscow rejected a proposal for a full and unconditional ceasefire that had been agreed by the US and Ukraine.\nUS President Donald Trump on Friday warned Washington would \"take a pass\" on brokering further talks on ending the war in Ukraine unless there was quick progress.\nHe was speaking after Secretary of State Marco Rubio said the US was not \"going to continue with this endeavour for weeks and months on end\", as it had \"other priorities to focus on\".\n\"We need to determine very quickly now - and I'm talking about a matter of days - whether or not this is doable,\" he added. \n\"If it's not going to happen, then we're just going to move on.\"\nThe US and Ukraine have taken the first step to finalising a deal that would set up an investment fund for Ukraine's reconstruction.\nRussia hoped to overthrow Ukraine's pro-Western government in days, but it failed.\nSteve Witkoff appeared to suggest that a peace deal hinged on the status of five Ukrainian regions.\nAnna Alexandrova denied posting anti-war messages, insisting the case was motivated by a land squabble.\nThe US president apportioned blame to Ukraine's leader hours after the deadliest strike on civilians this year.\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.\n ",
      "ml_hf_summary": "Russian President Vladimir Putin declared a 30-hour Easter truce in Ukraine, starting on April 16th at 22:00 BST and ending on Sunday.  He stated that Russian forces should be prepared to respond to violations of the truce. Ukrainian President Volodymyr Zelensky confirmed his country's adherence to the truce but accused Russia of breaking it. The ceasefire was announced after a meeting between Putin and his chief of general staff, Valery Gerasimov. While both sides agreed to the truce, Ukraine's Foreign Minister Andriy Sybiha expressed skepticism about its effectiveness due to past instances where Russian promises were not followed through.  The conflict began in February 2022 with Russia launching a full-scale invasion of Ukraine. The war has resulted in significant casualties on both sides and international efforts to end the conflict have been ongoing, but progress remains limited. \n"
    },
    {
      "title": "Russia's Putin declares temporary Easter ceasefire in Ukraine",
      "link": "https://www.cbsnews.com/news/russia-ukraine-putin-easter-temporary-ceasefire/",
      "published": "2025-04-19",
      "summary": "The temporary truce will be between 6 p.m. local time on Saturday and midnight on Monday, Russian President Vladimir Putin said.",
      "content": "Watch CBS News \n Updated on: April 19, 2025 / 12:39 PM EDT\n / CBS/AP \n Russian President Vladimir Putin has announced a temporary \"Easter truce\" in the three-year conflict in Ukraine that will last until midnight Sunday.\n\"On humanitarian grounds, today from 6 p.m. to midnight from Sunday to Monday, the Russian side announces an Easter truce,\" Putin said in a televised statement released by the Kremlin. The statement has been translated. \"For this period, I order to stop all fighting. We assume that the Ukrainian side will follow our example. At the same time, our troops should be prepared to reflect possible violations of the truce and provocations by the enemy, any aggressive actions.\"\nPutin first announced the ceasefire in a meeting with Chief of the General Staff Velary Gerasimov, the Kremlin Press Service said. \nRussia's Defense Ministry said in a translated statement that the ceasefire is imposed \"for humanitarian purposes and will be observed by the Russian Unified Group of Troops (forces) provided that it is mutually respected by the Kiev regime.\" \nUkrainian President Volodymyr Zelenskyy criticized the announcement as \"Putin's next attempt to play with people's lives,\" saying an \"air alert is now spreading across the territory of Ukraine\" because of Russian drone strikes recorded in the sky at 5:15 local time. \n\"Ukrainian air defense and aviation have already started working to protect. 'Shaheeds' in our sky are Putin's true attitude to Easter and to people's lives,\" Zelenskyy said. \n\"Shaheeds\" may be a reference to Shahed drones, which have been extensively used by Russia during the war. \nThe Ukrainian leader did not confirm if he would observe the proposed truce. \nUkrainian Foreign Minister Andriy Sybiga said Ukraine was waiting for \"actions, not words\" from Putin. \n\"Putin has now made statements about his alleged readiness for a ceasefire,\" Sybiga wrote on social media, adding: \"We know his words cannot be trusted and we will look at actions, not words.\"\nPrevious attempts at holding ceasefires for Easter in April 2022 and Orthodox Christmas in January 2023 were not implemented after both sides failed to agree on them. Ukraine last month agreed to President Trump's proposal for a full and unconditional 30-day ceasefire, only for Putin to reject it.\nAlso Saturday, Russia and Ukraine conducted a prisoner swap that was mediated by the United Arab Emirates, Russian state news agency TASS reported. \nRussia's Ministry of Defense said 246 Russian service members were returned from territory controlled by Kyiv, and that as a \"gesture of goodwill,\" 31 wounded Ukrainian prisoners of war were transferred in exchange for 15 wounded Russian soldiers in need of urgent medical care. \nZelenskyy said 277 Ukrainian \"warriors have returned home from Russian captivity.\" He thanked the United Arab Emirates for mediating the exchange. \nIt was the largest exchange since Russia invaded Ukraine over three years ago.\nThe announcement came the day after U.S. Secretary of State Marco Rubio said President Trump's administration was ready to \"move on\" from peace talks between Russia and Ukraine if progress was not made in the coming days. Rubio made the comments in Paris, after landmark talks among U.S., Ukrainian and European officials. \n\"We are now reaching a point where we need to decide whether this is even possible or not,\" Rubio told reporters while departing Paris. \"Because if it's not, then I think we're just going to move on.\"\n\"It's not our war,\" Rubio added. \"We have other priorities to focus on.\" He said the U.S. administration wants to decide \"in a matter of days.\" Another meeting is expected next week in London.\nLater Friday, Mr. Trump echoed Rubio's frustrations with the pace of the talks. When asked about Rubio's comments on Friday, Kremlin spokesman Dmitry Peskov told reporters that \"fairly complex\" negotiations were ongoing between the U.S. and Russia, though he said no direct talks between Mr. Trump and Putin were scheduled for the coming days. \nEarlier Saturday, Russia's Defense Ministry said its forces pushed Ukrainian forces from one of their last remaining footholds in Russia's Kursk region. Russian forces took control of the village of Oleshnya, on the border with Ukraine, the ministry said. Gerasimov said Russian troops had retaken 99% of the territory seized by Ukraine. \n\"In the areas of the Kursk region where Ukraine armed force mounted an incursion, the main part of the territory... is now liberated. That's 1,260 square kilometres, 99.5 percent,\" Gerasimov told Putin.\nThe Associated Press was unable to immediately verify the claim. In the same statement where he reacted to the ceasefire, Zelenskyy said that Ukrainian forces \"continued their activity\" and are \"maintaining their positions\" in the Kursk region. He also said that military forces \"advanced and increased our zone of control\" in Belgorod, a Russian city about 24 miles from the Russia-Ukraine border. \nAccording to TASS, Russia is still fighting to push Ukrainian forces out of the village of Gornal, some 7 miles south of Oleshnya.\n\"The Russian military has yet to push the Ukrainian armed forces out of Gornal ... in order to completely liberate the Kursk region. Fierce fighting is underway in the settlement,\" the agency reported, citing Russian security agencies.\nIn other developments, the Ukrainian air force reported that Russia fired 87 exploding drones and decoys in the latest wave of attacks overnight into Saturday. It said 33 of them were intercepted and another 36 were lost, likely having been electronically jammed.\nRussian attacks damaged farms in the Odesa region and sparked fires in the Sumy region overnight, Ukraine's State Emergency Service said Saturday. Fires were contained, and no casualties were reported.\nRussia's Ministry of Defense, meanwhile, said its air defense systems shot down two Ukrainian drones overnight into Saturday. \n (c) 2025 CBS Interactive Inc. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. The Associated Press contributed to this report. \n Copyright (c)2025 CBS Interactive Inc. All rights reserved.",
      "ml_hf_summary": "Russian President Vladimir Putin announced a temporary \"Easter truce\" lasting from 6 PM on Sunday to midnight Monday, calling for an end to fighting and urging Ukraine to follow suit.  The ceasefire is intended for humanitarian purposes and will be observed by Russian forces provided it's mutually respected by the Ukrainian government. Ukrainian President Volodymyr Zelenskyy criticized the announcement as a ploy to manipulate people's lives, noting that air alerts were already being issued due to Russian drone strikes. While Ukraine has not confirmed if they will observe the truce, their Foreign Minister called for action rather than words from Russia.  A prisoner swap between Russia and Ukraine mediated by the UAE took place on Saturday, with 246 Russian service members returned in exchange for 31 Ukrainian prisoners of war. The US Secretary of State Marco Rubio stated that if progress is not made in the coming days, they may move on from peace talks.  Russia continues to push back against Ukrainian forces in the Kursk region, while Ukraine maintains its positions and reports continued attacks by Russia. \n"
    },
    {
      "title": "27 Karens And Kens Who Demanded To See A Manager For Absurd Reasons",
      "link": "https://www.yahoo.com/lifestyle/27-fiends-asked-speak-manager-033102192.html",
      "published": "2025-04-19",
      "summary": "",
      "content": "",
      "ml_hf_summary": "Please provide the news article you would like me to summarize.  I will then create a concise and technical summary that captures the main events, facts, numbers, key details, and background context. \n"
    },
    {
      "title": "Despite millions from KC, grocery store says it needs more as shelves go bare",
      "link": "https://www.yahoo.com/news/despite-millions-kc-grocery-store-100000233.html",
      "published": "2025-04-19",
      "summary": "",
      "content": "",
      "ml_hf_summary": "Please provide the news article you would like me to summarize.  I will then create a concise and technical summary that captures the main events, facts, numbers, key details, and background context. \n"
    },
    {
      "title": "Iran and the U.S. plan expert-level talks over Tehran's nuclear program - NPR",
      "link": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNeGFxOW94UWFNUFk1QVZpcV9LU3lEUzhScUQ5SlRfWUticUZYNENfdnVSMThwR05PeGJXc2pDYU1IWW1DdmhHZ3Zmc2I3SWlrX2tvRlZhX19LVHNMMkZWMXpQNDJaOF94UElSNUVyUnF3VTZ6YkZfb0VrUUNtTUlRRTl0Z3Bsdw?oc=5",
      "published": "2025-04-19",
      "summary": "<ol><li><a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxNeGFxOW94UWFNUFk1QVZpcV9LU3lEUzhScUQ5SlRfWUticUZYNENfdnVSMThwR05PeGJXc2pDYU1IWW1DdmhHZ3Zmc2I3SWlrX2tvRlZhX19LVHNMMkZWMXpQNDJaOF94UElSNUVyUnF3VTZ6YkZfb0VrUUNtTUlRRTl0Z3Bsdw?oc=5\" target=\"_blank\">Iran and the U.S. plan expert-level talks over Tehran's nuclear program</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">NPR</font></li><li><a href=\"https://news.google.com/rss/articles/CBMivwFBVV95cUxOMUVDNlNLRFgyck5JYzhLaHBPb09vTDk2WVVjRWJLSnFrUHlHS18zeE1BSzNlazVOMkxxT0hvVWQybVRQZWlDUVFOc2lQa29HY2NDMTBNUVh2VjNEeXZiVFNvYUdZNEZYUTBrV0Q5c05QOGZzV3Q3aUpCNWdvNEw0elNjQkdJZFRacEc4QVRRa2tNaUhwekgyN1hzZ0U5VmpBVmRPSGx1M3pwME5XUWltb3RVRnpJMDRXMkVDYjRRZw?oc=5\" target=\"_blank\">Big Gaps in Intelligence on Iran’s Nuke Program Threaten Push for Quick Deal</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">WSJ</font></li><li><a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxPaVV0NVFlX21ueDJ1U1l5RG82SEkwOGw5MnZReUVPd1M5ZU9PMF9QWGlOZFR5bGNiV0RRMnYxbDhQekpmNF9fcGwtV0oyczlVTS1lMEpRRkJzOGlmT1VheG5qd2pVekx4TFdKbFk2SlQ2cFEwX0k1eF9zamhRV192ejgxdHpMeml3TUHSAYABQVVfeXFMT0xHSFlxVF9rV0Fac0N1NnlmYTc1WGhRT0RseTktajRBLUpQRzBZclBKcjZJQnhXdDNrVzg4ZlBBMHJjbkItSmk3Z0cxRHo5eFg0U2NQbjA5VUYwZDJNclF6VThXSmVwSi0yUER2WWR2RVBreEtjQzU1ZFJjaUI2NUk?oc=5\" target=\"_blank\">Iran cites ‘movement forward’ in second round of high-stakes nuclear talks with US</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CNN</font></li><li><a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxNOGJnRk1YOHlkTWRqNFhuVVlTTFlVQWE0dDVBbEg3dmxwWHlRSFZVUUx4bC1sOHJlS2RIS1BjWVRHck9OLVh6bmpWcXFQMFJkUVlQTW1sN21rakxGd3B0eFlTd0hMWU5NWW1Jd3A5bzhRTWhyUmtVVkJtQUJJaWVfRUJRQjU?oc=5\" target=\"_blank\">In Iran Talks, Trump Is Edging Toward Reviving an Old Deal</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The New York Times</font></li><li><a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxPUVZ1NDdDSGlyamZpOTJsMm9iT0FkZ2JXRE5rdm4tSTE5eGpPSmM1WklFd3gyNlNjVjlHV3pOOFBWQU5fSjk3RnIxbDMyeVRkQU5tQTAyYjl4eWNTLVg5Q0ZwY3VuaEVyNXFEYjBlUXh0eng1V3FTTUx6UzRLbUF2dXhR0gGHAUFVX3lxTE1rdlJSSXRVak9CSlZtRWF5YlZ3Y1Z6NEx0OGV5ejNRMzc5MUt2S0RFeXlUMTd3dl9uVFlEZ3RSU2VkdWJPazlWS1IyZEVPVTdQV2RuVUltLVI0X09zVVlOdVppc3dvcnNzQlpfbHltNDhYNWpNcUJXbkZ3WFlyVHBQbnNlZkpHdw?oc=5\" target=\"_blank\">US made ‘very good’ progress on nuclear talks with Iran</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Hill</font></li></ol>",
      "content": "",
      "ml_hf_summary": "Please provide the news article you would like me to summarize.  I will then create a concise and technical summary that captures the main events, facts, numbers, key details, and background context. \n"
    },
    {
      "title": "U.S. Adds Fees for Chinese Ships in Effort to Boost Shipbuilding",
      "link": "https://www.nytimes.com/2025/04/18/business/trump-chinese-ships-fees.html",
      "published": "2025-04-19",
      "summary": "The new fees are aimed at countering China’s dominance of the shipbuilding industry, but critics say they will simply raise prices for American consumers.",
      "content": "",
      "ml_hf_summary": "Please provide me with the news article you would like me to summarize.  I will then create a concise and technical summary that captures the key facts, figures, dates, locations, and background information. \n"
    },
    {
      "title": "Abrego Garcia Told Chris Van Hollen He Had Been In Isolation in El Salvador Prison",
      "link": "https://www.nytimes.com/2025/04/18/us/politics/abrego-garcia-chris-van-hollen-el-salvador.html",
      "published": "2025-04-19",
      "summary": "Senator Chris Van Hollen said that Kilmar Armando Abrego Garcia,who was deported and incarcerated in El Salvador, reported having been transferred after weeks in a maximum-security prison.",
      "content": "",
      "ml_hf_summary": "Please provide me with the news article you would like me to summarize.  I will then create a concise and technical summary that captures the key facts, figures, dates, locations, and background information. \n"
    },
    {
      "title": "Ukraine wary of Putin’s Easter truce and says it will reciprocate only a genuine ceasefire - AP News",
      "link": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNOHhOU3JlU1hOajk2UWx5U0FEdnRWdllueGNlNVYzNFo4NWxMamxPTXQ0TkN5eXJoeWlHSmRWbU5vMGlPTGFNQXVRMXMtbDZhWDRFQ3NidHp5T3BZWWdzeU9jbkNyQXl4TGgzbWR0NmVJMS1ObUZuYmxoWWlTbFlUbFdDNjdmMEZjUWtSTFZxVzZQdHFXb1E?oc=5",
      "published": "2025-04-19",
      "summary": "<a href=\"https://news.google.com/rss/articles/CBMilgFBVV95cUxNOHhOU3JlU1hOajk2UWx5U0FEdnRWdllueGNlNVYzNFo4NWxMamxPTXQ0TkN5eXJoeWlHSmRWbU5vMGlPTGFNQXVRMXMtbDZhWDRFQ3NidHp5T3BZWWdzeU9jbkNyQXl4TGgzbWR0NmVJMS1ObUZuYmxoWWlTbFlUbFdDNjdmMEZjUWtSTFZxVzZQdHFXb1E?oc=5\" target=\"_blank\">Ukraine wary of Putin’s Easter truce and says it will reciprocate only a genuine ceasefire</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">AP News</font><strong><a href=\"https://news.google.com/stories/CAAqNggKIjBDQklTSGpvSmMzUnZjbmt0TXpZd1NoRUtEd2pnOF9UWERSRk4yU01NbjA5TFlDZ0FQAQ?hl=en-US&amp;gl=US&amp;ceid=US:en&amp;oc=5\" target=\"_blank\">View Full Coverage on Google News</a></strong>",
      "content": "",
      "ml_hf_summary": "Please provide the news article you would like me to summarize.  I will then create a concise and technical summary that captures the main events, facts, numbers, key details, and background context. \n"
    },
    {
      "title": "France Acknowledges Devastating Effect of Debt Imposed on Haiti for Freedom",
      "link": "https://www.nytimes.com/2025/04/17/world/europe/france-haiti-debt-macron.html",
      "published": "2025-04-19",
      "summary": "After two centuries, a contrite tone from President Emmanuel Macron, though no talk of reparations for French actions that thwarted the development of its former colony.",
      "content": "",
      "ml_hf_summary": "Please provide me with the news article you would like me to summarize.  I will then create a concise and technical summary that captures the key facts, figures, dates, locations, and background information. \n"
    },
    {
      "title": "Abdullah Ahmad Badawi, a Calming Prime Minister of Malaysia, Dies at 85",
      "link": "https://www.nytimes.com/2025/04/18/world/asia/abdullah-ahmad-badawi-dead.html",
      "published": "2025-04-19",
      "summary": "From 2003 to 2009, he brought a quiet style of leadership to his Southeast Asian nation after the strongman rule of Mahathir Mohamad.",
      "content": "",
      "ml_hf_summary": "Please provide me with the news article you would like me to summarize.  I will then create a concise and technical summary that captures the key facts, figures, dates, locations, and background information. \n"
    },
    {
      "title": "U.S. and Iran negotiations are making \"very good progress,\" U.S. official says",
      "link": "https://www.cbsnews.com/news/us-iran-negotiations-tehran-nuclear-program-rome/",
      "published": "2025-04-19",
      "summary": "That the talks are even happening represents a historic moment, given the decades of enmity between the two countries since the 1979 Islamic Revolution and the U.S. Embassy hostage crisis.",
      "content": "Watch CBS News \n Updated on: April 19, 2025 / 4:32 PM EDT\n / CBS/AP \n The United States and Iran held a second round of negotiations on Saturday in Rome over Tehran's rapidly advancing nuclear program, officials said.\nU.S. Middle East envoy and billionaire Steve Witkoff met with Iranian Foreign Minister Abbas Araghchi at the Omani Embassy in Rome's Camilluccia neighborhood. The negotiations were mediated by Omani Foreign Minister Badr al-Busaidi.\n\"Today, in Rome over four hours in our second round of talks, we made very good progress in our direct and indirect discussions,\" a U.S. official told CBS News. \"We agreed to meet again next week and are grateful to our Omani partners for facilitating these talks and to our Italian partners for hosting us today.\"\nAfter the meeting, Araghchi said the two countries agreed to have another round of negotiations in Oman on April 26. But experts will meet there in the days before.\n\"The talks were held in a constructive environment and I can say that is moving forward,\" Araghchi told Iranian state television. \"I hope that we will be in a better position after the technical talks.\"\nU.S. National Security Council spokesperson Brian Hughes said in a statement ahead of the talks that President Trump has been clear that Iran \"cannot have a nuclear weapon\" and that \"all options remain on the table.\"\n\"The president has authorized direct and indirect discussions with Iran to make this point clear, but he's also made clear this cannot go on indefinitely,\" Hughes said. \"The Trump administration's entire national security leadership team is committed to the president's posture on Iran to ensure peace and stability in the Middle East and security here at home.\"\nOman's capital, Muscat, hosted the first round of negotiations between Araghchi and Witkoff last weekend, which saw the two men meet face to face after indirect talks. Oman, a sultanate on the eastern edge of the Arabian Peninsula, has long served as an interlocutor between Iran and the West.\nOman's Foreign Ministry said in a statement on X on Saturday that the sides agreed to keep talking to seek a deal that ensures Iran is \"completely free of nuclear weapons and sanctions, and maintaining its ability to develop peaceful nuclear energy.\"\nThat the talks are even happening represents a historic moment, given the decades of enmity between the two countries since the 1979 Islamic Revolution and the U.S. Embassy hostage crisis. Mr. Trump, in his first term, unilaterally withdrew from Iran's nuclear deal with world powers in 2018, setting off years of attacks and negotiations that failed to restore the accord that drastically limited Tehran's enrichment of uranium in exchange for the lifting of economic sanctions.\nAt risk is a possible American or Israeli military strike on Iran's nuclear sites, or the Iranians following through on their threats to pursue an atomic weapon.\n\"I'm for stopping Iran, very simply, from having a nuclear weapon,\" Mr. Trump said Friday. \"I want Iran to be great and prosperous and terrific.\"\nIranian Foreign Ministry spokesman Esmail Baghaei told Iranian state TV the talks were \"indirect\" with the delegations in \"different halls\" at the embassy. He earlier wrote Saturday on X that Iran \"always demonstrated, with good faith and a sense of responsibility, its commitment to diplomacy as a civilized way to resolve issues.\"\n\"We are aware that it is not a smooth path, but we take every step with open eyes, relying also on the past experiences,\" Baghaei added.\nAraghchi met Saturday morning with Italian Foreign Minister Antonio Tajani ahead of the talks with Witkoff.\nRafael Mariano Grossi, the head of the International Atomic Energy Agency, the United Nations' nuclear watchdog, also met Tajani on Saturday. Grossi's agency would likely be key in verifying compliance by Iran should a deal be reached, as it did with the 2015 accord Iran reached with world powers.\nTajani said Italy was ready \"to facilitate the continuation of the talks even for sessions at the technical level.\"\nA diplomat deal \"is built patiently, day after day, with dialogue and mutual respect,\" he said in a statement.\nMeanwhile, tensions in the Middle East have spiked over the Israel-Hamas war in the Gaza Strip and after U.S. airstrikes targeting Yemen's Iranian-backed Houthi rebels killed more than 70 people and wounded dozens more. \n (c) 2025 CBS Interactive Inc. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. The Associated Press contributed to this report. \n Copyright (c)2025 CBS Interactive Inc. All rights reserved.",
      "ml_hf_summary": "U.S. and Iranian officials held a second round of negotiations in Rome on April 19th, 2025, mediated by Oman's Foreign Minister Badr al-Busaidi. The talks focused on Iran's nuclear program and aimed to reach an agreement that ensures Iran is \"completely free of nuclear weapons and sanctions.\"  U.S. officials confirmed progress was made in the negotiations, with both sides agreeing to meet again next week. Iranian Foreign Minister Abbas Araghchi stated that the talks were held constructively and he hopes for a positive outcome. The negotiations follow the first round held in Muscat, Oman, last weekend, where indirect discussions took place.  The U.S. has emphasized its commitment to preventing Iran from acquiring nuclear weapons while also seeking to maintain peace and stability in the Middle East. \n"
    },
    {
      "title": "How China and the E.U. Are Reacting to Trump’s Tariffs",
      "link": "https://www.nytimes.com/video/world/100000010111503/how-china-and-the-eu-are-reacting-to-trumps-tariffs.html",
      "published": "2025-04-19",
      "summary": "Ana Swanson, who covers trade and international economics for The New York Times, talks to Jeanna Smialek, The Times’s Brussels bureau chief, and Keith Bradsher, The Times’s Beijing bureau chief, about how Trump’s tariffs are playing out in Europe and China.",
      "content": "new video loaded: How China and the E.U. Are Reacting to Trump's Tariffs\nNOW PLAYING\n2:42\n3:05\n1:42\n3:00\n2:38\n2:23\n2:39\n3:35\n2:35\n2:40\n2:05\nAdvertisement",
      "ml_hf_summary": "The article discusses the reactions of China and the European Union to tariffs imposed by former U.S. President Donald Trump on Chinese goods.  In 2018, Trump implemented tariffs on $50 billion worth of Chinese imports, escalating trade tensions between the two countries. The EU has been impacted by these tariffs as well, with a significant portion of its exports facing increased costs due to the trade barriers. China and the EU have responded to these actions through various measures, including retaliatory tariffs and negotiations for trade agreements.  The article highlights the ongoing impact of these tariffs on global trade relations. \n"
    },
    {
      "title": "Artists push back against AI dolls with their own creations",
      "link": "https://www.bbc.com/news/articles/c3v9z45pe93o",
      "published": "2025-04-19",
      "summary": "Artists hit back on social media to warn artificial intelligence may be endangering their livelihoods.",
      "content": "Artists and creatives are pushing back against a recent trend using artificial intelligence (AI) to generate \"starter pack\" images of people as toys - which they say may be in danger of risking their livelihoods.\nSince the start of April, thousands of people have uploaded their photos to generate images of themselves as dolls, despite warnings of damaging the environment, giving away personal information, and devaluing creativity.\nNick Lavallee, who has made custom action figures for six years, told the BBC he was concerned his work may be at risk after \"AI images saturated social media\".\n\"People are sick of them,\" he said. \"It's an artistic aesthetic - AI-generated art diminishes that.\"\nNick has made figures of - and for - comedians, film directors, and artists such as Weezer and Tyler Childers, which sell for as much as $250 (PS188) online on his Wicked Joyful website.\nHis success has led to a clothing brand and will soon be followed by a physical shop in his hometown of Manchester, New Hampshire.\nBut he's concerned action figure commissions could soon dry up, as well as the public perception of his work, from thousands of AI images mimicking his passion.\nThe feeling has been shared by other creatives with the rise of the #StarterPackNoAI movement, which has been used thousands of times since first appearing on Instagram in early April before spreading to X soon after.\nAfter Patouret's post, others quickly joined the counter-trend, with artist Maria Picasso Piquer saying she chose to take part \"for fun, but also as a statement\".\n\"While AI pieces all looked more or less the same, I was amazed at the variety of the 'human' works,\" she said.\n\"Plus, self-portraits added an extra layer of, well, humanity.\"\nMaria, like many other artists, sees the dual risk of AI images threatening intellectual property rights by being \"fed on 'stolen' art\", and the possibility of reducing her finding new clients.\nIllustrator Dav le Dessineux, working in Bordeaux, France, said some in his industry had already lost contracts to AI design work.\nHe contributed his starter pack because \"like many artists who use their real hands\", he was \"tired\" of the deluge of AI-generated doll images.\nDav's illustration featured only a pencil and sheet of white paper - tools he said are \"all you need to start being an artist\".\n\"People usually forget about it because of the technology surrounding us, but we really don't need more than basic stuff to create something and be original,\" he said.\nEli Dibitonto, an artist living in Barletta, Italy, agreed, describing the process of digitally illustrating his own starter pack as \"carefree and fun\".\n\"It doesn't have to be perfect - mine isn't,\" he said. \"Art isn't meant to be perfect or look flawless.\"\nAnd illustrator and student Evie Joyce said creating her own artwork meant being able to consider what to reflect of her personality during a process lasting several hours, rather than seconds.\n\"I think that what's so magical about it is you're seeing people put time and effort and their personality, all of their experiences, into pieces of art,\" she said.\n\"With AI, it can even steal from artists and steal their work and their style, it just loses that touch of personality.\"\nBack in New Hampshire, Nick understands the rebellion from illustrators, but says he believes there is use for AI.\n\"I don't necessarily want to say AI is bad when I know that it could be a useful tool,\" he said.\n\"I think all of us have experimented with it.\"\nAnd Henk van Ess, a global expert in using AI in investigative research, has proven how useful it can be - but it would be safe to say he does not believe it lies in starter packs.\n\"It's like watching a supercomputer calculate how many Hobnobs fit in a Sports Direct mug, while solving climate change sits on the 'to-do' list,\" he said.\n\"Technically impressive? Sure. But it's the technological equivalent of using the Large Hadron Collider to heat up your Pot Noodle.\n\"While everyone's busy generating these digital equivalents of small talk, they're missing the actually revolutionary stuff AI can do - it's just wasteful to put all that energy into creating digital fluff when we can use it for solving real-world problems.\"\nAnd Nick remains positive.\n\"The musicians who get my stuff, who are excited to hold a Wicked Joyful in their hands, they know it's my artwork, they know it's mine,\" he said.\nLikewise, Dav is confident in the worth of human work.\nDespite the rise of pre-fabricated furniture, he says, \"people still call on cabinetmakers\".\n\"I hope I'll be one of those artisans,\" he said.\nNick, who says he found his purpose \"in bringing joy to people\" with his creations, said he similarly wanted to remain hopeful about the future.\n\"I really hope people are totally sick of AI action figures,\" he said.\n\"But I hope that they are smart enough to understand the difference in something that I'm doing versus what is computer-generated.\"\nMax Corbett's street scenes are a mixture of photography and traditional oil painting techniques.\nMinecraft players have spent about 15,000 hours in total on the project to build London and the UK\nThe suspended light installation casts moving shadows, illuminating the church and forming halos.\nFrank Morris's sketches can take him anywhere between five and 10 hours to complete. \nThe influencer explains how she rebuilt her life after a podcast implicated her fiance had had an affair.\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.\n ",
      "ml_hf_summary": "Artists and creatives are expressing concern over the proliferation of AI-generated images mimicking their work, particularly \"starter pack\" images of people as dolls.  This trend has been fueled by social media platforms like Instagram and X (formerly Twitter), with thousands uploading their photos to generate these images. Artists like Nick Lavallee, who creates custom action figures, worry that this could devalue their own creative work and lead to a decline in commissions. The #StarterPackNoAI movement encourages artists to create their own \"starter packs\" as a counter-trend, highlighting the importance of human creativity and original expression.  While some see AI as a potential tool for artistic exploration, experts like Henk van Ess emphasize its limitations and urge focusing on real-world problems that require technological advancements. \n"
    },
    {
      "title": "Israeli strikes on Gaza killed more than 90 in 48 hours, health ministry says",
      "link": "https://www.cbsnews.com/news/israeli-strikes-gaza-killed-more-than-90-in-48-hours-palestinians-say/",
      "published": "2025-04-19",
      "summary": "The dead include 15 people who were killed overnight, among them women and children.",
      "content": "Watch CBS News \n Updated on: April 19, 2025 / 4:31 PM EDT\n / AP \n Israeli strikes in Gaza have killed more than 90 people in 48 hours, Gaza's Health Ministry said Saturday, as Israeli troops ramp up attacks to pressure Hamas to release its hostages and disarm.\nThe dead include 15 people who were killed overnight, among them women and children, some of whom were sheltering in a designated humanitarian zone, according to hospital staff.\nAt least 11 people were killed in the southern city of Khan Younis, several of them in a tent in the Mwasi area where hundreds of thousands of displaced people are living, hospital workers said. Israel has designated it as a humanitarian zone.\nFour other people were killed in separate strikes in Rafah city, including a mother and her daughter, according to the European Hospital, where the bodies were brought.\nIn a statement issued Saturday, Israeli Prime Minister Benjamin Netanyahu alleged that Hamas this weekend had \"rejected a proposal that could have led to the release of half of the hostages alive and the return of many of the dead.\"\n\"Let me make it clear, we will not end the war before we destroy Hamas in Gaza, before we return all of our hostages, and before we ensure that the Gaza Strip no longer poses a threat to Israel,\" Netanyahu said. \nAt the funeral in Khan Younis Saturday afternoon, families wept over the bodies of their relatives and cried out in pain. \"Omar is gone ... I wish it was me,\" screamed the brother of one of the victims.\nIsrael has vowed to intensify attacks across Gaza and occupy large \"security zones\" inside the strip. For six weeks Israel also has blockaded Gaza, barring the entry of food and other goods.\nIn a statement issued Saturday, Israeli Prime Minister Benjamin Netanyahu alleged that Hamas this weekend had \"rejected a proposal that could have led to the release of half of the hostages alive and the return of many of the dead.\"\n\"Let me make it clear, we will not end the war before we destroy Hamas in Gaza, before we return all of our hostages, and before we ensure that the Gaza Strip no longer poses a threat to Israel,\" Netanyahu said. \nThis week, aid groups raised the alarm, saying that thousands of children have become malnourished and most people are barely eating one meal a day as stocks dwindle, according to the United Nations.\nOn Friday, Dr. Hanan Balkhy, the head of the World Health Organization's eastern Mediterranean office, urged the new U.S. ambassador in Israel, Mike Huckabee, to push the country to lift Gaza's blockade so medicines and other aid can enter the strip.\n\"I would wish for him to go in and see the situation firsthand,\" she said.\nIn his first appearance as ambassador on Friday, Huckabee visited the Western Wall, the holiest Jewish prayer site in Jerusalem's Old City. He inserted a prayer into the wall, which he said was handwritten by U.S. President Donald Trump. Huckabee said every effort was being made to bring home the remaining hostages held by Hamas.\nThe war began when Hamas-led militants attacked southern Israel on Oct. 7, 2023, killing about 1,200 people, mostly civilians, and abducting 251. Most of the hostages have since been released in ceasefire agreements or other deals.\nIsrael's offensive has since killed over 51,000 Palestinians, mostly women and children, according to Gaza's Health Ministry, which does not distinguish between civilians and combatants. The war has destroyed vast parts of Gaza and most of its food production capabilities. Around 90% of the population is displaced, with hundreds of thousands of people living in tent camps and bombed-out buildings. \n (c) 2025 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. \n Copyright (c)2025 CBS Interactive Inc. All rights reserved.",
      "ml_hf_summary": "Israeli airstrikes in Gaza have resulted in over 90 deaths in the past 48 hours, according to Gaza's Health Ministry.  The strikes, which include targeting humanitarian zones like Khan Younis, have been carried out by Israel as pressure on Hamas to release hostages and disarm intensifies.  Hamas has rejected a proposal for hostage releases, with Israeli Prime Minister Benjamin Netanyahu stating that the war will continue until all hostages are returned and the threat posed by Gaza is neutralized. The conflict began in October 2023 when Hamas militants attacked southern Israel, resulting in significant civilian casualties.  The ongoing conflict has caused widespread displacement within Gaza, with over 90% of the population displaced and food supplies dwindling due to a blockade imposed by Israel for six weeks.  \n"
    },
    {
      "title": "Gunmen disguised as soldiers kill 12 spectators at cockfight",
      "link": "https://www.cbsnews.com/news/gunmen-disguised-soldiers-kill-12-cockfight-ecuador/",
      "published": "2025-04-19",
      "summary": "Footage of the shooting, circulated on social media, showed spectators flinging themselves to the ground and taking cover under their seats.",
      "content": "Watch CBS News \n Updated on: April 19, 2025 / 12:27 PM EDT\n / CBS/AFP \n Criminals dressed in fake military uniforms opened fire on spectators at a cockfight in rural Ecuador, killing 12 unarmed people and wounding several others, police in the violence-plagued South American nation said Friday.\nSecurity footage of Thursday night's attack showed a group of at least five men entering the arena and opening fire with automatic rifles on a crowd of dozens in the rural community of La Valencia in northwest Ecuador.\nThe attackers were dressed in replica military uniforms -- a common tactic of criminal gangs in the country, which averaged a killing every hour at the start of the year as cartels vie for control over cocaine routes that pass through Ecuador's ports.\nThe footage, circulated on social media, showed spectators flinging themselves to the ground and taking cover under their seats.\n\"We have 12 people deceased as a result of an armed attack by a criminal group,\" police colonel Renan Miller Rivera said in a statement Friday. He said several people were injured, without giving a number.\nPolice have detained four people, including a \"target of intermediate value,\" national police chief Victor Hugo Zarate wrote on social media. Police said the four suspects were believed to be part of an organized criminal group called \"Los R7.\" \nAfter the attack, police found discarded \"military-style uniforms\" and two abandoned cars on a nearby highway, Miller Rivera added. One of the cars had been set on fire, the other had overturned.\nPolice released video on social media showing officers recovering evidence hidden under bags and tree branches. The video also showed weapons and cash retrieved as well as an image of four people in custody with their faces blurred.\nIn addition to the uniforms, police said they recovered eight rifles, four pistols, three shotguns, eight magazines, 11 cell phones, ballistic helmets and tactical gloves.\nEcuador is home to around 20 criminal gangs -- with striking names like \"Los Freddy Kruegers\" and \"The Peaky Blinders\" -- involved in trafficking, kidnapping and extortion. They have wreaked havoc in the country of 18 million squeezed between the world's biggest cocaine producers, Peru and Colombia.\nIn recent years, the nation has been plunged into violence by the rapid spread of transnational cartels that use its ports to ship drugs to the United States and Europe.\nAbout 73 percent of the world's cocaine passes through Ecuador, according to an interior ministry report.\nLarge parts of the country are under a state of emergency recently renewed by President Daniel Noboa, who was re-elected to a second term in elections last Sunday.\nOn the campaign trail, Noboa suggested U.S. special forces should be deployed to Ecuador to tackle drug violence and floated legal reforms to allow U.S. bases to operate in the country.\nAt least two high-profile Ecuadorian gang leaders targeted by the U.S. have made headlines this year. Earlier this month, the fugitive leader of \"Los Cheronos\" that relied on hitmen, bribes and military weapons to do business was indicted in New York City on charges he imported thousands of pounds of cocaine into the United States. Jose Adolfo Macias Villamar -- whose nickname is \"Fito\" -- escaped from a prison in Ecuador last year and is not in U.S. custody. \nIn 2024, the U.S. Treasury imposed sanctions on \"Los Choneros.\"\nEarlier this year, a leader of one of Ecuador's biggest crime syndicates, \"Los Lobos,\" was arrested at his home in the coastal city of Portoviejo. Carlos D, widely known by his alias \"El Chino,\" was the second-in-command of \"Los Lobos\" and \"considered a high-value target,\" the armed forces said in a statement.\nThe U.S. last year declared Los Lobos to be the largest drug trafficking organization in Ecuador. \n (c) 2025 CBS Interactive Inc. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. Agence France-Presse contributed to this report. \n Copyright (c)2025 CBS Interactive Inc. All rights reserved.",
      "ml_hf_summary": "On April 18, 2025, criminals dressed in fake military uniforms opened fire on spectators at a cockfight in La Valencia, Ecuador, killing 12 people and injuring several others.  Police have detained four suspects, including a \"target of intermediate value,\" believed to be members of the criminal group \"Los R7.\" The attack was captured on security footage showing the attackers firing automatic rifles into the crowd. Police recovered weapons, ammunition, and cell phones at the scene, along with discarded military uniforms and two abandoned cars. Ecuador is grappling with violence from organized crime gangs who control drug trafficking routes through its ports, leading to a state of emergency declared by President Daniel Noboa.  The country's high cocaine transit volume has led to increased U.S. involvement in targeting criminal organizations like \"Los Choneros\" and \"Los Lobos,\" which have been sanctioned by the U.S. Treasury. \n"
    },
    {
      "title": "NASA's most senior astronaut returning to Earth with 2 cosmonauts",
      "link": "https://www.cbsnews.com/news/don-pettit-nasa-cosmonauts-return-seven-months-space-station/",
      "published": "2025-04-19",
      "summary": "Pettit, NASA's oldest active astronaut, will mark his 70th birthday landing on the steppe of Kazakhstan after 220 days in space.",
      "content": "Watch CBS News \n Updated on: April 19, 2025 / 6:28 PM EDT\n / CBS News \n On the eve of his 70th birthday, Don Pettit, NASA's oldest active-duty astronaut, and two cosmonaut crewmates undocked from the International Space Station Saturday and geared up for a fiery overnight plunge back to Earth to close out a 220-day expedition.\nPettit, Soyuz MS-26/72S commander Alexey Ovchinin and flight engineer Ivan Vagner undocked from the Russian Rassvet docking port at 5:57 p.m. Eastern Time, setting up a parachute-assisted landing on the steppe of Kazakhstan near the town of Dzhezkazgan at 9:20 p.m. local time, or 6:20 a.m. Eastern Time Sunday, Pettit's birthday. \nRussian recovery crews and NASA personnel were deployed nearby to help the returning crew out of the Soyuz descent module with initial medical checks and satellite phone calls to family and friends as they begin their readjustment to gravity after seven months in weightlessness.\nAssuming an on-time landing, mission duration will stand at 220 days and nearly nine hours, spanning 3,520 orbits and 93.3 million miles since launch last Sept. 11 from the Baikonur Cosmodrome in Kazakhstan.\nAt touchdown, Ovchinin will have logged 595 days in space over four flights, followed closely by Pettit, whose total will stand at 590 days over four flights of his own. Vagner's total will be 416 days aloft during two space station visits.\nThe world record for most cumulative time in space is held by cosmonaut Oleg Kononenko, who spent nearly 1,111 days in orbit over five missions. The U.S. record is held by astronaut Peggy Whitson. She spent 675 days in space over four flights.\nAs for Pettit's age, John Glenn, the first American in orbit, was 77 when he flew aboard the space shuttle in 1998 as a NASA spaceflight participant. He holds the record as the oldest person to fly in orbit.\nFrom Kazakhstan, Ovchinin and Vagner will head back to Star City near Moscow while Pettit will be flown to the Johnson Space Center in Houston for more detailed tests and begin his physical rehabilitation.\nThe trio's return to Earth marked the final chapter in an extended crew rotation that began with launch of SpaceX Crew 10 commander Anne McClain, Nichole Ayers, Japanese astronaut Takuya Onishi and cosmonaut Kirill Peskov on March 14.\nCrew 10's arrival at the station cleared the way for Crew 9 commander Nick Hague, cosmonaut Alexander Gorbunov, Starliner commander Barry \"Butch\" Wilmore and pilot Sunita Williams to return to Earth four days later.\nThe Russians then launched replacements for Pettit's crew -- Soyuz commander Sergey Ryzhikov, Alexey Zubritsky and NASA's Jonny Kim -- on April 8, clearing the way for Ovchinin, Vagner and Pettit to return to Earth Saturday.\nIn a brief ceremony Friday, Ovchinin turned command of the station over to Onishi.\n\"It's a great honor for me to accept the command of the ISS,\" Onishi said. \"I feel so special that I am taking over the command from you because it's been almost nine years since we met here in 2016 during Expedition 48. At that time, both of us were rookies and here we are two veterans who are ISS commanders.\"\n\"Human space flight is not easy. Only continuous dedication from generation to generation made it possible for human beings to get here. Now today, we have four rookies (on board). I'm sure one day they will come back and become commanders ... that's how we will continue to develop human space flight,\" Onishi said.\nThe ISS has been continuously staffed by rotating crews since Nov. 2, 2000. Scheduled for retirement in five years, the lab is facing problems on multiple fronts, ranging from air leaks in the Russian segment to uncertain funding, spare parts shortages and resupply delays.\n\"Spaceflight is difficult and very risky,\" Rich Williams, a member of NASA's independent Aerospace Safety Advisory Panel, told the group in a public meeting Thursday. \"The ISS has entered the riskiest period of its existence.\"\n\"The ISS management, crew and support personnel always make spaceflight look easy. Spaceflight is anything but easy, and the increasing risks attending the ISS program are making it harder,\" Williams said.\nThe air leaks in the Zvezda module's aft docking compartment are presumably the results of metal fatigue and repeated pressure cycles as visiting Soyuz crew ships and Progress cargo freighters come and go.\n\"Primary risk mitigation activities at this point include application and patching materials to known cracks and limiting ... pressurization cycles to try to limit stress and fatigue,\" Williams said. \"The ISS program is monitoring this closely, and the panel considers this one of our highest concerns.\"\nNASA has hired SpaceX to build a U.S. deorbit vehicle, or USDV, to drive the million-pound space station back into the atmosphere in 2030 to ensure it breaks up over the southern Pacific Ocean, far from shipping lanes and populated areas. The USDV is expected to arrive at the lab in 2029.\n\"Delivering and utilizing this USDV capability is critical to ensuring that the deorbit debris risk meets the established government public safety standards,\" Williams said. \"If there is a deorbit of the ISS before the USDV is delivered, the risk to the public from ISS breakup debris will increase by orders of magnitude.\"\nHe said NASA and Russian space officials are working \"to address the challenges associated with achieving a safe deorbit capability, both for end-of-life as well as a risk-managed deorbit for contingencies.\"\nThe major problem facing the ISS is what Williams called \"a large ISS budget shortfall.\" NASA's fiscal 2024 budget included nearly $1 billion for station operations and maintenance with another $1.6 billion earmarked for crew launches and resupply missions.\n\"It is critical to maintain adequate budget and resources until the vehicle has safely re-entered, not only to assure safety of day-to-day operations in a high-risk environment, but also to ensure controlled, safe deorbit within debris footprint requirements for the sake of public safety,\" Williams said.\nIn summary, he said, \"the panel appreciates the demonstrated operational excellence of the ISS program, but remains deeply concerned about the increasing and cascading risks attending the program over the next several years.\"\nBill Harwood has been covering the U.S. space program full-time since 1984, first as Cape Canaveral bureau chief for United Press International and now as a consultant for CBS News. \n (c) 2025 CBS Interactive Inc. All Rights Reserved. \n Copyright (c)2025 CBS Interactive Inc. All rights reserved.",
      "ml_hf_summary": "On April 19, 2025, NASA astronaut Don Pettit and his cosmonaut crewmates undocked from the International Space Station (ISS) to return to Earth after a 220-day mission. The Soyuz MS-26/72S spacecraft landed in Kazakhstan near Dzhezkazgan at 9:20 p.m. local time, marking Pettit's 70th birthday.  The crew's total cumulative time in space is nearly nine hours and spans 3,520 orbits and 93.3 million miles since launch last September. The mission duration will be officially recorded as 220 days.  Pettit's total time in space is 590 days, followed by Ovchinin (595 days) and Vagner (416 days). This marks the end of a crew rotation that began with SpaceX Crew 10 in March. The ISS faces challenges including air leaks, funding issues, and resupply delays.  A U.S. deorbit vehicle (USDV) is being developed to safely deorbit the station in 2030. \n"
    },
    {
      "title": "Experts: this is the best cash back card of 2022",
      "link": "https://www.fool.com/the-ascent/credit-cards/landing/wells-fargo-active-cash-card-review/?utm_site=theascent&utm_campaign=ta-cc-co-cnn-welac2-ron-5-hp-sfpb&utm_medium=cpc&utm_source=cnn",
      "published": "2025-04-20",
      "summary": "",
      "content": "If you're on a Galaxy Fold, consider unfolding your phone or viewing it in full screen to best optimize your experience.\nWells Fargo Active Cash(r) Card\nWhen Wells Fargo Active Cash(r) Card hit the market, it instantly topped our independent experts' list of best all-around, no-annual-fee credit cards. (See rates and fees.) \nIt's easy to see why with these perks: \n APPLY NOW to lock in these benefits today if approved.\nOn \n Wells Fargo's\n Secure Website.\n \n Rates & Fees \n Great for: Unlimited 2% Cash Rewards\nOn \n Wells Fargo's\n Secure Website.\n \n Rates & Fees \n Credit Score: \n Circle with letter I in it. \n Falling within this credit range does not guarantee approval by the issuer. An application must be submitted to the issuer for a potential approval decision. There are different types of credit scores and creditors use a variety of credit scores to make lending decisions.\n \n Good/Excellent (670-850) \n On \n Wells Fargo's\n Secure Website.\n \n Rates & Fees \n Intro APR \n Circle with letter I in it. \n 0% intro APR for 12 months from account opening on purchases and qualifying balance transfers\n \n Purchases: 0% intro APR, 12 months from account opening \n Balance Transfers: 0% intro APR, 12 months from account opening on qualifying balance transfers \n Regular APR\nRewards \n Circle with letter I in it. \n Earn unlimited 2% cash rewards on purchases.\n \n Annual Fee\nWelcome Offer \n Circle with letter I in it. \n Earn a $200 cash rewards bonus after spending $500 in purchases in the first 3 months.\n \n Unlimited 2% cash rewards -- Cardholders earn an unlimited 2% cash rewards on purchases, with no categories to activate or earnings limits to track.\nThere are other cards that offer higher cash back rates on certain categories, and while they can be worth it, they do require more effort. And they often are also subject to a cap and limited in what purchases they apply to. The Wells Fargo Active Cash(r) Card is perfect for someone that wants an easy-to-use card that still offers high rewards: you'll earn a best-in-class flat rewards right away on your purchases -- with no limits or hoops to jump through.\n$200 cash rewards welcome offer -- New Wells Fargo Active Cash(r) Card holders can earn a $200 cash rewards welcome offer for spending just $500 in purchases in the first 3 months. Not only is this a very competitive sign-up bonus for a card with no annual fee, but it's also one of the things that sets this Wells Fargo credit card apart from other 2% back cards. We've yet to come across another credit card with 2% unlimited cash rewards that also has a sign-up bonus.\n12 months from account opening 0% APR intro offer -- New cardholders can enjoy 0% intro APR on both new purchases and eligible balance transfers for a full 12 months from account opening. (After that period, a go-to rate of 19.24%, 24.24%, or 29.24% Variable APR applies.) That's a great offer, even when compared to cards marketed just for a 0% intro APR. It means that this card will allow you to avoid interest on purchases and balance transfers for a full year!\nKeep in mind that balance transfers need to be made within the first 120 days to qualify for a reduced interest rate and a lower balance transfer fee.\nNo annual fee -- In many cases, high rewards rates mean high annual fees. Not with the Wells Fargo Active Cash(r) Card, which sports a $0 annual fee.\nCell phone protection -- With the price of a typical cell phone in the hundreds of dollars, having some sort of insurance is a good idea. With this Wells Fargo card, you can get built-in cell phone protection of up to $600 just by paying your cell phone bill with your card. Coverage is subject to a $25 deductible.\nApproval for the Wells Fargo Active Cash(r) Card is most likely for applicants with good credit, which typically means a credit score of 670 or higher. If you need help rebuilding your credit, see this page.\nWe believe this is one of the best cash back cards for most people. Not only will you get a lucrative unlimited flat cash rewards rate, but it also sports a hefty, easy-to-earn sign-up bonus and a highly competitive 0% intro APR offer for 12 months from account opening.\nDepending on what card is in your wallet today, there's a high chance the Wells Fargo Active Cash(r) Card is a more lucrative upgrade -- and it could especially be an upgrade over debit cards, which have far worse fraud protections than credit cards and usually no rewards.\nTo apply for potential approval today and make sure you don't miss out on your bonus, simply click here: Wells Fargo Active Cash(r) Card \n Rates & Fees \n Credit cards with rewards & 0% intro APR offers are excellent, but remember, they are a tool to help you get the most out of your spending. Motley Fool Money motto to follow:\nFollow this and you'll be making your money work overtime for you. Live richly, not risky.\nOn \n Capital One's\n Secure Website.\n \n Rates & Fees \n Credit Score: \n Circle with letter I in it. \n Falling within this credit range does not guarantee approval by the issuer. An application must be submitted to the issuer for a potential approval decision. There are different types of credit scores and creditors use a variety of credit scores to make lending decisions.\n \n Good/Excellent (670-850) \n On \n Capital One's\n Secure Website.\n \n Rates & Fees \n Intro APR \n Purchases: 0% intro on purchases for 15 months \n Balance Transfers: 0% intro on balance transfers for 15 months (Balance Transfer Fee Applies) \n Regular APR\nRewards \n Circle with letter I in it. \n Earn unlimited 1.5% cash back on every purchase, every day. Earn unlimited 5% cash back on hotels and rental cars booked through Capital One Travel, where you'll get Capital One's best prices on thousands of trip options. Terms apply.\n \n Annual Fee\nWelcome Offer \n Circle with letter I in it. \n $200 Cash Back after you spend $500 on purchases within 3 months from account opening\n \n On \n Chase's\n Secure Website.\n \n Rates & Fees \n Credit Score: \n Circle with letter I in it. \n Falling within this credit range does not guarantee approval by the issuer. An application must be submitted to the issuer for a potential approval decision. There are different types of credit scores and creditors use a variety of credit scores to make lending decisions.\n \n Good/Excellent (670-850) \n On \n Chase's\n Secure Website.\n \n Rates & Fees \n Intro APR \n Circle with letter I in it. \n 0% Intro APR on Purchases\n \n Purchases: 0% Intro APR on Purchases, 15 months \n Balance Transfers: 0% Intro APR on Balance Transfers, 15 months \n Regular APR\nRewards \n Circle with letter I in it. \n 5% cash back on up to $1,500 in combined purchases in bonus categories each quarter you activate. Enjoy new 5% categories each quarter! Plus, earn 5% cash back on travel purchased through Chase Travel(sm), 3% on dining and drugstores, and 1% on all other purchases.\n \n Annual Fee\nWelcome Offer \n Circle with letter I in it. \n Earn a $200 Bonus after you spend $500 on purchases in your first 3 months from account opening!\n \n Our Credit Cards Experts\nMotley Fool Money brings financial expertise, trusted advice, and unbiased analysis to the world of daily personal finance decisions. Our mission is to help you live more richly.\nMotley Fool Money brings financial expertise, trusted advice, and unbiased analysis to the world of daily personal finance decisions. Our mission is to help you live more richly. \n We're firm believers in the Golden Rule, which is why editorial opinions are ours alone and have not been previously reviewed, approved, or endorsed by included advertisers. Motley Fool Money does not cover all offers on the market. Motley Fool Money is 100% owned and operated by The Motley Fool. Our knowledgeable team of personal finance editors and analysts are employed by The Motley Fool and held to the same set of publishing standards and editorial integrity while maintaining professional separation from the analysts and editors on other Motley Fool brands. \n Motley Fool Money is a Motley Fool service that rates and reviews essential products for your everyday money matters.\nCopyright (c) 2018 - 2025 Motley Fool Money. All rights reserved.",
      "ml_hf_summary": "This text appears to be a collection of information about credit cards, specifically focusing on introductory offers and rewards programs. Here's a breakdown:\n\n**Structure:**\n\n* **Comparison Table:** The text presents a table comparing different credit card offerings from various issuers (Capital One, Chase). \n* **Intro APR & Rewards:**  Each card is described with its intro APR (0% for purchases), the duration of this offer, and the rewards program.\n* **Welcome Offers:** Each card also mentions a welcome bonus after spending a certain amount within the first three months.\n* **Motley Fool Money:** The text concludes by mentioning Motley Fool Money, a financial advice service that reviews credit cards and other products.\n\n**Key Information:**\n\n* **Credit Score:**  The text emphasizes that credit score is a factor in approval for these cards. \n* **Intro APR:**  0% introductory APR on purchases is offered for a specific duration (15 months).\n* **Rewards Programs:** Each card offers different rewards programs, including cash back on purchases and travel bookings.\n* **Welcome Bonuses:** A welcome bonus of $200 after spending a certain amount within the first three months is mentioned for each card.\n\n**Overall:** This text appears to be an advertisement or informational piece about credit cards, highlighting their introductory offers and rewards programs. \n\n\nLet me know if you'd like me to elaborate on any specific aspect of this information! \n"
    },
    {
      "title": "It's official: now avoid credit card interest into 2024",
      "link": "https://www.fool.com/the-ascent/credit-cards/landing/citi-simplicity-review/?utm_site=theascent&utm_campaign=ta-cc-co-cnn-citisimp2-ron-5-hp-sfpb&utm_medium=cpc&utm_source=cnn",
      "published": "2025-04-20",
      "summary": "",
      "content": "If you're on a Galaxy Fold, consider unfolding your phone or viewing it in full screen to best optimize your experience.\nCiti Simplicity(r) Card\nThe Citi Simplicity(r) Card sets itself apart with an incredible 0% Intro APR offer for 21 months on Balance Transfers and no annual fee, making it a top pick for anyone looking for ample time to pay off credit card debt.\nOur expert's summary:\nSimply put, if you're looking to pay off debt by avoiding interest on balance transfers for the longest time possible, it's hard to beat this card.\nOn \n Citi's\n Secure Website.\n \n Rates & Fees \n Great for: Balance Transfers\nOn \n Citi's\n Secure Website.\n \n Rates & Fees \n Credit Score: \n Circle with letter I in it. \n Falling within this credit range does not guarantee approval by the issuer. An application must be submitted to the issuer for a potential approval decision. There are different types of credit scores and creditors use a variety of credit scores to make lending decisions.\n \n Good/Excellent (670-850) \n On \n Citi's\n Secure Website.\n \n Rates & Fees \n Best for Balance Transfers\n \n 0% intro APR for 21 months on Balance Transfers is one of the longest interest-free periods available today.\nIntro APR \n Purchases: 0%, 12 months on Purchases \n Balance Transfers: 0%, 21 months on Balance Transfers \n Regular APR\nRewards\nAnnual Fee \n Circle with letter I in it. \n N/A\n \n Welcome Offer \n Circle with letter I in it. \n There is an intro balance transfer fee of 3% of each transfer (minimum $5) completed within the first 4 months of account opening. After that, your fee will be 5% of each transfer (minimum $5).\n \n 0% introductory APR for 21 months on Balance Transfers: One of the longest introductory periods we've come across, you'll get 0% intro APR for a full 21 months on Balance Transfers, which means you'll have almost two years to pay off your balance.0% introductory APR for 12 months on Purchases: You'll also get 0% intro APR for the first 12 months on Purchases. This is a helpful perk if you plan on buying anything with the card.Choose your payment due date: A little flexibility can go a long way when it comes to managing your finances. The card lets you choose from any available payment date, whether it's in the beginning, middle, or end of the month. That way, you can set up automatic payments that are aligned with your paycheck.No late fees: One of the most unique perks is that there are no late fees, ever. While you should always pay your bill on time, because late payments can still affect your credit, it's nice to know that you won't be charged if you do slip up and miss a payment.No penalty APR: If you miss some payments, most credit cards will increase your interest rate to their penalty APR. The Citi Simplicity(r) Card never charges a penalty rate, so your APR isn't at risk of increasing due to late payments.No annual fee: This card comes with no annual fee, which is an important feature if your goal is to pay off debt.\nWith the quality benefits the card offers, it's primarily aimed at consumers who have a credit score of 670 or better. There are reports of people with scores in the mid 600s being approved for this card. For tips on increasing your credit score above 670, click here.\nTIP\nPaying down credit balances is the fastest way to improve your FICO(r) Score. That's because 30% of your credit score is based on how much of your available credit you're using. Your credit utilization is reported monthly, which means paying off debt could improve your credit score in one month!\nIf your priority is a long 0% intro APR for a balance transfer, the Citi Simplicity(r) Card clearly outshines the competition. The 0% intro APR on purchases is also helpful if you have an unexpected large expense and need to spread the cost out over time. \n Rates & Fees \n Our Credit Cards Experts\nMotley Fool Money brings financial expertise, trusted advice, and unbiased analysis to the world of daily personal finance decisions. Our mission is to help you live more richly.\nMotley Fool Money brings financial expertise, trusted advice, and unbiased analysis to the world of daily personal finance decisions. Our mission is to help you live more richly. \n We're firm believers in the Golden Rule, which is why editorial opinions are ours alone and have not been previously reviewed, approved, or endorsed by included advertisers. Motley Fool Money does not cover all offers on the market. Motley Fool Money is 100% owned and operated by The Motley Fool. Our knowledgeable team of personal finance editors and analysts are employed by The Motley Fool and held to the same set of publishing standards and editorial integrity while maintaining professional separation from the analysts and editors on other Motley Fool brands. \n Motley Fool Money is a Motley Fool service that rates and reviews essential products for your everyday money matters.\nCopyright (c) 2018 - 2025 Motley Fool Money. All rights reserved.",
      "ml_hf_summary": "The Citi Simplicity® Card offers a 0% introductory APR of 21 months on balance transfers, making it a strong option for debt consolidation.  This card has no annual fee and allows for flexible payment due dates. The card is designed for individuals with credit scores of 670 or higher, though some reports indicate approval for those with lower scores.  The introductory APR period applies to both balance transfers and purchases, providing flexibility in managing finances. No late fees are charged, and the card does not increase interest rates due to missed payments. The Citi Simplicity® Card is a top choice for individuals seeking to pay off debt without accruing interest charges. \n"
    },
    {
      "title": "0% intro APR until 2024 is 100% insane",
      "link": "https://www.fool.com/the-ascent/credit-cards/landing/wells-fargo-reflect-review/?utm_site=theascent&utm_campaign=ta-cc-co-cnn-welref2-ron-5-hp-sfpb&utm_medium=cpc&utm_source=cnn",
      "published": "2025-04-20",
      "summary": "",
      "content": "If you're on a Galaxy Fold, consider unfolding your phone or viewing it in full screen to best optimize your experience. \n Credit Cards\n\n\n\n Banks\n\n\n\n Brokers\n\n\n\n Crypto\n\n\n\n Mortgages\n\n\n\n Insurances\n\n\n\n Loans\n\n\n\n Podcast\n\n\n\n About Us\n \n Nathan Alderman has been a full-time Motley Fool employee since 2005, making errors his arch-enemies in a variety of roles including a six-year stint as the dedicated fact-checker for The Motley Fool's premium newsletter services. As Motley Fool Money's Compliance Lead, he makes sure that all the site's information is accurate and up to date, which ensures we always steer readers right and keeps various financial partners happy. A graduate of Northwestern University's Medill School of Journalism, Nathan spends his spare time volunteering for civic causes, writing and podcasting for fun, adoring his wife, and wrangling his two very large young children. \n See Full Bio \n The Wells Fargo Reflect(r) Card is good for paying off big purchases or refinancing credit card debt. It has the longest 0% intro APR I've seen, so it's hard to beat for saving on interest. But this card is light on other perks and doesn't have much to offer after the introductory APR ends.\nRead our in-depth Wells Fargo Reflect(r) Card review to learn all about its pros, its cons, and to figure out if it's right for you.\nOn \n Wells Fargo's\n Secure Website.\n \n Rates & Fees \n On \n Wells Fargo's\n Secure Website.\n \n Rates & Fees \n On \n Wells Fargo's\n Secure Website.\n \n Rates & Fees \n Good/Excellent (670-850) \n Intro APR \n Circle with letter I in it. \n 0% intro APR for 21 months from account opening on purchases and qualifying balance transfers\n \n Purchases: 0% intro APR, 21 months from account opening \n Balance Transfers: 0% intro APR, 21 months from account opening on qualifying balance transfers \n Regular APR \n 17.24%, 23.74%, or 28.99% Variable APR\n \n Rewards \n N/A \n Annual Fee\n \n $0 \n Welcome Offer \n N/A\nThis no-frills card is a solid choice if your priority is to avoid credit card interest for as long as possible. It offers an incredible intro APR. The balance transfer fee (5%; $5 min.) is higher than some cards, but if you want an equally long intro APR on purchases, this card is hard to beat.\nWe recommend comparing options to ensure the card you're selecting is the best fit for you. To make your search easier, here's a short list of standout credit cards.\nOn \n Discover's\n Secure Website.\n \n Rates & Fees \n Intro: \n Purchases: 0%, 15 months \n Balance Transfers: 0%, 15 months \n Regular:\n18.24% - 27.24% Variable APR \n On \n Discover's\n Secure Website.\n \n Rates & Fees \n On \n Wells Fargo's\n Secure Website.\n \n Rates & Fees \n Intro: \n Circle with letter I in it. \n 0% intro APR for 12 months from account opening on purchases and qualifying balance transfers\n \n Purchases: 0% intro APR, 12 months from account opening \n Balance Transfers: 0% intro APR, 12 months from account opening on qualifying balance transfers \n Regular:\n19.24%, 24.24%, or 29.24% Variable APR \n On \n Wells Fargo's\n Secure Website.\n \n Rates & Fees \n On \n Bank of America's\n Secure Website.\n \n Intro: \n Circle with letter I in it. \n 0% Intro APR for 15 billing cycles for purchases. 0% Intro APR for 15 billing cycles for any balance transfers made in the first 60 days. After the intro APR offer ends, 18.24% - 28.24% Variable APR on purchases and balance transfers will apply. A 3% fee for 60 days from account opening, then 4% fee applies to all balance transfers. Balance transfers\n \n may not be used to pay any account provided by Bank of America. \n Purchases: 0% Intro APR for 15 billing cycles for purchases \n Balance Transfers: 0% Intro APR for 15 billing cycles for any balance transfers made in the first 60 days \n Regular:\n18.24% - 28.24% (Variable) \n On \n Bank of America's\n Secure Website.\n \n If you need a 0% intro APR for as long as possible, then the Wells Fargo Reflect(r) Card is worth getting. It gives you plenty of time to pay off purchases and balance transfers without incurring interest charges. Those who can make do with a shorter intro APR period should look for cards with more benefits, such as cash rewards and a welcome offer.\nThe nice thing about credit cards with a 0% intro APR is that it's easy to compare them. The key factor is how long the intro rate lasts -- on purchases, balance transfers, or both, depending on what you need the card for. For example, if you have a lot of debt and are looking for a way to refinance it, then you'd probably want to go with the card that has the longest 0% intro APR on balance transfers. Wells Fargo has done a great job in this regard. Not only does this card have a lengthy introductory period, it applies to purchases and balance transfers. \n Rates & Fees \n Want to know what other sites and real cardholders think of the Wells Fargo Reflect(r) Card? Here's what we found.\nAverage review site rating: 4.1 / 5 stars\nAfter reading reviews from five other top sites, there's a pretty clear consensus about this Wells Fargo card. We all agree that the 0% intro APR offer is excellent, making it one of the best credit cards for avoiding interest, and that the cellphone protection is a valuable extra.\nEveryone's in agreement about this card's drawbacks, too: Lack of rewards, a high balance transfer fee, and a foreign transaction fee. The only difference of opinion is the overall rating each of us gave this card.\nThe Wells Fargo Reflect(r) Card hasn't exactly set the social media world on fire, but responses have generally been positive. It's widely recognized as an excellent 0% intro APR and balance transfer card.\nSome cardholders have called out the balance transfer fee of 5%, min: $5, since that's more than the 3% charged by several other cards. But they also acknowledge that 21 months from account opening is a long time to pay off credit card debt.\nIf you need to avoid interest charges for as long as possible, look no further. The Wells Fargo Reflect(r) Card has a 0% intro APR on purchases and qualifying balance transfers for 21 months from account opening. That's nearly two years where you won't be paying credit card interest.\nBalance transfers made within the first 120 days qualify for the intro rate. After the intro period ends, the go-to 17.24%, 23.74%, or 28.99% Variable APR applies on your card's balance going forward.\nThis is the longest 0% intro APR I've seen. Since it applies to purchases and balance transfers, there are all kinds of ways to use it. You could:\nConsidering how much smartphones cost, and the many hazards they seem to face, it's a good idea to have yours insured. They may seem affordable when you're paying them off across 24 monthly payments. When you lose one and need to pay MSRP for a new iPhone, that's when you realize it costs about as much as a rent payment.\nIf you have this card and use it to pay your monthly cellphone bill, you won't need to shell out extra for insurance. It has complimentary cellphone protection of up to $600, with a $25 deductible. This covers damage, theft, and involuntary or accidental parting (when you know where your phone is, but it's impractical to recover it).\nThe biggest drawback with this card is that it doesn't offer any sort of rewards program. That means:\nTo be fair, this card has special offers through My Wells Fargo Deals, where you can earn cash back statement credits on shopping, dining, and experiences you pay for with your eligible Wells Fargo card. But earning some statement credits here and there isn't nearly as valuable as earning cash rewards on all your everyday purchases.\nBecause of the lack of rewards, this card doesn't have much long-term value. Once the 0% intro APR ends, there's no incentive to continue using it. You're better off switching to a rewards credit card at that point.\nIt's worth noting that there are 0% APR credit cards that also have rewards programs. They just have shorter 0% APR intro periods. If you don't need the entire 21 months from account opening this Wells Fargo card offers, then it could make more sense to pick a card with a shorter intro period that earns rewards.\nThe Wells Fargo Reflect(r) Card is a great balance transfer card because of its 0% intro APR. But it also has a balance transfer fee of 5%, min: $5.\nBalance transfer cards normally have a fee like this, but some of them only charge 3%. It may not seem like much, but if you're transferring $5,000, that 2% difference would cost you an extra $100. If you don't need 21 months from account opening to get out of debt, you may want to look at more credit card reviews and pick a card with a lower balance transfer fee.\nThere's also a foreign transaction fee of 3%, which is another reason why this isn't the best card for long-term use. If you ever travel outside the United States, it's important to have a card you can use without any extra fees, like a travel credit card\nA FICO(r) Score of 670 or higher, which is considered good credit, is suggested to apply for the Wells Fargo Reflect(r) Card. Keep in mind that credit card applications depend on many factors, including your income and other parts of your financial profile.\nWells Fargo offers an online prequalification tool. All you need to do is provide some basic information, and you'll see any prequalified credit card offers you have with Wells Fargo, which may or may not include the Wells Fargo Reflect(r) Card.\nThe Wells Fargo Reflect(r) Card has a 0% intro APR for 21 months from account opening on purchases and qualifying balance transfers. Balance transfers made within 120 days from account opening qualify for the introductory rate.\nHere are the fees for the Wells Fargo Reflect(r) Card:\nThe minimum credit limit on the Wells Fargo Reflect(r) Card is $1,000. It's possible to get a much larger amount -- some cardholders have reported being approved for limits of over $25,000. When you're approved for this card, Wells Fargo sets a credit limit based on several factors, primarily your income and credit history.\nAt Motley Fool Money, we rate credit cards on a five-star scale (1 = poor, 5 = best). Our rating criteria includes rewards rates, welcome bonuses, fees, and perks like travel credits and 0% intro APR offers to evaluate our ratings.\nWe combine these factors with an evaluation of brand reputation and customer satisfaction to ensure you're getting the best card recommendations. Learn more about how Motley Fool Money rates credit cards.\nIt's not hard to get approved for the Wells Fargo Reflect(r) Card, but it depends on your credit score and your financial profile. A credit score of 670 or higher is recommended when applying to make it more likely that you qualify for the card.\nThe credit limit for the Wells Fargo Reflect(r) Card can range from $1,000 to over $10,000. Wells Fargo sets your credit limit when it approves you for the card based on your creditworthiness, income, and other financial information.\nNo, the Wells Fargo Reflect(r) Card doesn't have an annual fee. \n We're firm believers in the Golden Rule, which is why editorial opinions are ours alone and have not been previously reviewed, approved, or endorsed by included advertisers. Motley Fool Money does not cover all offers on the market. Motley Fool Money is 100% owned and operated by The Motley Fool. Our knowledgeable team of personal finance editors and analysts are employed by The Motley Fool and held to the same set of publishing standards and editorial integrity while maintaining professional separation from the analysts and editors on other Motley Fool brands. \n Terms may apply to offers listed on this page. \n The Motley Fool owns shares of and recommends Visa.\n \n Motley Fool Money is a Motley Fool service that rates and reviews essential products for your everyday money matters.\nCopyright (c) 2018 - 2025 Motley Fool Money. All rights reserved.",
      "ml_hf_summary": "This text provides a comprehensive overview of the Wells Fargo Reflect® Card, covering its features, benefits, drawbacks, and eligibility requirements. Here's a breakdown:\n\n**Key Features:**\n\n* **0% Intro APR for 21 Months:**  Offers a 0% interest rate on purchases and qualifying balance transfers for up to 21 months.\n* **Balance Transfer Fee:** A 5% fee (minimum $5) applies to balance transfers, which can be higher than some competitors.\n* **Foreign Transaction Fee:** 3% foreign transaction fee applies when making purchases or using the card abroad.\n* **No Annual Fee:**  The card doesn't have an annual fee.\n\n**Benefits:**\n\n* **Debt Consolidation:** The 0% intro APR makes it ideal for consolidating high-interest debt and paying off balances without accruing interest.\n* **Travel Rewards:** While not a primary focus, the card offers travel rewards through its partnership with Chase Ultimate Rewards.\n* **Flexibility:**  The card allows for both purchases and balance transfers, providing flexibility in managing finances.\n\n**Drawbacks:**\n\n* **Balance Transfer Fee:** The 5% fee can be significant if you're transferring large balances.\n* **Limited Rewards Program:** While the card offers rewards, they are not as extensive or lucrative as some other credit cards with higher reward rates and bonus categories.\n* **Foreign Transaction Fee:**  The 3% foreign transaction fee adds an extra cost when making purchases abroad.\n\n**Eligibility Requirements:**\n\n* **Credit Score:** A minimum FICO score of 670 is recommended for approval.\n* **Income & Financial Profile:** Wells Fargo considers your income and other financial factors to determine credit limit.\n\n\n**Overall:**\n\nThe Wells Fargo Reflect® Card offers a valuable opportunity for those seeking debt consolidation or balance transfers with a 0% intro APR period. However, it's crucial to weigh the potential benefits against the drawbacks, particularly the high balance transfer fee and foreign transaction fees.  It's recommended to compare this card with other options in the market before making a decision.\n\n\n**Additional Notes:**\n\n* **Motley Fool Money Review:** The text mentions Motley Fool Money's review of the card, which provides insights into its features, benefits, and drawbacks based on their expertise.\n* **Terms & Conditions:** Always refer to the official terms and conditions for detailed information about fees, eligibility requirements, and other relevant details. \n\n\nRemember that this is just a summary of the provided text. It's essential to conduct thorough research and compare offers before making any financial decisions."
    },
    {
      "title": "US Supreme Court halts deportation of detained Venezuelans",
      "link": "https://www.bbc.com/news/articles/czd3rdjn81lo",
      "published": "2025-04-19",
      "summary": "The accused gang members are being sent to a notorious jail in El Salvador under a 19th-Century law.",
      "content": "The US Supreme Court has ordered the Trump administration to pause the deportation of a group of alleged Venezuelan gang members.\nA civil liberties group had sued to stop the removal of the men, currently in detention in Texas, saying they had not been able to contest their cases in court.\nDonald Trump has sent accused Venezuelan gang members to a notorious prison in El Salvador, invoking the 1798 Alien Enemies Act, which gives the president power to detain and deport natives or citizens of \"enemy\" nations without usual processes. The act was previously used only three times, all during war. \nThe White House called challenges to using the law for mass deportations \"meritless litigation\".\n\"We are confident in the lawfulness of the administration's actions and in ultimately prevailing against an onslaught of meritless litigation brought by radical activists who care more about the rights of terrorist aliens than those of the American people,\" White House Press Secretary Karoline Leavitt wrote in a post on X.\nThe Alien Enemies Act was last invoked in World War Two, when people of Japanese descent were imprisoned without trial and thousands sent to internment camps.\nSince taking office in January, Trump's hard-line immigration policies have encountered a number of legal hurdles.\nTrump had accused Venezuelan gang Tren de Aragua of \"perpetrating, attempting, and threatening an invasion or predatory incursion\" on US territory.\nOut of 261 Venezuelans deported to El Salvador as of 8 April, 137 were removed under the Alien Enemies Act, a senior administration official told CBS News, the BBC's US news partner.\nA lower court temporarily blocked these deportations on 15 March.\nThe Supreme Court initially ruled on 8 April that Trump could use the Alien Enemies Act to deport alleged gang members, but deportees must be given a chance to challenge their removal.\nThe lawsuit that resulted in Saturday's order said the Venezuelans detained in north Texas had been given notices about their imminent deportation in English, despite one detainee only speaking Spanish. \nThe challenge by the American Civil Liberties Union (ACLU) also said the men had not been told they had a right to contest the decision in court.\n\"Without this Court's intervention, dozens or hundreds of proposed class members may be removed to a possible life sentence in El Salvador with no real opportunity to contest their designation or removal,\" the lawsuit read.\nSupreme Court Justices Clarence Thomas and Samuel Alito dissented on Saturday.\nIn his second inaugural address in January, Trump pledged to \"eliminate the presence of all foreign gangs and criminal networks bringing devastating crime to US soil\".\nIn the highest-profile case, the government admitted it mistakenly deported El Salvador national Kilmar Abrego Garcia, but contends he is a member of the MS-13 gang, which his lawyer and family denies. Mr Abrego Garcia has never been convicted of a crime.\nThe Supreme Court unanimously ruled that the government should facilitate bringing back Mr Abrego Garcia, but the Trump administration has said he will \"never\" live in the US again.\nSenator Chris Van Hollen, a Democrat from Maryland, visited Mr Abrego Garcia in El Salvador and said he had been moved from the mega-jail Cecot (Terrorism Confinement Centre) to a new prison.\n\"Olo\" is said to be a saturated blue-green - but some say the existence of a new colour is \"open to argument\".\nIranian and US officials agree to continue with a third round of high-stakes talks on a new nuclear deal.\nThe wartime Alien Enemies Act has been controversially used to deport Venezuelans to a mega-jail in El Salvador.\nWhat is happening with US bonds, why Donald Trump cares and how ordinary Americans could be affected. \nThe US says the attack on the Red Sea coast aimed to restrict supplies and funds for the Houthis, who called it a war crime.\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.\n ",
      "ml_hf_summary": "The US Supreme Court ordered the Trump administration to pause deportations of Venezuelan gang members, citing concerns over their lack of opportunity to contest their cases in court. The administration invoked the 1798 Alien Enemies Act, which allows for detention and deportation of individuals from \"enemy\" nations without usual legal processes, a move previously used only during wartime.  The Supreme Court initially allowed the deportations but mandated that detainees be given a chance to challenge their removal. A total of 261 Venezuelans have been deported under this act as of April 8th, with 137 being removed using the Act. The ACLU filed a lawsuit challenging the process, arguing that the men were not informed of their right to contest the decision and were given notices in English despite some speaking Spanish.  \n"
    },
    {
      "title": "Robots race in Chinese half marathon",
      "link": "https://www.bbc.com/news/videos/ce8gz5vl2z1o",
      "published": "2025-04-19",
      "summary": "The Yizhuang half marathon is the first time robots have raced alongside humans over such a distance.",
      "content": "Robots ran alongside humans at the Yizhuang half marathon in Beijing on Saturday. \nTwenty-one humanoid robots, designed by Chinese manufacturers, raced next to thousands of runners completing the 21km (13-mile) course. \nThe winner was Tiangong Ultra, which crossed the line in two hours, 40 minutes and 42 seconds. \nSome robots completed the race, while others struggled from the beginning. One robot fell at the starting line and lay flat for several minutes before getting up and taking off. \nThe race had been billed as the world's first robot half marathon.\nVideo edited by Jack Burgess and Anna Lamche\nMore than 3,000 people have been confirmed dead after last week's earthquake and the toll is expected to rise. \n South Korea's constitutional court has unanimously voted to uphold the impeachment of president Yoon Suk Yeol.\nThe constitutional court voted unanimously to uphold president Yoon's impeachment following his short-lived declaration of martial law.\nMount Marapi erupted on Thursday, sending a column of ash towering into the sky.\nThe BBC's Nikhil Inamdar explains how US President Donald Trump's tariffs could impact India. \nThe BBC's Yogita Limaye is the first foreign journalist to enter the country since the disaster struck.\nThe BBC speaks to people in Mandalay close to where Myanmar's deadly 7.7 magnitude earthquake struck.\nMyanmar's military government says at least 2,000 people were killed in last week's 7.7 magnitude quake.\nThe BBC is in Myanmar's capital Nay Pyi Taw to see the destruction caused by the devastating earthquake.\nDozens of workers were trapped when the building collapsed after a huge earthquake hit neighbouring Myanmar.\nRescuers in Myanmar were cheered as they carried 30-year-old Phyu Lay Khaing away on a stretcher.\nDozens remain unaccounted for after the 33-storey building, which was under construction, gave way on Friday when a powerful earthquake struck neighbouring Myanmar.\nA woman was seen giving birth to a baby shortly after evacuating from a hospital.\nA car dashcam has captured the moment a building collapsed in Bangkok following an earthquake.\nBBC Verify has been checking dozens of videos of damage and destruction following the earthquake in Myanmar.\nThe top of Myanmar's Shwe Sar Yan Pagoda, south-east of Mandalay, collapsed following an earthquake.\nVideo shows damage to the Ava Bridge, near Mandalay, after a 7.7-magnitude earthquake rocked central Myanmar.\nBBC journalist recounts moments after Bangkok building collapse\nBBC journalist recounts moments after Bangkok building collapse\nA strong 7.7 magnitude earthquake has hit central Myanmar, the United States Geological Survey says.\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.\n ",
      "ml_hf_summary": "A robot race took place at the Yizhuang half marathon in Beijing, with 21 humanoid robots competing alongside human runners. The winner was Tiangong Ultra, completing the course in 2 hours, 40 minutes and 42 seconds.  The event was billed as the world's first robot half marathon.  Meanwhile, a devastating earthquake struck central Myanmar, resulting in over 2,000 confirmed deaths and widespread destruction. The earthquake also caused a building collapse in Bangkok, trapping dozens of workers.  \n"
    },
    {
      "title": "Five dead as huge waves hit Australia coast",
      "link": "https://www.bbc.com/news/articles/c1jx9dknd6go",
      "published": "2025-04-19",
      "summary": "Two other people are missing, as officials urge people to take caution as a surf warnings remain.",
      "content": "Five people have drowned after huge waves hit parts of Australia at the start of the Easter weekend.\nTwo others are missing off the coasts of New South Wales and Victoria states.\nOn Saturday the body of a man was found in the water near Tathra in southern New South Wales. It came a day after a 58-year-old fisherman and two other men were found dead in separate incidents in the state.\nRescuers are searching for a man who was washed into the water near Sydney. Also on Friday, one woman drowned and a man is missing after their group was swept into sea in San Remo in Victoria. \n\"One of the women managed to make her way back to shore but the other woman and the man were unable to,\" Victoria police said.\nVictoria Premier Jacinta Allan said it marked a \"awful start\" to the Easter weekend.\n\"My thoughts are with the family of someone who has lost their life in such tragic circumstances, and potentially there is more difficult news to come,\" she said.\nAustralia's eastern states have been battered by dangerous waves.\nThe head of the charity Surf Life Saving Australia, Adam Weir, advised holidaymakers to visit patrolled beaches after their data showed 630 people had drowned at unpatrolled beaches in the past 10 years.\n\"But these coastal locations can present dangers, some that you can see and some that you can't, which is why we have some simple advice: Stop, Look, Stay Alive.\"\nAustralia all-rounder Cameron Green explains how his time out injured helped him deal with his chronic kidney condition.\nPeter Dutton is facing outrage after comments he made on climate change during an election debate.\nThe men were found by a rescue helicopter, as was an Australian who is being treated in hospital.\nThe BBC spoke to people in Sydney about Australia's housing crisis and what they'd like to see politicians to do help.\nAustralia's housing crisis has hit its worst point in decades, becoming a key issue in the upcoming election.\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.\n ",
      "ml_hf_summary": "Five people have drowned in Australia during the Easter weekend due to dangerous waves, with two others missing off the coasts of New South Wales and Victoria states.  A man's body was found near Tathra, New South Wales on Saturday, following the deaths of three men in separate incidents earlier in the week. Rescuers are searching for a man who was washed into the water near Sydney, while another woman drowned and a man is missing after being swept away by waves in San Remo, Victoria. Surf Life Saving Australia advises holidaymakers to visit patrolled beaches due to the high number of drownings at unpatrolled locations. \n"
    },
    {
      "title": "Myanmar's capital Nay Pyi Taw to be redrawn following earthquake",
      "link": "https://www.bbc.com/news/articles/clyq0v25dm6o",
      "published": "2025-04-19",
      "summary": "The BBC has seen evidence indicating about 70% of government buildings were damaged by the quake in the capital.",
      "content": "The layout of Myanmar's capital city Nay Pyi Taw will be redrawn after the devastating earthquake last month, the country's military ruler has said. \nDuring a government meeting, Senior General Min Aung Hlaing said that buildings which collapsed during the earthquake were so badly affected because they were built on soft soil. \nOffice buildings will be rebuilt and must be resistant to future earthquakes, he said, with tests on soil also being conducted before any rebuilding is done. \nThe BBC has seen evidence indicating about 70% of government buildings were damaged by the quake in the capital, and some offices have reportedly been moved to Yangon. \nMyanmar was devastated by a huge earthquake which hit the country on 28 March. The 7.7 magnitude quake was so strong it was felt in Thailand and south-west China. \nAccording to state media, over 3,500 people were killed and 5,012 were injured in Myanmar as a result of the quake. \nThe city of Nay Pyi Taw covers at least four times the area of London, but with only a fraction of the people. Its history is short: it has only existed since 2005, raised out of the flatlands by the then military rulers of Myanmar, which was previously known as Burma. \nThe name Nay Pyi Taw means \"seat of the king\". The reasons for moving the capital some 370km inland from the largest city, Yangon, have never been entirely clear.\nThe city bears all the hallmarks of a planned capital: the road leading from parliament to the presidential palace is 20 lanes wide, but carries hardly any traffic. Shiny shopping malls and empty luxury hotels line the boulevards. There's a safari park, a zoo, and at least three stadiums. \nSince 2021, Myanmar has been plagued by civil war between the junta, which seized power in a military coup, and ethnic militias and resistance forces across the country. \nA 20-day ceasefire was declared by the military council on 2 April, following the announcement of a pause in hostilities by an alliance made up of three rebel groups. \nThe ceasefires were announced to help relief efforts, but the military has reportedly continued to attack rebel-held areas. \nThe military council's photo archives show that several government buildings, including the Ministry of Labour, Ministry of Planning and the Court of the Union were severely damaged in the earthquake. \nMost of the buildings are still in ruins as repair work on them has not yet started. \nThe removal of important government documents has reportedly been ordered, along with equipment and other moveable items. \nReconstruction of the buildings could take years, and as a result, the Ministry of Foreign Affairs and the Ministry of Tourism have reportedly moved their offices to the former capital Yangon - 366km (228m) away. \nOther departments are relocating their offices to open air halls called \"hotai\" in Nay Pyi Taw, which are built with steel frames. \nSocial media posts written by staff at the National Museum in Nay Pyi Taw say they have moved inscriptions and manuscripts and are trying to save as many as possible of the tens of thousands of books, along with literature and computers. \nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.\n ",
      "ml_hf_summary": "Following a devastating 7.7 magnitude earthquake in Myanmar on March 28th, which caused significant damage to buildings in Nay Pyi Taw, the country's military ruler, Senior General Min Aung Hlaing, announced plans for rebuilding and redesign of the capital city.  The earthquake damaged approximately 70% of government buildings, with some offices relocated to Yangon. The city was established as the new capital in 2005 and is characterized by its planned layout, including wide roads and numerous empty structures.  Over 3,500 people were killed and 5,012 injured in the earthquake, prompting the relocation of government departments to temporary locations like open-air halls in Nay Pyi Taw. Reconstruction efforts are expected to take years, with some offices already moved to Yangon. \n"
    },
    {
      "title": "Hopes for Iran nuclear talks tempered by threats and mixed messages",
      "link": "https://www.bbc.com/news/articles/cwy7n905jqdo",
      "published": "2025-04-19",
      "summary": "Iranian and US officials agree to continue with a third round of high-stakes talks on a new nuclear deal.",
      "content": "Iran and the US have held a second round of high-stakes nuclear talks in Rome - and agreed to meet again next week - even as hopes for de-escalation are tempered by mounting military threats and mixed messages.\nUS President Donald Trump reminds Tehran nearly every day of its options: a deal or war.\nHe has previously said Israel would lead a military response if the talks failed.\nOn Wednesday, the New York Times reported that Trump had \"waved off\" an Israeli plan to strike Iranian nuclear sites as early as next month.\n\"I wouldn't say waved off. I'm not in a rush to do it,\" Trump told reporters in response to the article on Thursday, adding that he preferred to give diplomacy a chance.\n\"I think that Iran has a chance to have a great country and to live happily without death... That's my first option. If there's a second option, I think it would be very bad for Iran.\" \nAfter both sides described the first round of talks in Oman last weekend as constructive, Trump had said he would be \"making a decision on Iran very quickly\".\nIn 2018, Trump pulled the US out of a 2015 agreement which saw Iran limit its nuclear activities and allow inspections by the International Atomic Energy Agency (IAEA) in return for sanctions relief.\nHe said it did too little to stop Iran's potential pathway to a nuclear weapon and reinstated US sanctions as part of a \"maximum pressure\" campaign to compel Iran to negotiate a new deal.\nHowever, Iran refused and increasingly breached restrictions in retaliation. It has now stockpiled enough highly-enriched uranium to make several bombs if it chose to do so - something it says it would never do.\nThe threat of military action appears to have played a role in bringing Iran back to the negotiating table. Yet it insists that is not the reason.\nThe website of the Supreme Leader, Ayatollah Ali Khamenei, said Iran had agreed to talks only because the US limited its demands strictly to nuclear issues - not out of fear of US and Israeli strikes.\nEven so, reaching a deal remains far from certain.\nTrump's Special Envoy to the Middle East Steve Witkoff, who is leading the US negotiating team, posted on X on Tuesday: \"Any final arrangement must set a framework for peace, stability, and prosperity in the Middle East - meaning that Iran must stop and eliminate its nuclear enrichment and weaponization programme.\"\nIt came just a day after he had suggested in an interview with Fox News that Iran would be allowed to continue enriching uranium.\n\"They do not need to enrich past 3.67%,\" he said, referring to the limit set by the 2015 nuclear deal. \n\"This is going to be much about verification on the enrichment programme and then ultimately verification on weaponization.\"\nIran's Foreign Minister Abbas Araghchi, the head of the Iranian delegation, responded by noting Witkoff's \"contradictory statements\" and stressing that \"real positions will be made clear at the negotiating table\".\n\"We are ready to build trust regarding possible concerns over Iran's enrichment, but the principle of enrichment is not negotiable,\" he said. \nSaturday's talks in Rome come amid a flurry of diplomatic activity.\nSaudi Arabia's Defence Minister, Prince Khalid bin Salman, visited Tehran on Thursday, delivering a personal message from his father King Salman to Ayatollah Khamenei. He also met Iran's President, Masoud Pezeshkian.\nIran has warned that any US military action would be met with retaliation against American bases in the region - many of them hosted by Iran's Arab neighbours.\nAt the same time, Araghchi visited Moscow and handed a letter from Khamenei to Russian President Vladimir Putin.\nIran and Russia have strengthened their military ties since the start of the war in Ukraine, with Tehran accused of supplying drones to support Moscow's war effort.\nThe Russian parliament ratified a 20-year strategic partnership between Iran and Russia 10 days ago. However, the deal does not include a mutual defence clause.\nMeanwhile, IAEA chief Rafael Grossi completed a two-day visit to Tehran this week, meeting Iranian nuclear officials and the foreign minister in a bid to ease tensions and restore inspection protocols.\nSince Trump returned to office this year, Ayatollah Khamenei has consistently denounced negotiations with Washington.\n\"Negotiating with this administration is not logical, not wise, nor honourable,\" he said in a February speech, just two months before agreeing to the current round of talks.\nThe supreme leader's distrust stems from Trump's withdrawal from the nuclear deal, the \"maximum pressure\" campaign that followed, and the assassination of General Qassem Soleimani in a US strike in Iraq in 2020.\nAyatollah Khamenei expressed satisfaction with the first round of talks, saying it was \"implemented well\".\nBut he cautioned that he was \"neither overly optimistic nor overly pessimistic\".\nHe has also previously warned that Iran would retaliate in the event of strikes on its nuclear programme.\nSome officials, including his adviser Ali Larijani, have even said that Iran might be \"forced\" to acquire a nuclear weapon if attacked.\n\"We are not pursuing weapons, and we have no problem with IAEA oversight - even indefinitely. But if you resort to bombing, Iran will have no choice but to reconsider. That is not in your interest,\" Larijani told state TV earlier this month.\nEach side is pushing its own narrative about how the talks are being conducted.\nThe US says they are direct. Iran says they indirect, and that Oman is mediating by exchanging written notes.\nAfter the first round in Muscat, Araghchi acknowledged he had a brief exchange with Witkoff \"out of diplomatic courtesy\" after crossing paths.\nUS news website Axios, citing sources, reported the two chief negotiators spoke for up to 45 minutes.\nTehran prefers secrecy. Washington seeks publicity.\nAfter both sides put out positive statements about the first round, Iran's currency surged by 20%.\nIran's leadership is well aware of public discontent over the country's harsh economic conditions - and the potential for protests it may trigger.\nFor the Islamic Republic, the fear is not just over bombs - it's protests too.\nThe accused gang members are being sent to a notorious jail in El Salvador under a 19th-Century law.\n\"Olo\" is said to be a saturated blue-green - but some say the existence of a new colour is \"open to argument\".\nThe wartime Alien Enemies Act has been controversially used to deport Venezuelans to a mega-jail in El Salvador.\nWhat is happening with US bonds, why Donald Trump cares and how ordinary Americans could be affected. \nSen Chris Van Hollen returned from El Salvador and spoke about his time meeting with Kilmar Abrego Garcia.\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.\n ",
      "ml_hf_summary": "Iran and the US held a second round of nuclear talks in Rome, agreeing to meet again next week.  Despite hopes for de-escalation, tensions remain high with both sides threatening military action if negotiations fail. The US under President Trump has been pushing for a new deal with Iran, while Iran insists on maintaining its nuclear program and is wary of US threats.  The talks follow the first round in Oman last weekend, which was described as constructive by both sides.  Iran's Foreign Minister Abbas Araghchi emphasized that Iran will not negotiate about enriching uranium, while US Special Envoy Steve Witkoff stated that any deal must address Iran's nuclear program and prevent weaponization. The IAEA chief visited Tehran to ease tensions and restore inspection protocols.  The talks come amid a flurry of diplomatic activity, including visits from Saudi Arabia's Defence Minister and the Russian President.  Iran has warned of retaliation against US bases in the region if attacked, while Russia continues to strengthen its military ties with Iran. \n"
    },
    {
      "title": "The forgotten Indian explorer who uncovered an ancient civilisation",
      "link": "https://www.bbc.com/news/articles/c1k4v4xvpxlo",
      "published": "2025-04-19",
      "summary": "Rakhaldas Banerjee is credited with discovering Mohenjo-daro, but his legacy is tainted by controversy.",
      "content": "An Indian archaeologist, whose career was marked by brilliance and controversy, made one of the world's greatest historical discoveries. Yet he remains largely forgotten today.\nIn the early 1900s, Rakhaldas Banerjee (also spelled Banerji) unearthed Mohenjo-daro - meaning \"mound of the dead men\" in the Sindhi language - in present-day Pakistan. It was the largest city of the thriving Indus Valley (Harappan) Civilisation, which stretched from north-east Afghanistan to north-west India during the Bronze Age.\nBanerjee, an intrepid explorer and talented epigraphist, worked for the Archaeological Survey of India (ASI) when the country was under British colonial rule. He spent months travelling to distant corners of the subcontinent, looking for ancient artefacts, ruins and scripts.\nBut while his discovery of Mohenjo-daro was ground-breaking, Banerjee's legacy is clouded by disputes. His independent streak and defiance of colonial protocols often landed him in trouble - tainting his reputation and perhaps even erasing parts of his contribution from global memory.\nInterestingly, Banerjee's reports on Mohenjo-daro were never published by the ASI. Archaeologist PK Mishra later accused then ASI chief John Marshall of suppressing Banerjee's findings and claiming credit for the discovery himself.\n\"The world knows Marshall discovered the civilisation's ruins and it is taught in institutions. Banerjee is an insignificant footnote,\" Prof Mishra told the Times of India newspaper. \nIn her book, Finding Forgotten Cities: How the Indus Civilization Was Discovered, historian Nayanjot Lahiri writes that Banerjee \"lacked diplomacy and tact and displayed a high-handedness that ruffled feathers\". Her book also sheds light on the controversies he was embroiled in during his time at the ASI.\nShe notes how once, he attempted to procure inscriptions and images from a museum in north-east India without the approval or knowledge of his boss. \nAnother time, Banerjee attempted to relocate some stone sculptures from a museum in Bengal to the one he was stationed at without the necessary permissions. \nIn another instance, he purchased an antique painting for a sum without consulting his superiors who thought he'd paid more than was necessary.\n\"Banerjee's many talents seemed to include being always able to rub people the wrong way,\" Lahiri writes.\nBut Banerjee remains a prominent figure among world historians and scholars in Bengal because of his connection with Mohenjo-daro. \nHe was born in 1885 to a wealthy family in Bengal.\nThe medieval monuments that dotted Baharampur, the city he grew up in, kindled his interest in history and he pursued the subject in college. But he always had an adventurous streak.\nOnce, when he was tasked with writing an essay about the Scythian period of Indian history, he travelled to a museum in a neighbouring state to study first-hand sculptures and scripts from that era.\nIn her book, The Life and Works of Rakhaldas Banerji, author Yama Pande notes how Banerjee joined the ASI as an excavation assistant in 1910 and rose quickly within the ranks to become a superintending archaeologist in western India in 1917.\nIt was in this post that he first set eyes on Mohenjo-daro in Sindh in 1919. In the following years, he conducted a series of excavations at the site that revealed some of the most fascinating finds: ancient Buddhist stupas, coins, seals, pots and microliths.\nBetween 1922 and 1923, he discovered several layers of ruins that held clues about various urban settlements that had emerged in the region, but most importantly, the oldest one that had existed some 5,300 years ago - the Indus Valley Civilisation. \nAt that time, historians had not yet discovered the full scale of the Indus Civilisation which, we now know, covered an expanse of approximately 386,000 sq miles (999,735 sq km) along the Indus river valley.\nThree seals from Banerjee's excavation bore images and scripts similar to those from Harappa in the Punjab province in present-day Pakistan. This helped establish a link between the two sites, shedding light on the vast reach of the Indus Valley civilisation. \nBut by 1924, Banerjee's funds for the project had dried up and he was also transferred to eastern India. He had no further contact with the site, nor did he participate in any excavations there, Pande writes in her book.\nBut Nayanjot Lahiri notes that Banerjee was transferred at his own request, after becoming entangled in questions over his spending. He had failed to account for several job-related expenses.\nIt was also revealed that Banerjee had used excavation grants to buy office furniture and his travel expenses were deemed excessive.\nHis explanations failed to convince his superiors and disciplinary action was recommended. After some negotiation, Banerjee was granted his request and transferred to another region.\nBanerjee continued to work with the ASI in eastern India. He spent most of his time in Calcutta (now Kolkata) and oversaw the restoration work of many important monuments.\nHe resigned from the ASI in 1927, but his departure was marred by controversy. In the years prior to his departure, he became the prime suspect in a case of idol theft.\nIt all started in October 1925, when Banerjee had visited a revered Hindu shrine in Madhya Pradesh state that housed a stone idol of a Buddhist goddess. Banerjee was accompanied by two low-ranking assistants and two labourers, Lahiri notes in her book.\nHowever, following their visit, the idol went missing, and Banerjee was implicated in its theft. He denied any involvement in the disappearance and an investigation was launched.\nThe idol was later recovered in Calcutta. Though the case against Banerjee was dismissed and the charges were found to be unsubstantiated, Marshall insisted on his resignation.\nAfter leaving the ASI, Banerjee worked as a professor, but faced financial difficulties because of his lavish lifestyle.\nHistorian Tapati Guha-Thakurta told the Telegraph newspaper that Banerjee splurged on good food, horse carriages and friends. In 1928, he joined the Banaras Hindu University (BHU) as a professor. He died just two years later at the age of 45.\nFollow BBC News India on Instagram, YouTube, Twitter and Facebook.\nModi said he discussed with Musk India's potential to collaborate with the US on technology.\nHarpreet Singh is wanted by Indian authorities for his alleged role in terror attacks in Punjab state.\nOla, once a rising star, is facing falling sales amid rising competition and regulatory scrutiny. \nThe company has halted taxi bookings after allegations of fund diversion by India's market regulator.\nThe visit comes as India and US continue high-stakes talks to finalise a bilateral trade deal. \nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.\n ",
      "ml_hf_summary": "Rakhaldas Banerjee, an Indian archaeologist, made a groundbreaking discovery in the early 1900s when he unearthed Mohenjo-daro, one of the largest cities of the Indus Valley Civilization.  He worked for the Archaeological Survey of India (ASI) during British colonial rule and conducted extensive excavations at the site, revealing artifacts like Buddhist stupas, coins, seals, and microliths.  Banerjee's findings helped establish a link between Mohenjo-daro and Harappa in Pakistan, highlighting the vast reach of the Indus Valley Civilization. However, his career was marred by controversy due to disputes over spending and his independent nature, leading to disciplinary action and his eventual resignation from the ASI in 1927.  Despite this, Banerjee's legacy remains significant as he is remembered for his groundbreaking discovery of Mohenjo-daro. \n"
    },
    {
      "title": "Pakistan expels tens of thousands of Afghans",
      "link": "https://www.bbc.com/news/articles/c74z19pl7wgo",
      "published": "2025-04-19",
      "summary": "Pakistan has accelerated its drive to expel Afghans who are undocumented or had temporary permission to stay.",
      "content": "Pakistan has deported more than 19,500 Afghans this month, among more than 80,000 who have left ahead of a 30 April deadline, according to the UN.\nPakistan has accelerated its drive to expel undocumented Afghans and those who had temporary permission to stay, saying it can no longer cope.\nBetween 700 and 800 families are being deported daily, Taliban officials say, with up to two million people expected to follow in the coming months.\nPakistani Foreign Minister Ishaq Dar flew to Kabul on Saturday for talks with Taliban officials. His counterpart Amir Khan Muttaqi expressed \"deep concern\" about deportations.\nSome expelled Afghans at the border said they had been born in Pakistan after their families fled conflict.\nMore than 3.5 million Afghans have been living in Pakistan, according to the UN's refugee agency, including around 700,000 people who came after the Taliban takeover in 2021. The UN estimates that half are undocumented.\nPakistan has taken in Afghans through decades of war, but the government says the high number of refugees now poses risks to national security and causes pressure on public services.\nThere has been a recent spike in border clashes between the security forces of both sides. Pakistan blames them on militants based in Afghanistan, which the Taliban deny.\nPakistan's foreign ministry said the two sides had \"discussed all issues of mutual interest\" in Saturday's meeting in Kabul.\nPakistan had extended a deadline for undocumented Afghans to leave the country by a month, to 30 April.\nOn the Torkham border crossing, some expelled Afghans told the BBC they left Afghanistan decades ago - or had never lived there.\n\"I lived my whole life in Pakistan,\" said Sayed Rahman, a second-generation refugee born and raised in Pakistan. \"I got married there. What am I supposed to do now?\" \nSaleh, a father of three daughters, worried what life under Taliban rule will mean for them. His daughters attended school in Pakistan's Punjab province, but in Afghanistan, girls over the age of 12 are barred from doing so.\n\"I want my children to study. I don't want their years in school to go to waste,\" he said. \"Everyone has the right to an education.\"\nAnother man told the BBC: \"Our children have never seen Afghanistan and even I don't know what it looks like anymore. It might take us a year or more to settle in and find work. We feel helpless.\"\nAt the border, men and women pass through separate gates, under the watch of armed Pakistani and Afghan guards. Some of those returning were elderly - one man was carried across on a stretcher, another in a bed. \nMilitary trucks shuttled families from the border to temporary shelters. Those originally from distant provinces stay there for several days, waiting for transport to their home regions.\nFamilies clustered under canvases to escape the 30C degree heat, as swirling dust caught in the eyes and mouth. Resources are stretched and fierce arguments often break out over access to shelter.\nReturnees receive between 4,000 and 10,000 Afghanis (PS41 to PS104) from the Kabul authorities, according to Hedayatullah Yad Shinwari, a member of the camp's Taliban-appointed finance committee.\nThe mass deportation is placing significant pressure on Afghanistan's fragile infrastructure, with an economy in crisis and a population nearing 45 million people.\n\"We have resolved most issues, but the arrival of people in such large numbers naturally brings difficulties,\" said Bakht Jamal Gohar, the Taliban's head of refugee affairs at the crossing. \"These people left decades ago and left all their belongings behind. Some of their homes were destroyed during 20 years of war.\"\nNearly every family told the BBC that Pakistani border guards restricted what they could bring - a complaint echoed by some human rights groups.\nChaudhry said in response that Pakistan did \"not have any policy that prevents Afghan refugees from taking their household items with them\".\nOne man, sitting on the roadside in the blistering sun, said his children had begged to stay in Pakistan, the country where they were born. They had been given temporary residency, but that expired in March.\n\"Now we'll never go back. Not after how we were treated,\" he said.\nAdditional reporting by Daniel Wittenberg and Mallory Moench\nThe Rahimi family wants to say thank you to the Northallerton community for welcoming them.\nSources say half a million US weapons obtained by the Taliban have been lost, sold or smuggled to militant groups.\nThe Afghanistan Cricket Board will not see any of its funding from the International Cricket Council cut or diverted to its exiled women's cricketers.\nThe BBC speaks to young women who are now working to support their families in one of few jobs they are allowed to do.\nThe ICC announces the formation of a dedicated taskforce to support displaced female cricketers from Afghanistan.\nCopyright 2025 BBC. All rights reserved. The BBC is not responsible for the content of external sites. Read about our approach to external linking.\n ",
      "ml_hf_summary": "Pakistan has deported over 19,500 Afghans since the beginning of April, as part of a larger effort to expel undocumented Afghan refugees by the deadline of April 30th.  The UN estimates that over 3.5 million Afghans are currently living in Pakistan, with many lacking proper documentation. The Pakistani government cites national security and strain on public services as reasons for the deportations, which have led to increased border clashes between Pakistani and Afghan forces.  Afghan refugees who were born or raised in Pakistan are facing challenges adjusting to life in Afghanistan, while others express concerns about their children's education under Taliban rule.  The mass deportation has placed significant pressure on both countries' infrastructure and economies. \n"
    },
    {
      "title": "Wordle hints today for #1,400: Clues and answer for Saturday, April 19",
      "link": "https://tech.yahoo.com/gaming/wordle/article/wordle-hints-today-for-1400-clues-and-answer-for-saturday-april-19-040153649.html",
      "published": "2025-04-19",
      "summary": "",
      "content": "Manage your account \n Audio\nComputing\nGaming\nHome entertainment\nPhones\nScience\nStreaming\nVPN\nWearables\nDeals\nMore\n...\nHey, there! Welcome to the weekend. Let's help make sure you're in good spirits by keeping your Wordle streak trundling along. In case you need some assistance with that, here's our daily Wordle guide with some hints and the answer for Saturday's puzzle (#1,400).\nIt may be that you're a Wordle newcomer and you're not completely sure how to play the game. We're here to help with that too.\nWordle is a deceptively simple daily word game that first emerged in 2021. The gist is that there is one five-letter word to deduce every day by process of elimination. The daily word is the same for everyone.\nWordle blew up in popularity in late 2021 after creator Josh Wardle made it easy for players to share an emoji-based grid with their friends and followers that detailed how they fared each day. The game's success spurred dozens of clones across a swathe of categories and formats.\nThe New York Times purchased Wordle in early 2022 for an undisclosed sum. The publication said that players collectively played Wordle 5.3 billion times in 2024. So, it's little surprise that Wordle is one of the best online games and puzzles you can play daily.\nTo start playing Wordle, you simply need to enter one five-letter word. The game will tell you how close you are to that day's secret word by highlighting letters that are in the correct position in green. Letters that appear in the word but aren't in the right spot will be highlighted in yellow. If you guess any letters that are not in the secret word, the game will gray those out on the virtual keyboard.\nYou'll only have six guesses to find each day's word, though you still can use grayed-out letters to help narrow things down. It's also worth remembering that letters can appear in the secret word more than once.\nWordle is free to play on the NYT's website and apps, as well as on Meta Quest headsets. The game refreshes at midnight local time. If you log into a New York Times account, you can track your stats, including the all-important win streak.\nIf you have a NYT subscription that includes full access to the publication's games, you don't have to stop after a single round of Wordle. You'll have access to an archive of more than 1,300 previous Wordle games. So if you're a relative newcomer, you'll be able to go back and catch up on previous editions.\nIn addition, paid NYT Games members have access to a tool called the Wordle Bot. This can tell you how well you performed at each day's game.\nBefore today's Wordle hints, here are the answers to recent puzzles that you may have missed:\nYesterday's Wordle answer for Friday, April 18 -- DIRGE\nThursday, April 17 -- STOOD\nWednesday, April 16 -- MORAL\nTuesday, April 15 -- ASHEN\nMonday, April 14 -- CREST\nEvery day, we'll try to make Wordle a little easier for you. First, we'll offer a hint that describes the meaning of the word or how it might be used in a phrase or sentence. We'll also tell you if there are any double (or even triple) letters in the word.\nIn case you still haven't quite figured it out by that point, we'll then provide the first letter of the word. Those who are still stumped after that can continue on to find out the answer for today's Wordle.\nThis should go without saying, but make sure to scroll slowly. Spoilers are ahead.\nHere is a hint for today's Wordle answer:\nWhere emails you actually might want to read go.\nThere are no repeated letters in today's Wordle answer.\nThe first letter of today's Wordle answer is I.\nThis is your final warning before we reveal today's Wordle answer. No take-backs.\nDon't blame us if you happen to scroll too far and accidentally spoil the game for yourself.\nWhat is today's Wordle? Today's Wordle answer is...\nINBOX\nNot to worry if you didn't figure out today's Wordle word. If you made it this far down the page, hopefully you at least kept your streak going. And, hey: there's always another game tomorrow.\nAudio\nComputing\nGaming\nPhones\nScience\nHome Entertainment\nStreaming\nVPN\nWearables\nDeals\nAdvertise\nAbout our ads\nCareers\nHelp\nFeedback\nFollow us on\n(c) 2025 Yahoo. All rights reserved.",
      "ml_hf_summary": "Wordle is a daily word game where players must guess a five-letter word within six attempts. Created in 2021 by Josh Wardle, the game gained immense popularity after The New York Times acquired it and its user base exploded.  The game features an emoji grid that displays player progress and uses color-coding to indicate correct letter placement. Wordle is free to play on the NYT website and apps, with a daily refresh at midnight local time. Players can track their streaks and access a library of past puzzles through paid subscriptions. The game's popularity has led to numerous clones across various platforms. \n"
    }
  ]
}