{
  "news": [
    {
      "title": "Brazilian Nun Who Was World’s Oldest Person Dies at 116",
      "link": "https://www.nytimes.com/2025/05/02/world/americas/inah-canabarro-lucas-oldest-person-dead.html",
      "published": "2025-05-03",
      "summary": "Sister Inah Canabarro Lucas received a blessing from Pope Francis when she turned 110. She would have turned 117 in a few weeks.",
      "content": "In January, Guinness World Records declared Sister Inah the world's oldest living person after the death of Tomiko Itooka, a Japanese woman who was born before the start of World War I and the sinking of the Titanic. She was also 116. \n In the year Sister Inah was born, the Model T was introduced by Henry Ford; insulin had not yet been discovered; and the world's first demonstration of a television was still several years away. \n Sister Inah's exact birthday has been a source of debate and confusion. A registry had listed it as June 8, 1908, the date recognized by Guinness World Records and LongeviQuest, which keeps a database of supercentenarians, people who are 110 or older. \n But her family and friends have said that Sister Inah was born on May 27, 1908, in Sao Francisco de Assis in the state of Rio Grande do Sul. They said that her parents had traveled a great distance and several days to register her birth. \n As a child, she was so thin that her parents feared she would not survive, her nephew, Cleber Canabarro, who is in his 80s, told The Associated Press in January. Her great-grandfather was a well-known general who had taken up arms during the turbulent period after Brazil declared independence from Portugal in the 19th century, The A.P. reported.",
      "ml_hf_summary": "Sister Inah was recognized by Guinness World Records as the oldest living person in January 2023 following the death of Tomiko Itooka. Born in 1908, Sister Inah's exact birthdate is disputed, with official records listing June 8th while her family claims May 27th.  She was born in São Francisco de Assis, Rio Grande do Sul, Brazil, to parents who traveled extensively to register her birth. Her nephew, Cleber Canabarro, shared that she was frail as a child and her great-grandfather was a prominent general during Brazil's independence from Portugal. \n\n\n"
    },
    {
      "title": "Brazilian Nun Who Was World’s Oldest Person Dies at 116",
      "link": "https://www.nytimes.com/2025/05/02/world/americas/inah-canabarro-lucas-oldest-person-dead.html",
      "published": "2025-05-03",
      "summary": "Sister Inah Canabarro Lucas received a blessing from Pope Francis when she turned 110. She would have turned 117 in a few weeks.",
      "content": "In January, Guinness World Records declared Sister Inah the world's oldest living person after the death of Tomiko Itooka, a Japanese woman who was born before the start of World War I and the sinking of the Titanic. She was also 116. \n In the year Sister Inah was born, the Model T was introduced by Henry Ford; insulin had not yet been discovered; and the world's first demonstration of a television was still several years away. \n Sister Inah's exact birthday has been a source of debate and confusion. A registry had listed it as June 8, 1908, the date recognized by Guinness World Records and LongeviQuest, which keeps a database of supercentenarians, people who are 110 or older. \n But her family and friends have said that Sister Inah was born on May 27, 1908, in Sao Francisco de Assis in the state of Rio Grande do Sul. They said that her parents had traveled a great distance and several days to register her birth. \n As a child, she was so thin that her parents feared she would not survive, her nephew, Cleber Canabarro, who is in his 80s, told The Associated Press in January. Her great-grandfather was a well-known general who had taken up arms during the turbulent period after Brazil declared independence from Portugal in the 19th century, The A.P. reported.",
      "ml_hf_summary": "Sister Inah, an individual residing in Brazil, has been recognized as the world's oldest living person by Guinness World Records and LongeviQuest following the death of Tomiko Itooka.  Born on either May 27, 1908, or June 8, 1908, Sister Inah's exact birthdate remains a subject of debate. Her family claims she was born in São Francisco de Assis, while official records list her birthday as June 8, 1908.  Sister Inah's remarkable longevity is attributed to factors such as her parents' long journey to register her birth and the historical context of Brazil during the 19th century. \n"
    },
    {
      "title": "Exxon and Chevron Report Lower Profits While Girding for Tariffs",
      "link": "https://www.nytimes.com/2025/05/02/business/energy-environment/exxon-chevron-earnings.html",
      "published": "2025-05-03",
      "summary": "President Trump’s trade policies have helped to push down oil prices while raising the costs of materials for oil and gas companies.",
      "content": "The two largest U.S. oil companies reported their lowest first-quarter profits in years on Friday as they braced for the economic fallout from President Trump's trade war, which has weakened consumer confidence and pushed oil prices down. \n U.S. crude prices slipped under $60 a barrel this week, a threshold below which many companies cannot make money drilling new wells. Crude oil is now about $20 a barrel cheaper than it was just before Mr. Trump took office. Not only is oil fetching less, companies are paying more for steel and other materials because of tariffs the president has imposed. \n There are signs that some companies are already pulling back. \n As of last week, the number of rigs drilling wells in the Permian Basin, the largest U.S. oil field, had fallen 3 percent in a month, according to Baker Hughes, an oil field service provider. That company's customers have been putting off discretionary expenses, and spending across the industry is likely to fall this year, Baker Hughes executives said last week. \n \"We are seeing significant downward pressure on prices and margins. In this environment, it is more important than ever to focus on what we can control,\" Darren Woods, chief executive of Exxon Mobil, told analysts on Friday.",
      "ml_hf_summary": "ExxonMobil and Chevron reported their lowest first-quarter profits in years due to a combination of factors including President Trump's trade war, which has lowered oil prices and increased material costs.  U.S. crude oil prices fell below $60 per barrel this week, making it difficult for companies to invest in new drilling projects. The number of active oil rigs in the Permian Basin decreased by 3% last month, indicating a slowdown in industry activity. Executives from ExxonMobil emphasized the need to focus on controllable factors amidst challenging market conditions.  \n"
    },
    {
      "title": "Exxon and Chevron Report Lower Profits While Girding for Tariffs",
      "link": "https://www.nytimes.com/2025/05/02/business/energy-environment/exxon-chevron-earnings.html",
      "published": "2025-05-03",
      "summary": "President Trump’s trade policies have helped to push down oil prices while raising the costs of materials for oil and gas companies.",
      "content": "The two largest U.S. oil companies reported their lowest first-quarter profits in years on Friday as they braced for the economic fallout from President Trump's trade war, which has weakened consumer confidence and pushed oil prices down. \n U.S. crude prices slipped under $60 a barrel this week, a threshold below which many companies cannot make money drilling new wells. Crude oil is now about $20 a barrel cheaper than it was just before Mr. Trump took office. Not only is oil fetching less, companies are paying more for steel and other materials because of tariffs the president has imposed. \n There are signs that some companies are already pulling back. \n As of last week, the number of rigs drilling wells in the Permian Basin, the largest U.S. oil field, had fallen 3 percent in a month, according to Baker Hughes, an oil field service provider. That company's customers have been putting off discretionary expenses, and spending across the industry is likely to fall this year, Baker Hughes executives said last week. \n \"We are seeing significant downward pressure on prices and margins. In this environment, it is more important than ever to focus on what we can control,\" Darren Woods, chief executive of Exxon Mobil, told analysts on Friday.",
      "ml_hf_summary": "ExxonMobil and Chevron reported their lowest first-quarter profits in years due to decreased oil prices and increased costs from tariffs. U.S. crude prices fell below $60 a barrel, a level where many companies struggle to profit from drilling new wells.  This price drop, coupled with higher steel and material costs attributed to President Trump's trade war, has led to reduced spending in the oil industry. As of last week, the number of rigs drilling in the Permian Basin decreased by 3% compared to the previous month, indicating a pullback in activity. ExxonMobil CEO Darren Woods emphasized the need to focus on controllable factors amidst these challenging market conditions.  \n\n\n"
    },
    {
      "title": "Trump Labels Haiti’s Powerful Gangs Terrorists",
      "link": "https://www.nytimes.com/2025/05/02/world/americas/trump-haiti-gangs-terrorists.html",
      "published": "2025-05-03",
      "summary": "The move will enable harsh sanctions on the gangs, which control important sectors of the country’s economy, and anybody who does business with them.",
      "content": "A powerful alliance of armed gangs that has plunged Haiti into violence and launched attacks against state institutions was designated on Friday as a terrorist group by the Trump administration. \n The move is likely to worsen an already dire humanitarian crisis in Haiti, experts said, since gangs control much of the country's economy and infrastructure, including ports and major roads, and extort businesses and the local population. \n President Trump's designation gives the U.S. broad power to impose economic penalties on the criminal groups, and potentially even to take military action. But it also allows sanctions to be imposed on anyone the United States accuses of having dealings with the gangs. \n \"The age of impunity for those supporting violence in Haiti is over,'' Secretary of State Marco Rubio said in a social media post.",
      "ml_hf_summary": "On Friday, the Trump administration designated a powerful alliance of armed gangs operating in Haiti as a terrorist group. This alliance has been responsible for widespread violence and attacks against Haitian state institutions. The designation grants the U.S. authority to impose economic sanctions on the gangs and potentially take military action.  It also allows sanctions against individuals deemed to be associated with the gangs. Secretary of State Marco Rubio stated that \"the age of impunity for those supporting violence in Haiti is over.\" \n\n\n"
    },
    {
      "title": "Trump Labels Haiti’s Powerful Gangs Terrorists",
      "link": "https://www.nytimes.com/2025/05/02/world/americas/trump-haiti-gangs-terrorists.html",
      "published": "2025-05-03",
      "summary": "The move will enable harsh sanctions on the gangs, which control important sectors of the country’s economy, and anybody who does business with them.",
      "content": "A powerful alliance of armed gangs that has plunged Haiti into violence and launched attacks against state institutions was designated on Friday as a terrorist group by the Trump administration. \n The move is likely to worsen an already dire humanitarian crisis in Haiti, experts said, since gangs control much of the country's economy and infrastructure, including ports and major roads, and extort businesses and the local population. \n President Trump's designation gives the U.S. broad power to impose economic penalties on the criminal groups, and potentially even to take military action. But it also allows sanctions to be imposed on anyone the United States accuses of having dealings with the gangs. \n \"The age of impunity for those supporting violence in Haiti is over,'' Secretary of State Marco Rubio said in a social media post.",
      "ml_hf_summary": "On Friday, the Trump administration designated a powerful alliance of armed gangs operating in Haiti as a terrorist group. This designation grants the U.S. broad authority to impose economic sanctions and potentially even military action against the gangs. The gangs control significant portions of Haiti's economy and infrastructure, including ports and major roads, and extort businesses and the local population.  The move is expected to exacerbate the already dire humanitarian crisis in Haiti. \n"
    },
    {
      "title": "How Trump Dismantled His First-Term Policy on Crimea",
      "link": "https://www.nytimes.com/video/world/europe/100000010127983/trumps-u-turn-crimea.html",
      "published": "2025-05-03",
      "summary": "After more than three years of war, President Trump proposed a peace plan for Russia and Ukraine in late April that would have the United States recognize Moscow’s 2014 takeover of the Crimean peninsula. Michael D. Shear, a former White House correspondent for The New York Times in London, explains how the proposal, which Ukraine has rejected, is a reversal from Mr. Trump’s first term as president.",
      "content": "NOW PLAYING \n How Trump Dismantled His First-Term Policy on Crimea \n 1:35 \n How the End of a U.S. Tax Loophole Hurts Chinese Companies \n 2:13 \n How President Trump Caused Market Chaos \n Advertisement SKIP ADVERTISEMENT \n 1:36 \n The One Big Reason Canada's Liberals Won \n 2:23 \n Why Trump Sees Himself as a Man of Destiny \n 1:52 \n Why Trump Is Signing So Many Executive Orders \n Advertisement SKIP ADVERTISEMENT \n 2:29 \n What to Know About Trump's Crypto Company \n 3:22 \n What Are the Stakes in Canada's Elections? \n 2:50 \n Why Pope Francis Had a Complicated Relationship With Power \n Advertisement SKIP ADVERTISEMENT \n 2:30 \n How Colleges Are Turning Athletes Into Influencers \n 2:12 \n Why a Wisconsin Judge Was Arrested by the F.B.I. \n 2:04",
      "ml_hf_summary": "The provided text appears to be a list of video titles and descriptions, not an article with factual information. It seems to be from a news website or platform that features short summaries of various topics.  To summarize the content, it includes videos about political figures like Donald Trump, economic issues, and social trends. \n\n\n"
    },
    {
      "title": "How Trump Dismantled His First-Term Policy on Crimea",
      "link": "https://www.nytimes.com/video/world/europe/100000010127983/trumps-u-turn-crimea.html",
      "published": "2025-05-03",
      "summary": "After more than three years of war, President Trump proposed a peace plan for Russia and Ukraine in late April that would have the United States recognize Moscow’s 2014 takeover of the Crimean peninsula. Michael D. Shear, a former White House correspondent for The New York Times in London, explains how the proposal, which Ukraine has rejected, is a reversal from Mr. Trump’s first term as president.",
      "content": "NOW PLAYING \n How Trump Dismantled His First-Term Policy on Crimea \n 1:35 \n How the End of a U.S. Tax Loophole Hurts Chinese Companies \n 2:13 \n How President Trump Caused Market Chaos \n Advertisement SKIP ADVERTISEMENT \n 1:36 \n The One Big Reason Canada's Liberals Won \n 2:23 \n Why Trump Sees Himself as a Man of Destiny \n 1:52 \n Why Trump Is Signing So Many Executive Orders \n Advertisement SKIP ADVERTISEMENT \n 2:29 \n What to Know About Trump's Crypto Company \n 3:22 \n What Are the Stakes in Canada's Elections? \n 2:50 \n Why Pope Francis Had a Complicated Relationship With Power \n Advertisement SKIP ADVERTISEMENT \n 2:30 \n How Colleges Are Turning Athletes Into Influencers \n 2:12 \n Why a Wisconsin Judge Was Arrested by the F.B.I. \n 2:04",
      "ml_hf_summary": "The provided text is a list of video titles and runtimes, not a news article.  It appears to be a selection of videos from a news or media platform, covering various topics related to politics, business, technology, and social issues. The videos feature subjects such as Donald Trump's policies, the Canadian election, cryptocurrency, and the relationship between Pope Francis and power. \n\n\n"
    },
    {
      "title": "After Leading a Liberal Comeback, Carney Hits the Ground Running",
      "link": "https://www.nytimes.com/2025/05/03/world/canada/carney-new-government.html",
      "published": "2025-05-03",
      "summary": "The prime minister will begin broad economic and security talks with President Trump next week and has set a timetable for his new government.",
      "content": "[Read: Mark Carney Swept Canada, but There Will Be No Honeymoon] \n [Watch: The One Big Reason Canada's Liberals Won] \n And in Opinion, Shachi Kurl, president of the Angus Reid Institute, a nonprofit polling organization, writes that after the vote, \"the world is watching Canada like some global lab rat, to observe how it will react and respond to what our neighbor to the south throws next.\" Ms. Kurl argues that \"Canada's imperative today should be to reframe its place in the world beyond America.\" \n [Read in Opinion: The World Is Watching Canada] \n For Mr. Poilievre, the disappointment was compounded by losing his seat in Carleton, the suburban and rural riding in the Ottawa area he had held for 21 years. Bruce Fanjoy, a first-time politician, upset him to claim the seat for the Liberals. \n Mr. Fanjoy deserves credit for putting in two solid years of campaign work in Carleton. But when I went out there the morning after the vote, I found that many people, including Conservatives, were still angry about Mr. Poilievre's support for the trucker convoy that occupied and paralyzed much of downtown Ottawa in 2022. \n On Friday, Damien Kurek, a Conservative, said he would step down from his seat in Alberta, Mr. Poilievre's home province, to allow him to run for it in a by-election and return to Parliament. Mr. Carney said he would not delay that vote, although he has the power to put it off for as long as six months.",
      "ml_hf_summary": "Pierre Poilievre lost his seat in Carleton to Bruce Fanjoy of the Liberal Party in Canada's recent federal election.  Poilievre had held the seat for 21 years and was a prominent figure within the Conservative party. The outcome is significant because it highlights the impact of the 2022 trucker convoy protests on Poilievre's political standing, as many voters remain critical of his stance.  Conservative MP Damien Kurek has stepped down to allow Poilievre to run in a by-election and return to Parliament. Mark Carney, the Prime Minister, has not delayed the by-election despite having the power to do so for up to six months. \n"
    },
    {
      "title": "After Leading a Liberal Comeback, Carney Hits the Ground Running",
      "link": "https://www.nytimes.com/2025/05/03/world/canada/carney-new-government.html",
      "published": "2025-05-03",
      "summary": "The prime minister will begin broad economic and security talks with President Trump next week and has set a timetable for his new government.",
      "content": "[Read: Mark Carney Swept Canada, but There Will Be No Honeymoon] \n [Watch: The One Big Reason Canada's Liberals Won] \n And in Opinion, Shachi Kurl, president of the Angus Reid Institute, a nonprofit polling organization, writes that after the vote, \"the world is watching Canada like some global lab rat, to observe how it will react and respond to what our neighbor to the south throws next.\" Ms. Kurl argues that \"Canada's imperative today should be to reframe its place in the world beyond America.\" \n [Read in Opinion: The World Is Watching Canada] \n For Mr. Poilievre, the disappointment was compounded by losing his seat in Carleton, the suburban and rural riding in the Ottawa area he had held for 21 years. Bruce Fanjoy, a first-time politician, upset him to claim the seat for the Liberals. \n Mr. Fanjoy deserves credit for putting in two solid years of campaign work in Carleton. But when I went out there the morning after the vote, I found that many people, including Conservatives, were still angry about Mr. Poilievre's support for the trucker convoy that occupied and paralyzed much of downtown Ottawa in 2022. \n On Friday, Damien Kurek, a Conservative, said he would step down from his seat in Alberta, Mr. Poilievre's home province, to allow him to run for it in a by-election and return to Parliament. Mr. Carney said he would not delay that vote, although he has the power to put it off for as long as six months.",
      "ml_hf_summary": "The Canadian federal election resulted in a victory for the Liberal Party led by Prime Minister Justin Trudeau. Conservative leader Pierre Poilievre experienced a personal setback, losing his seat in Carleton to Liberal candidate Bruce Fanjoy.  Fanjoy's win was attributed, in part, to voter dissatisfaction with Poilievre's support of the 2022 trucker convoy that disrupted Ottawa. Conservative MP Damien Kurek announced his resignation to allow Poilievre to run in a by-election for Kurek's Alberta seat. Prime Minister Trudeau has stated he will not delay the by-election, despite having the authority to postpone it for up to six months.  \n\n\n"
    },
    {
      "title": "Memory Palace",
      "link": "https://www.nytimes.com/2025/05/03/briefing/memory-palace.html",
      "published": "2025-05-03",
      "summary": "Memorizing a poem is like taking a work of art that you love and letting it live and bloom inside of you.",
      "content": "The first poem I memorized was \"Pinkle Purr\" by A.A. Milne. I was around seven years old when I encountered it and was immediately enchanted. It's a children's poem, four stanzas, all with the same hypnotic AA/BB/AA rhyme scheme. It's a poem about a kitten, Pinkle Purr, and his mother, Tattoo, and their changing relationship as Pinkle Purr grows up, a sort of \"Cat's in the Cradle\" for kids, but less sad. \n I don't remember making any effort to memorize it; I just read the poem so many times that it worked its way into me, such that I knew it as well as I knew the theme songs to my favorite TV shows. I'd walk around muttering to myself, trying out different voices and syllable stresses: \"Tattoo was the mother of Pinkle Purr/A little black nothing of feet and fur;/And by-and-by, when his eyes came through,/He saw his mother, the big Tattoo.\" It was meditative, comforting, an internal metronome that I naturally returned to when I returned to myself. \n Perhaps because I started memorizing poems early, before I was forced to do so in school, I never perceived the process as onerous, but rather as a fun challenge, a way to take something I loved and make it a part of me. As a graduate student, I memorized Galway Kinnell's \"Little Sleep's-Head Sprouting Hair in the Moonlight,\" lines from which still regularly surface in my brain unbidden -- \"Kiss the mouth / that tells you, here, / here is the world\" -- even though I can't recall the whole thing anymore. I love that, amid the practical information and persistent worries and memories good and bad, my mind's archive contains these bits of beauty, lyrics that float up into consciousness, lovely echoes. \n This past week, The Times Book Review ran a weeklong challenge to help readers memorize Edna St. Vincent Millay's \"Recuerdo,\" replete with games and videos. (Ethan Hawke's recitation of \"We were very tired, we were very merry, / We had gone back and forth all night on the ferry\" is delightful and dramatic; I'd like to hear him do \"Pinkle Purr.\") I'm obviously the exact audience for this type of thing, but even if you're the sort who thinks of memorizing verse as homework, I think this challenge will make you reconsider. The poem is dazzling, and the challenge's structure makes it almost effortless to absorb it. I love what A.O. Scott and Aliza Aufrichtig write in their introduction: \"At a time when we are flooded with texts, rants and A.I. slop, a poem occupies a quieter, less commodified corner of your consciousness. It's a flower in the windowbox of your mind.\"",
      "ml_hf_summary": "The article discusses the author's personal experience with memorizing poems, highlighting their early fascination with poetry and its impact on their self-reflection. The author recounts their childhood memory of memorizing \"Pinkle Purr\" by A.A. Milne and later their enjoyment of memorizing Galway Kinnell's poem \"Little Sleep’s-Head Sprouting Hair in the Moonlight.\"  The article then introduces a recent challenge from The Times Book Review to help readers memorize Edna St. Vincent Millay's \"Recuerdo,\" emphasizing the beauty and ease of the process. The author concludes by praising the challenge for offering a quiet escape from the overwhelming digital world, highlighting the enduring power of poetry in fostering personal reflection. \n"
    },
    {
      "title": "Memory Palace",
      "link": "https://www.nytimes.com/2025/05/03/briefing/memory-palace.html",
      "published": "2025-05-03",
      "summary": "Memorizing a poem is like taking a work of art that you love and letting it live and bloom inside of you.",
      "content": "The first poem I memorized was \"Pinkle Purr\" by A.A. Milne. I was around seven years old when I encountered it and was immediately enchanted. It's a children's poem, four stanzas, all with the same hypnotic AA/BB/AA rhyme scheme. It's a poem about a kitten, Pinkle Purr, and his mother, Tattoo, and their changing relationship as Pinkle Purr grows up, a sort of \"Cat's in the Cradle\" for kids, but less sad. \n I don't remember making any effort to memorize it; I just read the poem so many times that it worked its way into me, such that I knew it as well as I knew the theme songs to my favorite TV shows. I'd walk around muttering to myself, trying out different voices and syllable stresses: \"Tattoo was the mother of Pinkle Purr/A little black nothing of feet and fur;/And by-and-by, when his eyes came through,/He saw his mother, the big Tattoo.\" It was meditative, comforting, an internal metronome that I naturally returned to when I returned to myself. \n Perhaps because I started memorizing poems early, before I was forced to do so in school, I never perceived the process as onerous, but rather as a fun challenge, a way to take something I loved and make it a part of me. As a graduate student, I memorized Galway Kinnell's \"Little Sleep's-Head Sprouting Hair in the Moonlight,\" lines from which still regularly surface in my brain unbidden -- \"Kiss the mouth / that tells you, here, / here is the world\" -- even though I can't recall the whole thing anymore. I love that, amid the practical information and persistent worries and memories good and bad, my mind's archive contains these bits of beauty, lyrics that float up into consciousness, lovely echoes. \n This past week, The Times Book Review ran a weeklong challenge to help readers memorize Edna St. Vincent Millay's \"Recuerdo,\" replete with games and videos. (Ethan Hawke's recitation of \"We were very tired, we were very merry, / We had gone back and forth all night on the ferry\" is delightful and dramatic; I'd like to hear him do \"Pinkle Purr.\") I'm obviously the exact audience for this type of thing, but even if you're the sort who thinks of memorizing verse as homework, I think this challenge will make you reconsider. The poem is dazzling, and the challenge's structure makes it almost effortless to absorb it. I love what A.O. Scott and Aliza Aufrichtig write in their introduction: \"At a time when we are flooded with texts, rants and A.I. slop, a poem occupies a quieter, less commodified corner of your consciousness. It's a flower in the windowbox of your mind.\"",
      "ml_hf_summary": "The article discusses the author's personal experience with memorizing poetry, starting with A.A. Milne's \"Pinkle Purr\" at age seven. The author finds memorization enjoyable and meditative, citing Galway Kinnell's \"Little Sleep's-Head Sprouting Hair in the Moonlight\" as another example.  The article highlights a recent challenge by The Times Book Review to memorize Edna St. Vincent Millay's \"Recuerdo,\" which includes games and videos to aid in memorization. The author encourages readers to participate, emphasizing the value of poetry as a distinct and enriching form of mental engagement amidst the abundance of digital content.  \n\n\n"
    },
    {
      "title": "Hikers Stumble Upon a Pile of Gold Coins, Igniting a Historical Hunt",
      "link": "https://www.nytimes.com/2025/05/03/world/europe/czech-treasure-gold-discovery.html",
      "published": "2025-05-03",
      "summary": "The discovery of coins and jewelry in the Czech Republic worth up to $680,000 raises a tantalizing mystery for historians and amateur sleuths: Who buried the treasure?",
      "content": "\"What is exceptional in this case is the volume,\" Dr. Novak said. \n He estimated that the gold coins were worth around 7.5 million Czech Koruna, or about $340,000. The other items, if they are solid gold and not merely gold plated, could be worth another $340,000, he said. \n But what was really intriguing, he said, was how recently the items were buried. \n While archaeological discoveries are fairly common in the region, with many dating back to the Bronze Age or medieval times, the newest coin in this collection was from 1921, indicating that the treasure had been hidden within about the past century. \n That relative recency has offered a tantalizing lead to researchers, who think they may be able to track down the owner of the treasure through archival research and solve the mystery of why it was hidden. \n \"It's possible that someone might come across some information, perhaps in the newspapers of the time, that someone robbed a jewelry store or something like that, and suddenly it might lead us to a clue,\" Dr. Novak said.",
      "ml_hf_summary": "Archaeologists discovered a collection of gold coins and other items in the Czech Republic, estimated to be worth $340,000 USD. The most recent coin dates back to 1921, indicating the treasure was buried within the past century. This relatively recent discovery has sparked interest in tracking down the owner through archival research and potentially solving the mystery of why the treasure was hidden.  Dr. Novak believes that newspaper archives may hold clues about the treasure's origin, such as potential robberies or other events that could lead to its identification. \n"
    },
    {
      "title": "Hikers Stumble Upon a Pile of Gold Coins, Igniting a Historical Hunt",
      "link": "https://www.nytimes.com/2025/05/03/world/europe/czech-treasure-gold-discovery.html",
      "published": "2025-05-03",
      "summary": "The discovery of coins and jewelry in the Czech Republic worth up to $680,000 raises a tantalizing mystery for historians and amateur sleuths: Who buried the treasure?",
      "content": "\"What is exceptional in this case is the volume,\" Dr. Novak said. \n He estimated that the gold coins were worth around 7.5 million Czech Koruna, or about $340,000. The other items, if they are solid gold and not merely gold plated, could be worth another $340,000, he said. \n But what was really intriguing, he said, was how recently the items were buried. \n While archaeological discoveries are fairly common in the region, with many dating back to the Bronze Age or medieval times, the newest coin in this collection was from 1921, indicating that the treasure had been hidden within about the past century. \n That relative recency has offered a tantalizing lead to researchers, who think they may be able to track down the owner of the treasure through archival research and solve the mystery of why it was hidden. \n \"It's possible that someone might come across some information, perhaps in the newspapers of the time, that someone robbed a jewelry store or something like that, and suddenly it might lead us to a clue,\" Dr. Novak said.",
      "ml_hf_summary": "In the Czech Republic, archaeologists unearthed a treasure trove containing gold coins and other items estimated to be worth approximately $680,000. The most recent coin dates back to 1921, indicating the treasure was buried within the last century. This recent burial distinguishes this find from typical archaeological discoveries in the region, which often date back to the Bronze Age or medieval times. Researchers hope to identify the owner through archival research and uncover the reason behind the treasure's concealment. They believe historical records, such as newspaper articles from the time period, might provide clues about a potential robbery or other event related to the buried treasure. \n\n\n"
    },
    {
      "title": "Poised to Expand Gaza Offensive, Israel Calls Up Thousands of Reserve Soldiers",
      "link": "https://www.nytimes.com/2025/05/03/world/middleeast/israel-mobilizes-reservists-gaza.html",
      "published": "2025-05-03",
      "summary": "The mobilization could indicate that Israel is preparing to shift its tactics in its fight against Hamas.",
      "content": "Israel will mobilize thousands of reserve soldiers to bolster its campaign against Hamas in the Gaza Strip, the military announced on Saturday night, as the country appeared poised to expand its offensive in the Palestinian enclave. \n The call-up suggested the Israeli government was preparing to shift tactics in an attempt to force Hamas to agree to its terms for an end to the war. It is unclear whether that would prove successful, as Hamas has fought a determined insurgency through more than a year of Israeli operations in Gaza. \n Israel's security cabinet, chaired by Prime Minister Benjamin Netanyahu, was set to meet on Sunday to formally sign off on broadening the campaign in Gaza, said an Israeli official, who spoke on condition of anonymity because they were not authorized to speak publicly. \n The mobilization announcement compounded fears in Gaza, where Israel has barred food, medicine and other humanitarian aid from entering for over two months. Reeling from more than a year of hunger and fighting, many are still displaced or living amid the rubble of their homes.",
      "ml_hf_summary": "On Saturday night, the Israeli military announced the mobilization of thousands of reserve soldiers to strengthen its ongoing campaign against Hamas in the Gaza Strip. This move suggests Israel intends to escalate its offensive in an attempt to pressure Hamas into accepting its terms for a ceasefire.  Israel's security cabinet, led by Prime Minister Benjamin Netanyahu, is scheduled to meet on Sunday to formally approve the expansion of the campaign. The mobilization has heightened concerns in Gaza, where a two-month blockade has restricted the entry of essential supplies like food and medicine, exacerbating the humanitarian crisis caused by over a year of conflict.  \n"
    },
    {
      "title": "Poised to Expand Gaza Offensive, Israel Calls Up Thousands of Reserve Soldiers",
      "link": "https://www.nytimes.com/2025/05/03/world/middleeast/israel-mobilizes-reservists-gaza.html",
      "published": "2025-05-03",
      "summary": "The mobilization could indicate that the Israeli government is preparing to shift its tactics in its fight against Hamas.",
      "content": "Israel will mobilize thousands of reserve soldiers to bolster its campaign against Hamas in the Gaza Strip, the military announced on Saturday night, as the country appeared poised to expand its offensive in the Palestinian enclave. \n The move prompted fear in Gaza, where Israel has barred food, medicine and other humanitarian aid from entering for over two months. Reeling from more than a year of hunger and fighting, many are still displaced or living amid the rubble of what was once their homes. \n Israel's security cabinet, chaired by Prime Minister Benjamin Netanyahu, was set to meet on Sunday to formally sign off on broadening the campaign in Gaza, said an Israeli official, who spoke on condition of anonymity because they were not authorized to speak publicly. \n Since Israel ended a two-month cease-fire with Hamas in mid-March, Israeli forces have resumed attacking across the enclave. But while Israel jets and drones have regularly bombarded Gaza from the air, Israeli ground forces slowed their advance after seizing some territory.",
      "ml_hf_summary": "Israel is mobilizing thousands of reserve soldiers to intensify its offensive against Hamas in the Gaza Strip. This mobilization follows a two-month cease-fire ending in mid-March, when Israel resumed airstrikes and targeted areas within Gaza. The Israeli security cabinet is scheduled to meet on Sunday to formally authorize expanding the campaign into Gaza.  Israel has imposed restrictions on humanitarian aid entering Gaza for over two months, exacerbating the already dire situation for Palestinians living there. While Israel's ground forces have slowed their advance after seizing some territory, they are now preparing for a more aggressive offensive in Gaza. \n"
    },
    {
      "title": "The Frightening Precedents for Trump’s ‘Legal Abyss’",
      "link": "https://www.nytimes.com/2025/05/03/world/trump-dual-state.html",
      "published": "2025-05-03",
      "summary": "The ‘dual-state theory’ explains how authoritarians bend the law to their will.",
      "content": "\"Oopsie ... Too late,\" President Nayib Bukele of El Salvador wrote on X with a cry-laughing emoji on March 16. Below it was a screenshot of a headline: \"Fed judge orders deportation flights carrying alleged gangbangers to return to US, blocks Trump from invoking Alien Enemies Act.\" \n Despite the court order, federal officials had neither prevented the takeoff of the deportation flight that was still on the ground at the time of the court's order, nor turned around the two other planes that were already in the air. After news broke that the men were now in El Salvador, imprisoned in the notorious complex known by its Spanish acronym CECOT, Mr. Bukele's mocking tweet made clear that he considered the deportees beyond the reach of U.S. courts. \n The Trump administration has taken a similar position, albeit with fewer emojis. \"Federal courts generally have no jurisdiction over the president's conduct of foreign affairs, his authorities under the Alien Enemies Act, and his core Article II powers to remove foreign alien terrorists from U.S. soil and repel a declared invasion,\" Karoline Leavitt, the White House press secretary, said in a statement on March 17. \n Since then, the administration has grown even more defiant. This week, when asked about the case of Kilmar Abrego Garcia, a Salvadoran immigrant and Maryland father of three who was deported from Maryland to CECOT as a result of \"administrative error,\" Mr. Trump told a reporter that he has the power to free Mr. Abrego Garcia but won't do so -- despite a Supreme Court order to \"facilitate\" his release.",
      "ml_hf_summary": "On March 16, 2023, a federal judge ordered the return of deportation flights carrying alleged gang members from El Salvador to the US and blocked President Trump's invocation of the Alien Enemies Act. Despite the court order, three deportation flights had already departed or were in transit, ultimately landing in El Salvador where the individuals were imprisoned at CECOT.  President Nayib Bukele of El Salvador publicly mocked the situation on X, suggesting the deportees were beyond US legal reach. The Trump administration has defended its actions, claiming federal courts lack jurisdiction over presidential conduct regarding foreign affairs and removal of foreign nationals. This stance escalated when President Trump refused to release Kilmar Abrego Garcia, a Salvadoran immigrant ordered by the Supreme Court to be facilitated for release. \n\n\n"
    },
    {
      "title": "The Frightening Precedents for Trump’s ‘Legal Abyss’",
      "link": "https://www.nytimes.com/2025/05/03/world/trump-dual-state.html",
      "published": "2025-05-03",
      "summary": "The ‘dual-state theory’ explains how authoritarians bend the law to their will.",
      "content": "\"Oopsie ... Too late,\" President Nayib Bukele of El Salvador wrote on X with a cry-laughing emoji on March 16. Below it was a screenshot of a headline: \"Fed judge orders deportation flights carrying alleged gangbangers to return to US, blocks Trump from invoking Alien Enemies Act.\" \n Despite the court order, federal officials had neither prevented the takeoff of the deportation flight that was still on the ground at the time of the court's order, nor turned around the two other planes that were already in the air. After news broke that the men were now in El Salvador, imprisoned in the notorious complex known by its Spanish acronym CECOT, Mr. Bukele's mocking tweet made clear that he considered the deportees beyond the reach of U.S. courts. \n The Trump administration has taken a similar position, albeit with fewer emojis. \"Federal courts generally have no jurisdiction over the president's conduct of foreign affairs, his authorities under the Alien Enemies Act, and his core Article II powers to remove foreign alien terrorists from U.S. soil and repel a declared invasion,\" Karoline Leavitt, the White House press secretary, said in a statement on March 17. \n Since then, the administration has grown even more defiant. This week, when asked about the case of Kilmar Abrego Garcia, a Salvadoran immigrant and Maryland father of three who was deported from Maryland to CECOT as a result of \"administrative error,\" Mr. Trump told a reporter that he has the power to free Mr. Abrego Garcia but won't do so -- despite a Supreme Court order to \"facilitate\" his release.",
      "ml_hf_summary": "On March 16th, President Nayib Bukele of El Salvador tweeted \"Oopsie… Too late\" after deportation flights carrying alleged gang members were ordered back to the US by a federal judge. Despite the court order, the planes had already departed and remained in El Salvador, impeding the US's ability to enforce the court's decision. The Trump administration has defended its position, stating that federal courts do not have jurisdiction over the president's foreign affairs actions or removal of \"alien terrorists\" from US soil.  President Trump further asserted his authority to release individuals despite a Supreme Court order to facilitate their release. \n"
    },
    {
      "title": "Cardinal Parolin, Leader of Papal Conclave, Is Also a Top Candidate",
      "link": "https://www.nytimes.com/2025/05/03/world/europe/pope-conclave-cardinal-pietro-parolin.html",
      "published": "2025-05-03",
      "summary": "Cardinals have talked about Cardinal Pietro Parolin, the Vatican secretary of state, as someone who could have a steady, bureaucratic hand on the church’s wheel.",
      "content": "In the days surrounding Pope Francis' death, Cardinal Pietro Parolin was everywhere. \n The No. 2 figure in the Vatican, he visited Francis in the hospital, and then helped seal the papal apartments after the pope died. He welcomed cardinals he knew from around the world to the pope's funeral, talking to former President Joseph R. Biden Jr., President Volodymyr Zelensky of Ukraine and former Prime Minister Matteo Renzi of Italy. And leading up to the conclave to pick the next pope, he celebrated an outdoor Mass for tens of thousands of faithful on the steps of St. Peter's Basilica. \n It seems that everyone knows Cardinal Parolin, the Vatican secretary of state, who will preside over the papal election and who has emerged as the leading compromise candidate before a conclave in which many of the more than 130 cardinals do not know one another. \n \"The only candidate that for now has emerged with a certain insistence is Parolin,\" said Andrea Riccardi, the founder of the Sant'Egidio Community, a Catholic group close to Francis. \"He represents a continuity,\" added Mr. Riccardi, who is close to several cardinals who are considered papal contenders. \"He has said, 'Virtue stands in the middle.'\"",
      "ml_hf_summary": "Cardinal Pietro Parolin, the Vatican's Secretary of State, played a prominent role following Pope Francis' death. He visited the pope in the hospital, oversaw the sealing of his apartments, and welcomed cardinals from around the world to the funeral.  Parolin also celebrated an outdoor Mass for thousands on the steps of St. Peter's Basilica before the conclave to elect the next pope. As the leading compromise candidate, he is expected to preside over the election, which will be attended by more than 130 cardinals who may not know each other well.  \n"
    },
    {
      "title": "Cardinal Parolin, Leader of Papal Conclave, Is Also a Top Candidate",
      "link": "https://www.nytimes.com/2025/05/03/world/europe/pope-conclave-cardinal-pietro-parolin.html",
      "published": "2025-05-03",
      "summary": "Cardinals have talked about Cardinal Pietro Parolin, the Vatican secretary of state, as someone who could have a steady, bureaucratic hand on the church’s wheel.",
      "content": "In the days surrounding Pope Francis' death, Cardinal Pietro Parolin was everywhere. \n The No. 2 figure in the Vatican, he visited Francis in the hospital, and then helped seal the papal apartments after the pope died. He welcomed cardinals he knew from around the world to the pope's funeral, talking to former President Joseph R. Biden Jr., President Volodymyr Zelensky of Ukraine and former Prime Minister Matteo Renzi of Italy. And leading up to the conclave to pick the next pope, he celebrated an outdoor Mass for tens of thousands of faithful on the steps of St. Peter's Basilica. \n It seems that everyone knows Cardinal Parolin, the Vatican secretary of state, who will preside over the papal election and who has emerged as the leading compromise candidate before a conclave in which many of the more than 130 cardinals do not know one another. \n \"The only candidate that for now has emerged with a certain insistence is Parolin,\" said Andrea Riccardi, the founder of the Sant'Egidio Community, a Catholic group close to Francis. \"He represents a continuity,\" added Mr. Riccardi, who is close to several cardinals who are considered papal contenders. \"He has said, 'Virtue stands in the middle.'\"",
      "ml_hf_summary": "Following Pope Francis' death, Cardinal Pietro Parolin, Vatican secretary of state and No. 2 figure, played a prominent role in funeral arrangements and welcoming dignitaries.  Parolin presided over an outdoor Mass for tens of thousands at St. Peter's Basilica before the papal conclave to elect the next pope. He is considered a leading compromise candidate due to his familiarity among cardinals and his emphasis on continuity with Francis' papacy. Andrea Riccardi, founder of the Catholic group Sant’Egidio Community, stated that Parolin represents \"a continuity\" and embodies the principle of \"Virtue stands in the middle.\" Over 130 cardinals will participate in the conclave to select the next pope.  \n\n\n"
    },
    {
      "title": "In Singapore’s Election, a Blow to the Fledgling Opposition",
      "link": "https://www.nytimes.com/2025/05/02/world/asia/singapore-election-pap-workers.html",
      "published": "2025-05-03",
      "summary": "The People’s Action Party continued its six-decade reign, as was widely expected. But many had anticipated it to lose more ground to the opposition.",
      "content": "Many had believed that the P. A.P's hold on power would weaken because many average Singaporeans increasingly say they no longer feel prosperous. Singapore now has more millionaires than London. But while average wealth has more than doubled in local currency terms, median wealth has fallen 1.8 percent from 2008 to 2023, according to the Swiss bank UBS. \n \"My concern is that the government is bringing the country up but it's also leaving a lot of people behind,\" said Kris Tan, 44, a personal trainer. \n Mr. Tan said he was worried about his children's future, particularly about the cost of living. \n Mr. Tan said he was also concerned about elitism, which he says is getting more obvious with regards to the upper echelons of the government compared to the people.\" He noted the million-dollar salaries that the country's ministers earn. \n But Cherian George, who has written books on Singapore politics, said: \"What this election shows is that when the external threats are so salient and so dramatic, it makes Singaporeans more conscious of the fact that the world is a difficult and sometimes ugly place. And that perhaps increases their sense of gratitude for a more generally capable and stable government.\" \n Since the last election, the government has bolstered social spending, giving temporary financial support to people who have been laid off and offering vouchers to help with daily expenses. But it has continued to face discontent over increases in the sales tax and declining housing affordability, issues that the opposition has seized on.",
      "ml_hf_summary": "Singapore's average wealth has more than doubled in local currency terms since 2008, but median wealth has fallen 1.8% during the same period according to UBS.  This disparity is concerning for many Singaporeans, including personal trainer Kris Tan, who worries about his children's future and rising costs of living.  While some see this as a sign of increased government capability and stability, others like Cherian George point to heightened external threats leading to greater appreciation for the government's role in providing stability. The government has implemented social spending programs to address unemployment and daily expenses, but opposition parties have capitalized on concerns about sales tax increases and declining housing affordability. \n"
    },
    {
      "title": "In Singapore’s Election, a Blow to the Fledgling Opposition",
      "link": "https://www.nytimes.com/2025/05/02/world/asia/singapore-election-pap-workers.html",
      "published": "2025-05-03",
      "summary": "The People’s Action Party continued its six-decade reign, as was widely expected. But many had anticipated it to lose more ground to the opposition.",
      "content": "Many had believed that the P. A.P's hold on power would weaken because many average Singaporeans increasingly say they no longer feel prosperous. Singapore now has more millionaires than London. But while average wealth has more than doubled in local currency terms, median wealth has fallen 1.8 percent from 2008 to 2023, according to the Swiss bank UBS. \n \"My concern is that the government is bringing the country up but it's also leaving a lot of people behind,\" said Kris Tan, 44, a personal trainer. \n Mr. Tan said he was worried about his children's future, particularly about the cost of living. \n Mr. Tan said he was also concerned about elitism, which he says is getting more obvious with regards to the upper echelons of the government compared to the people.\" He noted the million-dollar salaries that the country's ministers earn. \n But Cherian George, who has written books on Singapore politics, said: \"What this election shows is that when the external threats are so salient and so dramatic, it makes Singaporeans more conscious of the fact that the world is a difficult and sometimes ugly place. And that perhaps increases their sense of gratitude for a more generally capable and stable government.\" \n Since the last election, the government has bolstered social spending, giving temporary financial support to people who have been laid off and offering vouchers to help with daily expenses. But it has continued to face discontent over increases in the sales tax and declining housing affordability, issues that the opposition has seized on.",
      "ml_hf_summary": "The recent election in Singapore saw the People's Action Party (P.A.P) maintain its hold on power despite growing concerns among some citizens about economic inequality. While average wealth in Singapore has more than doubled since 2008, median wealth has fallen by 1.8% during the same period, according to UBS.  Concerns raised by individuals like personal trainer Kris Tan include rising living costs and a perceived widening gap between government officials' high salaries and the experiences of ordinary citizens. Political analyst Cherian George suggests that external threats and global instability may have contributed to Singaporeans' increased support for the P.A.P., despite these concerns. The government has responded to discontent with increased social spending, but issues like rising sales tax and housing affordability remain points of contention.  \n\n\n"
    },
    {
      "title": "As China Looks for Way Out of U.S. Trade Deadlock, Fentanyl Could Be Key",
      "link": "https://www.nytimes.com/2025/05/03/world/asia/us-china-tariffs-fentanyl.html",
      "published": "2025-05-03",
      "summary": "Chinese officials have long used their willingness to cooperate to stem the flow of fentanyl to the United States as leverage in talks over broader disputes.",
      "content": "When Donald J. Trump was first in the White House trying to strike a trade deal with China, Beijing tried to curry favor with the American president by banning all variants of the powerful synthetic opioid fentanyl. \n Now, as China and the United States are deadlocked in a bitter trade war that has roiled the world, offering to do more to further stem the flow of fentanyl and the chemicals used to make it could once again be an option for China. \n Beijing has for years used cooperation on fentanyl as leverage in its broader relationship with the United States. The move to ban all variants in 2019 came after President Trump accused China of not doing enough to stop the flow of the drug into the United States, and as the issue of fentanyl became increasingly tangled in a broader trade dispute. \n China also agreed at that time to participate in joint law enforcement crackdowns on fentanyl with the United States. The moves led Mr. Trump to praise the Chinese leader, Xi Jinping, for making \"a wonderful humanitarian gesture.\"",
      "ml_hf_summary": "In 2019, China banned all variants of fentanyl as a tactic during trade negotiations with the US under President Trump's administration. This action followed accusations from Trump that China was not doing enough to curb fentanyl trafficking into the US.  China also agreed to participate in joint law enforcement efforts against fentanyl with the US at this time. The ban and cooperation were seen as a positive step by Trump, who praised Xi Jinping for his \"wonderful humanitarian gesture.\" As trade tensions between the two countries remain high, China may once again leverage its stance on fentanyl as leverage in negotiations. \n"
    },
    {
      "title": "As China Looks for Way Out of U.S. Trade Deadlock, Fentanyl Could Be Key",
      "link": "https://www.nytimes.com/2025/05/03/world/asia/us-china-tariffs-fentanyl.html",
      "published": "2025-05-03",
      "summary": "Chinese officials have long used their willingness to cooperate to stem the flow of fentanyl to the United States as leverage in talks over broader disputes.",
      "content": "When Donald J. Trump was first in the White House trying to strike a trade deal with China, Beijing tried to curry favor with the American president by banning all variants of the powerful synthetic opioid fentanyl. \n Now, as China and the United States are deadlocked in a bitter trade war that has roiled the world, offering to do more to further stem the flow of fentanyl and the chemicals used to make it could once again be an option for China. \n Beijing has for years used cooperation on fentanyl as leverage in its broader relationship with the United States. The move to ban all variants in 2019 came after President Trump accused China of not doing enough to stop the flow of the drug into the United States, and as the issue of fentanyl became increasingly tangled in a broader trade dispute. \n China also agreed at that time to participate in joint law enforcement crackdowns on fentanyl with the United States. The moves led Mr. Trump to praise the Chinese leader, Xi Jinping, for making \"a wonderful humanitarian gesture.\"",
      "ml_hf_summary": "In 2019, during the initial phase of trade negotiations between the US and China, Beijing banned all variants of fentanyl in an apparent attempt to appease then-President Donald Trump. This action followed accusations from President Trump that China was not doing enough to curb the flow of fentanyl into the United States.  China's move also included participation in joint law enforcement operations with the US against fentanyl trafficking. The ban and cooperation were lauded by President Trump as a \"wonderful humanitarian gesture\" towards Xi Jinping, the Chinese leader. Now, amidst a renewed trade war between the two nations, China may again leverage its control over fentanyl production and distribution as a bargaining chip.  \n"
    },
    {
      "title": "Oil Prices Are Falling. Here’s Where That Could Spell Trouble.",
      "link": "https://www.nytimes.com/2025/05/03/world/europe/oil-prices-tariffs.html",
      "published": "2025-05-03",
      "summary": "For countries that depend heavily on oil revenue, dropping prices are worrisome.",
      "content": "Oil producing countries are bracing for a bumpy ride this year, with a precipitous drop in prices to the lowest levels in four years seen as the initial, alarming sign of looming turmoil. \n A price drop benefits any country seeking to cut its fuel bill. But in oil producing nations, lower prices can feed economic troubles, and sometimes political unrest, as governments slash spending. \n Analysts who had already been predicting lower oil prices because of softening demand amid increased global production said the possibility of a tariff trade war and the overall climate of uncertainty could well deepen producers' woes. \n \"The steep price dive and overall volatility is sending a very strong signal that the global economy is going to be rattled this year and that will translate into a lower demand for oil,\" said Gregory Brew, a specialist on the geopolitics of oil and gas with the Eurasia Group, a New York-based risk analysis organization.",
      "ml_hf_summary": "Oil prices have dropped to their lowest point in four years, raising concerns among oil-producing countries. This decline is attributed to softening global demand due to increased production and potential trade wars.  Analysts predict that this price volatility will negatively impact the global economy, leading to reduced oil demand. Gregory Brew, an expert on oil geopolitics from Eurasia Group, emphasizes that the steep price drop signals economic instability and a decrease in oil consumption. This situation poses challenges for oil-producing nations as lower prices can lead to economic difficulties and potential political unrest. \n\n\n"
    },
    {
      "title": "Oil Prices Are Falling. Here’s Where That Could Spell Trouble.",
      "link": "https://www.nytimes.com/2025/05/03/world/europe/oil-prices-tariffs.html",
      "published": "2025-05-03",
      "summary": "For countries that depend heavily on oil revenue, dropping prices are worrisome.",
      "content": "Oil producing countries are bracing for a bumpy ride this year, with a precipitous drop in prices to the lowest levels in four years seen as the initial, alarming sign of looming turmoil. \n A price drop benefits any country seeking to cut its fuel bill. But in oil producing nations, lower prices can feed economic troubles, and sometimes political unrest, as governments slash spending. \n Analysts who had already been predicting lower oil prices because of softening demand amid increased global production said the possibility of a tariff trade war and the overall climate of uncertainty could well deepen producers' woes. \n \"The steep price dive and overall volatility is sending a very strong signal that the global economy is going to be rattled this year and that will translate into a lower demand for oil,\" said Gregory Brew, a specialist on the geopolitics of oil and gas with the Eurasia Group, a New York-based risk analysis organization.",
      "ml_hf_summary": "Oil prices have fallen to their lowest point in four years, signaling potential economic turmoil for producing countries. This decline is attributed to softening demand due to increased global production and heightened uncertainty surrounding trade wars and geopolitical instability. Analysts predict this price drop will exacerbate existing economic challenges faced by oil-producing nations, potentially leading to government spending cuts and political unrest. The combination of these factors suggests a significant impact on the global economy in 2023, with lower demand for oil likely resulting from the overall economic slowdown.  \n"
    },
    {
      "title": "America’s Vietnam War Opponents Who Fled to Canada Reflect on the Past and Future",
      "link": "https://www.nytimes.com/2025/05/03/world/canada/vietnam-war-opponents-canada-america.html",
      "published": "2025-05-03",
      "summary": "Some of the United States’ Vietnam War opponents found refuge in Canada. Fifty years after the end of the war, they’re still worried about the future.",
      "content": "The presidential pardon signed by Jimmy Carter in 1977 was a sweeping invitation to thousands of Americans to come home and help heal a nation torn apart by the Vietnam War. Those who had left for Canada to avoid the draft had wanted no part of the conflict, which killed about 60,000 Americans. \n Canada had offered a refuge. It did not support the war and was willing to welcome, with few questions asked, those crossing the border. \n Many war resisters, or draft dodgers as they were often called by others, were not interested in returning when Mr. Carter made his amnesty offer. Their decisions had come with high costs: ruptured family ties, broken friendships and, often, shame. While some hailed those who went to Canada as principled, others considered them cowardly. \n Now, the 50th anniversary of the war's end arrives at another turbulent moment. \n For Americans living in Canada, President Trump's economic attacks and threats to Canada's sovereignty have again stirred uneasy feelings about the United States.",
      "ml_hf_summary": "In 1977, Jimmy Carter pardoned thousands of Americans who had fled to Canada to avoid the Vietnam War.  This pardon offered a pathway for these individuals to return home and contribute to national healing after the war's end. While some draft dodgers were willing to return, many others faced significant personal costs for their choices, including strained relationships and societal stigma. The 50th anniversary of the Vietnam War coincides with heightened tensions between the US and Canada due to President Trump's actions and rhetoric, which have reignited anxieties among Canadians living in the US.  \n"
    },
    {
      "title": "America’s Vietnam War Opponents Who Fled to Canada Reflect on the Past and Future",
      "link": "https://www.nytimes.com/2025/05/03/world/canada/vietnam-war-opponents-canada-america.html",
      "published": "2025-05-03",
      "summary": "Some of the United States’ Vietnam War opponents found refuge in Canada. Fifty years after the end of the war, they’re still worried about the future.",
      "content": "The presidential pardon signed by Jimmy Carter in 1977 was a sweeping invitation to thousands of Americans to come home and help heal a nation torn apart by the Vietnam War. Those who had left for Canada to avoid the draft had wanted no part of the conflict, which killed about 60,000 Americans. \n Canada had offered a refuge. It did not support the war and was willing to welcome, with few questions asked, those crossing the border. \n Many war resisters, or draft dodgers as they were often called by others, were not interested in returning when Mr. Carter made his amnesty offer. Their decisions had come with high costs: ruptured family ties, broken friendships and, often, shame. While some hailed those who went to Canada as principled, others considered them cowardly. \n Now, the 50th anniversary of the war's end arrives at another turbulent moment. \n For Americans living in Canada, President Trump's economic attacks and threats to Canada's sovereignty have again stirred uneasy feelings about the United States.",
      "ml_hf_summary": "In 1977, President Jimmy Carter issued a pardon for thousands of Americans who had fled to Canada to avoid the Vietnam War draft.  The war, which killed approximately 60,000 Americans, led many to seek refuge in Canada, which opposed the conflict and welcomed them without extensive scrutiny. While some viewed those who went to Canada as principled, others considered them cowardly.  Fifty years after the war's end, President Trump's actions towards Canada have rekindled anxieties among Americans living there about the United States. \n\n\n"
    },
    {
      "title": "Ukraine Rejects Russian Call for a Three-Day Cease-Fire",
      "link": "https://www.nytimes.com/2025/05/03/world/europe/ukraine-russia-ceasefire-talks.html",
      "published": "2025-05-03",
      "summary": "President Volodymyr Zelensky called the proposal a “theatrical show” and said such a short truce would not bolster negotiations for a lasting peace.",
      "content": "President Volodymyr Zelensky on Saturday said Ukraine will not adhere to a three-day cease-fire proposed by Russia, saying such a short truce would not help in negotiations for a lasting peace. \n Ukraine in March accepted a proposal from the Trump administration for a 30-day cease-fire, to be followed by talks on matters including the location of an armistice line, steps to safeguard a nuclear power plant occupied by the Russian army and deployment of a possible European peacekeeping force. \n On Saturday Mr. Zelensky told reporters in Kyiv that the Russian counteroffer of a three-day cease-fire covering the anniversary of the end of World War II in Europe, an important political holiday in Russia, was merely a \"theatrical show.\" \n He said Russia's offer was intended to \"create a soft atmosphere of an exit from isolation\" for President Vladimir V. Putin of Russia, and to assuage security worries of foreign leaders and dignitaries attending a Victory Day parade in Moscow on May 9. The Chinese president, Xi Jinping, has accepted an invitation to attend the parade.",
      "ml_hf_summary": "On Saturday, Ukrainian President Volodymyr Zelensky rejected Russia's proposal for a three-day cease-fire coinciding with Europe's World War II anniversary. Zelensky stated that such a short truce would be insufficient for meaningful peace negotiations and characterized it as a \"theatrical show\" intended to benefit Russian President Vladimir Putin.  In March, Ukraine had agreed to a 30-day cease-fire proposed by the Trump administration, followed by discussions on armistice lines, nuclear power plant security, and potential European peacekeeping forces. Zelensky believes Russia's offer is designed to improve Putin's international image and alleviate security concerns for foreign dignitaries attending Moscow's Victory Day parade on May 9th, where Chinese President Xi Jinping is expected to be present.  \n"
    },
    {
      "title": "Ukraine Rejects Russian Call for a Three-Day Cease-Fire",
      "link": "https://www.nytimes.com/2025/05/03/world/europe/ukraine-russia-ceasefire-talks.html",
      "published": "2025-05-03",
      "summary": "President Volodymyr Zelensky called the proposal a “theatrical show” and said such a short truce would not bolster negotiations for a lasting peace.",
      "content": "President Volodymyr Zelensky on Saturday said Ukraine will not adhere to a three-day cease-fire proposed by Russia, saying such a short truce would not help in negotiations for a lasting peace. \n Ukraine in March accepted a proposal from the Trump administration for a 30-day cease-fire, to be followed by talks on matters including the location of an armistice line, steps to safeguard a nuclear power plant occupied by the Russian army and deployment of a possible European peacekeeping force. \n On Saturday Mr. Zelensky told reporters in Kyiv that the Russian counteroffer of a three-day cease-fire covering the anniversary of the end of World War II in Europe, an important political holiday in Russia, was merely a \"theatrical show.\" \n He said Russia's offer was intended to \"create a soft atmosphere of an exit from isolation\" for President Vladimir V. Putin of Russia, and to assuage security worries of foreign leaders and dignitaries attending a Victory Day parade in Moscow on May 9. The Chinese president, Xi Jinping, has accepted an invitation to attend the parade.",
      "ml_hf_summary": "President Volodymyr Zelensky stated that Ukraine will not accept Russia's proposed three-day cease-fire, deeming it insufficient for lasting peace negotiations.  Ukraine previously agreed to a 30-day ceasefire in March under the Trump administration's proposal, which included discussions on an armistice line, nuclear power plant safety, and potential European peacekeeping deployment. Zelensky characterized Russia's offer as a \"theatrical show\" intended to create a favorable atmosphere for Putin and appease foreign leaders attending the Victory Day parade in Moscow.  Chinese President Xi Jinping has accepted an invitation to attend this event. \n"
    },
    {
      "title": "Message From the Russian Military: ‘We Lost Your Son’",
      "link": "https://www.nytimes.com/2025/05/03/world/europe/russia-missing-soldiers-ukraine-war.html",
      "published": "2025-05-03",
      "summary": "Russia lacks any formal, organized effort to account for legions of missing soldiers. That often leaves relatives in limbo, fending for themselves with scant government information.",
      "content": "Anna Tsivilyova, a deputy minister of defense and a cousin of President Vladimir V. Putin, told the State Duma last November that 48,000 relatives of the missing had submitted DNA samples in hope of identifying remains, although that included some duplicate requests from the same family. \n In Ukraine, \"Want to Find,\" a government project to help locate Russian servicemen captured or killed there, said it had received more than 88,000 requests for information, with over 9,000 in April alone. It noted that the overall number of missing is still unknown. \n The International Committee of the Red Cross, which tries to locate missing from both sides, whether civilians or military, has 110,000 cases submitted. \n The family of Isakhanov Ravazan, a 25-year-old soldier, last received a brief voice message from him on Nov. 9. During a battle soon afterward, his aunt said, he radioed his commander that he could not stanch the bleeding from a bad wound. He has not been heard from since. \n \"No one saw him dead,\" said his aunt, who, like several people in this article, did not want to be named for fear of falling afoul of laws against detailing battlefield losses. \"Maybe he saved himself, maybe someone found him, we are still holding onto hope that he is alive,\" she said. \"There is no peace for the soul. I cannot sleep at night, and neither can his parents.\"",
      "ml_hf_summary": "Anna Tsivilyova, a deputy minister of defense, reported that 48,000 relatives of missing Russian soldiers have submitted DNA samples in Ukraine. The \"Want to Find\" project has received over 88,000 requests for information on missing personnel, with over 9,000 in April alone. The International Committee of the Red Cross (ICRC) reports receiving 110,000 cases related to missing individuals from both sides of the conflict. Isakhanov Ravazan, a 25-year-old soldier, last communicated on November 9th before going missing during battle. His family remains hopeful for his survival despite not having confirmed information about his fate. \n"
    },
    {
      "title": "Message From the Russian Military: ‘We Lost Your Son’",
      "link": "https://www.nytimes.com/2025/05/03/world/europe/russia-missing-soldiers-ukraine-war.html",
      "published": "2025-05-03",
      "summary": "Russia lacks any formal, organized effort to account for legions of missing soldiers. That often leaves relatives in limbo, fending for themselves with scant government information.",
      "content": "Anna Tsivilyova, a deputy minister of defense and a cousin of President Vladimir V. Putin, told the State Duma last November that 48,000 relatives of the missing had submitted DNA samples in hope of identifying remains, although that included some duplicate requests from the same family. \n In Ukraine, \"Want to Find,\" a government project to help locate Russian servicemen captured or killed there, said it had received more than 88,000 requests for information, with over 9,000 in April alone. It noted that the overall number of missing is still unknown. \n The International Committee of the Red Cross, which tries to locate missing from both sides, whether civilians or military, has 110,000 cases submitted. \n The family of Isakhanov Ravazan, a 25-year-old soldier, last received a brief voice message from him on Nov. 9. During a battle soon afterward, his aunt said, he radioed his commander that he could not stanch the bleeding from a bad wound. He has not been heard from since. \n \"No one saw him dead,\" said his aunt, who, like several people in this article, did not want to be named for fear of falling afoul of laws against detailing battlefield losses. \"Maybe he saved himself, maybe someone found him, we are still holding onto hope that he is alive,\" she said. \"There is no peace for the soul. I cannot sleep at night, and neither can his parents.\"",
      "ml_hf_summary": "The article discusses the ongoing issue of missing Russian soldiers in Ukraine.  Anna Tsivilyova, a deputy minister of defense, stated in November 2022 that 48,000 relatives of missing soldiers had submitted DNA samples for identification. The Ukrainian government's \"Want to Find\" project has received over 88,000 requests for information about missing Russian servicemen, with over 9,000 in April alone.  The International Committee of the Red Cross (ICRC) is handling 110,000 cases submitted by families seeking information about missing individuals from both sides of the conflict. The article highlights the personal impact of these disappearances through the story of Isakhanov Ravazan, a 25-year-old soldier last heard from on November 9, 2022, during a battle.  His family remains hopeful for his return but struggles with the uncertainty and emotional toll.   \n\n\n"
    },
    {
      "title": "Australia Election Results: Prime Minister Albanese Wins 2nd Term",
      "link": "https://www.nytimes.com/2025/05/02/world/asia/australia-prime-minister-election.html",
      "published": "2025-05-03",
      "summary": "Heading to the polls amid global uncertainty arising from the Trump administration, voters opted for the known quantity of the incumbent leader, Anthony Albanese.",
      "content": "Prime Minister Anthony Albanese of Australia has won a second term, completing a stunning turnaround for his governing center-left Labor Party that trailed in the polls for months as a festering cost-of-living crisis weighed on voters. \n The Australian Broadcasting Corporation, the country's public broadcaster, called the election for Mr. Albanese just a half-hour after the last polls closed on Saturday. \n It was a resounding defeat of the conservative opposition led by Peter Dutton. He began the campaign riding dissatisfaction with the status quo, but was hamstrung by a string of missteps and an association with some of President Trump's messaging and policies. \n Mr. Dutton, the leader of the Liberal Party, also lost his parliamentary seat in the conservative stronghold of Queensland, which he had held since 2001. His loss echoed the ouster of Canada's conservative leader, Pierre Poilievre, whose defeat was seen as a rejection of his embrace of Mr. Trump.",
      "ml_hf_summary": "Anthony Albanese won re-election as Prime Minister of Australia in a stunning victory for the Labor Party. The Australian Broadcasting Corporation called the election for Albanese just 30 minutes after polls closed on Saturday.  The opposition, led by Peter Dutton, suffered a significant defeat due to voter dissatisfaction with the cost-of-living crisis and Dutton's association with Donald Trump's policies. Dutton lost his parliamentary seat in Queensland, mirroring the loss of Canada's conservative leader Pierre Poilievre who was also seen as a reflection of Trump's influence on Canadian politics. \n"
    },
    {
      "title": "Australia Election Results: Prime Minister Albanese Wins 2nd Term",
      "link": "https://www.nytimes.com/2025/05/02/world/asia/australia-prime-minister-election.html",
      "published": "2025-05-03",
      "summary": "Heading to the polls amid global uncertainty arising from the Trump administration, voters opted for the known quantity of the incumbent leader, Anthony Albanese.",
      "content": "Prime Minister Anthony Albanese of Australia has won a second term, completing a stunning turnaround for his governing center-left Labor Party that trailed in the polls for months as a festering cost-of-living crisis weighed on voters. \n The Australian Broadcasting Corporation, the country's public broadcaster, called the election for Mr. Albanese just a half-hour after the last polls closed on Saturday. \n It was a resounding defeat of the conservative opposition led by Peter Dutton. He began the campaign riding dissatisfaction with the status quo, but was hamstrung by a string of missteps and an association with some of President Trump's messaging and policies. \n Mr. Dutton, the leader of the Liberal Party, also lost his parliamentary seat in the conservative stronghold of Queensland, which he had held since 2001. His loss echoed the ouster of Canada's conservative leader, Pierre Poilievre, whose defeat was seen as a rejection of his embrace of Mr. Trump.",
      "ml_hf_summary": "Australian Prime Minister Anthony Albanese and his center-left Labor Party secured a second term in office after winning the federal election on Saturday.  The Australian Broadcasting Corporation declared victory for Albanese shortly after polls closed. The conservative opposition, led by Peter Dutton of the Liberal Party, suffered a significant defeat. Dutton's campaign was hampered by perceived missteps and his association with former US President Donald Trump's policies. Notably, Dutton also lost his parliamentary seat in Queensland, mirroring the recent defeat of Canadian Conservative leader Pierre Poilievre, who similarly faced criticism for aligning with Trump.  \n"
    },
    {
      "title": "Ghana Wanted a Cathedral. It Got an ‘Expensive Hole’ Instead.",
      "link": "https://www.nytimes.com/2025/05/03/world/africa/ghana-cathedral-christian-corruption-hole.html",
      "published": "2025-05-03",
      "summary": "The nation had grand plans for a national cathedral designed by a celebrity architect. The $400 million project became a political battleground.",
      "content": "The project began with much fanfare. In 2019, at a fund-raising dinner in Washington, a smiling Mr. Akufo-Addo cut into a large gray, square confection -- the planned cathedral rendered in cake. With a 5,000-seat auditorium and a concave roof referencing the curve of Asante royal stools, it was intended to be much more than just a cathedral. It was to be a national monument, similar to the Washington National Cathedral or London's Westminster Abbey. A place where the solemn ceremonies of state -- like presidents' funerals and royal weddings -- would take place. \n Mr. Akufo-Addo, who was born into a Presbyterian family but became an Anglican as a young man, told the group gathered in Washington that the interdenominational cathedral would be a unifier for Ghanaian Christians, who represent more than 70 percent of the population. It would also be an offering of thanks to God for sparing the country from the epidemics, civil wars and famines that had plagued its neighbors, he said. \n But then he revealed a third reason for its construction. \n \"I made a pledge to God that if I become the president -- after two unsuccessful attempts -- in the 2016 presidential elections, I will build a cathedral to the glory of God,\" he said, according to official readouts of the event.",
      "ml_hf_summary": "Ghanaian President Nana Akufo-Addo announced plans for a large interdenominational cathedral in 2019. The project was intended to be a national monument and a place for solemn state ceremonies like presidential funerals and royal weddings.  The cathedral, designed with a concave roof inspired by Asante royal stools, was envisioned as a symbol of unity for Ghanaian Christians, who make up over 70% of the population. President Akufo-Addo's pledge to build the cathedral was made after his successful third attempt at becoming president in 2016.  \n"
    },
    {
      "title": "Ghana Wanted a Cathedral. It Got an ‘Expensive Hole’ Instead.",
      "link": "https://www.nytimes.com/2025/05/03/world/africa/ghana-cathedral-christian-corruption-hole.html",
      "published": "2025-05-03",
      "summary": "The nation had grand plans for a national cathedral designed by a celebrity architect. The $400 million project became a political battleground.",
      "content": "The project began with much fanfare. In 2019, at a fund-raising dinner in Washington, a smiling Mr. Akufo-Addo cut into a large gray, square confection -- the planned cathedral rendered in cake. With a 5,000-seat auditorium and a concave roof referencing the curve of Asante royal stools, it was intended to be much more than just a cathedral. It was to be a national monument, similar to the Washington National Cathedral or London's Westminster Abbey. A place where the solemn ceremonies of state -- like presidents' funerals and royal weddings -- would take place. \n Mr. Akufo-Addo, who was born into a Presbyterian family but became an Anglican as a young man, told the group gathered in Washington that the interdenominational cathedral would be a unifier for Ghanaian Christians, who represent more than 70 percent of the population. It would also be an offering of thanks to God for sparing the country from the epidemics, civil wars and famines that had plagued its neighbors, he said. \n But then he revealed a third reason for its construction. \n \"I made a pledge to God that if I become the president -- after two unsuccessful attempts -- in the 2016 presidential elections, I will build a cathedral to the glory of God,\" he said, according to official readouts of the event.",
      "ml_hf_summary": "In 2019, Ghanaian President Nana Akufo-Addo announced plans for a national cathedral in Accra. The project, intended to be an interdenominational monument similar to Washington National Cathedral or Westminster Abbey, would feature a 5,000-seat auditorium and a concave roof inspired by Asante royal stools.  Akufo-Addo stated the cathedral would unify Ghanaian Christians (over 70% of the population) and serve as a place for national ceremonies. He also revealed that the project was a personal pledge made to God if he won the 2016 presidential election after two unsuccessful attempts. The announcement was made at a fundraising dinner in Washington, where a cake replica of the planned cathedral was unveiled.  \n\n\n"
    },
    {
      "title": "These Contentious Issues Could Determine Who Becomes the Next Pope",
      "link": "https://www.nytimes.com/2025/05/03/world/europe/pope-conclave-contentious-issues.html",
      "published": "2025-05-03",
      "summary": "As cardinals gather to elect Pope Francis’ successor, they are facing debates over whether the church most needs change or constancy.",
      "content": "The cardinals who have traveled to Rome to elect the next pope at a conclave next week sometimes look as ideologically polarized as many secular voters around the globe. \n At first glance, they appear to split along the kinds of left-right lines that characterize political contests elsewhere. Many conservative Roman Catholic Church leaders disagreed with Pope Francis, who was often a darling of liberals around the world. \n But the typical divisions between progressives and conservatives don't correspond so neatly with the ideological battles within the Vatican and the broader church. Although there are some exceptions among the cardinals, the issue that most consistently marked Francis as a liberal -- his fierce advocacy on behalf of migrants and the poor -- does not necessarily set him apart, because the Catholic Church has made the gospel's call to shelter and feed strangers a fundamental tenet. \n Ultimately, the cardinals' choice will amount to a referendum on whether to extend Francis' legacy of inclusivity and openness to change. That was \"how he made sense of living in a highly polarized age,\" said Anna Rowlands, a political theologian at Durham University in England.",
      "ml_hf_summary": "The upcoming papal conclave in Rome will see cardinals elect the next pope, with some exhibiting ideological polarization similar to global political divides. While there are traditional left-right divisions within the Catholic Church, Pope Francis' advocacy for migrants and the poor is not a clear indicator of his ideology as it aligns with the church's fundamental tenet of caring for the needy. The cardinals' choice will ultimately determine whether to continue Francis' legacy of inclusivity and openness to change.  The conclave begins next week, and its outcome will be significant in shaping the future direction of the Catholic Church. \n"
    },
    {
      "title": "These Contentious Issues Could Determine Who Becomes the Next Pope",
      "link": "https://www.nytimes.com/2025/05/03/world/europe/pope-conclave-contentious-issues.html",
      "published": "2025-05-03",
      "summary": "As cardinals gather to elect Pope Francis’ successor, they are facing debates over whether the church most needs change or constancy.",
      "content": "The cardinals who have traveled to Rome to elect the next pope at a conclave next week sometimes look as ideologically polarized as many secular voters around the globe. \n At first glance, they appear to split along the kinds of left-right lines that characterize political contests elsewhere. Many conservative Roman Catholic Church leaders disagreed with Pope Francis, who was often a darling of liberals around the world. \n But the typical divisions between progressives and conservatives don't correspond so neatly with the ideological battles within the Vatican and the broader church. Although there are some exceptions among the cardinals, the issue that most consistently marked Francis as a liberal -- his fierce advocacy on behalf of migrants and the poor -- does not necessarily set him apart, because the Catholic Church has made the gospel's call to shelter and feed strangers a fundamental tenet. \n Ultimately, the cardinals' choice will amount to a referendum on whether to extend Francis' legacy of inclusivity and openness to change. That was \"how he made sense of living in a highly polarized age,\" said Anna Rowlands, a political theologian at Durham University in England.",
      "ml_hf_summary": "The upcoming papal conclave in Rome will see cardinals from diverse ideological backgrounds choose the next pope. While some divisions resemble left-right political lines, with conservative cardinals disagreeing with Pope Francis' liberal stances on issues like migration and poverty, these distinctions are not always clear-cut.  Francis' focus on aiding migrants and the poor aligns with core Catholic teachings, making this issue less of a dividing factor than his overall approach to inclusivity and change. The cardinals' decision will ultimately reflect whether they wish to continue Francis' legacy or pursue a different direction. \n"
    },
    {
      "title": "Druse in Syrian Town Rocked by Violence Agree to Disarm Militias",
      "link": "https://www.nytimes.com/2025/05/03/world/middleeast/syria-druse-sectarian-violence.html",
      "published": "2025-05-03",
      "summary": "After this week’s bloodshed, Druse leaders in Ashrafieh Sahnaya agreed to integrate militia fighters into government forces. But some residents remain wary.",
      "content": "Sirens blaring, a truckful of armed men trailing in its wake, the black sport utility vehicle that sliced sharklike through the Syrian town of Ashrafieh Sahnaya on Friday morning was impossible to miss. \n Government forces had retaken control from the armed groups that turned the town into a sectarian battlefield for two days this week, killing dozens and exposing for all to see the new Syrian leaders' shaky grip on security. Now, government representatives had arrived to pledge peace to a skeptical town. \n In an airy, echoing religious meeting hall, two officials in suits sat shoulder to shoulder with white-bearded leaders of the Druse religious minority in traditional red-topped white hats, talking of unity. \n \"We're all in one ship,\" said Jameel Mudawwar, the area's top official. \"If it sinks, God forbid, we'll all sink.\"",
      "ml_hf_summary": "On Friday morning, a government-controlled truck carrying armed men passed through Ashrafieh Sahnaya, Syria, after government forces retook control of the town from armed groups that had been engaged in a two-day sectarian conflict.  This event followed the Syrian government's pledge to restore peace and security to the town. Two officials representing the government met with Druse religious leaders in a meeting hall to discuss unity and cooperation. The top official, Jameel Mudawwar, emphasized the shared fate of all residents if the situation worsened. \n"
    },
    {
      "title": "Druse in Syrian Town Rocked by Violence Agree to Disarm Militias",
      "link": "https://www.nytimes.com/2025/05/03/world/middleeast/syria-druse-sectarian-violence.html",
      "published": "2025-05-03",
      "summary": "After this week’s bloodshed, Druse leaders in Ashrafieh Sahnaya agreed to integrate militia fighters into government forces. But some residents remain wary.",
      "content": "Sirens blaring, a truckful of armed men trailing in its wake, the black sport utility vehicle that sliced sharklike through the Syrian town of Ashrafieh Sahnaya on Friday morning was impossible to miss. \n Government forces had retaken control from the armed groups that turned the town into a sectarian battlefield for two days this week, killing dozens and exposing for all to see the new Syrian leaders' shaky grip on security. Now, government representatives had arrived to pledge peace to a skeptical town. \n In an airy, echoing religious meeting hall, two officials in suits sat shoulder to shoulder with white-bearded leaders of the Druse religious minority in traditional red-topped white hats, talking of unity. \n \"We're all in one ship,\" said Jameel Mudawwar, the area's top official. \"If it sinks, God forbid, we'll all sink.\"",
      "ml_hf_summary": "On Friday, government forces retook control of Ashrafieh Sahnaya, Syria, from armed groups after a two-day conflict that resulted in dozens of deaths.  Government officials, including Jameel Mudawwar, the area's top official, met with Druse religious leaders in a religious meeting hall to discuss unity and peace. The meeting aimed to reassure the town following the violence and demonstrate the government's commitment to security.  The event highlighted the fragile state of security under the new Syrian leadership. \n\n\n"
    },
    {
      "title": "‘Not everybody who voted for Carney quite knows what they got’: Canada eyes its new prime minister",
      "link": "https://www.theguardian.com/world/ng-interactive/2025/may/03/mark-carney-canada-prime-minister",
      "published": "2025-05-03",
      "summary": "Standing up to the erratic US president will be a key task for Mark Carney, but experts say economic challenges might prove far more testing",
      "content": "For most of his adult life, Mark Carney has thrived in a world where facts matter and logical arguments can suffice. But Canada's prime minister, who until this week had never held elected office, now enters a domain in which personal slights, ambition and ego often hold more sway than truth or reason. And Carney, who dealt with politicians, some hostile, as a central banker, has now become one, occupying a role in which he's all but guaranteed to disappoint someone. On Monday, Carney led Canada's Liberal party to a victory that only months ago few would have thought possible. Running as the candidate best-equipped to defend Canada's sovereignty against Donald Trump, he emerged with a minority government. After a congratulatory phone call on Wednesday, Donald Trump called Carney a \"very nice gentleman\", said the prime minister \"couldn't have been nicer\" and predicted \"we're going to have a great relationship\". Notably, he did not refer to Carney as \"governor\" - a slight he appeared to have reserved for the former leader Justin Trudeau. The pair will meet at the White House on Tuesday - their first in-person encounter in Carney's role as prime minister. Carney used his first post-election press conference to once again quash any idea Canada was interested in becoming the 51st US state, a proposal repeatedly floated by Trump. \"It's always important to distinguish want from reality,\" Carney said on Friday, referring to a firm belief that Canada joining the US will \"never, ever happen\". Standing up to the erratic US president - prone to dressing down allies on a whim - will be a key task for Carney. But experts say his economic challenges might prove far more testing than managing Trump. \"There's actually only so much we can do if the Americans decide to repeatedly shoot themselves in the foot and inject uncertainty into their economy, the North American economy and the global economy,\" said Robert Gillezeau, a professor of economics at the University of Toronto. \"And let's imagine we got the best-case scenario - the Trump regime says: 'We messed up, tariffs are off the table, we're going to go back to a reasonable and rational global approach to economics.' We'd still probably be in a fairly deep recession. Tariffs matter, but the uncertainty also matters. And at this point, in terms of business investment, nobody has any idea what the hell they're going to do.\" As a veteran central banker who helped establish stability amid first the 2008 financial crisis and then Brexit, Carney's argument to Canadians was that he was the consummate fixer. \"I am most useful in a crisis,\" he said on the campaign trail. \"I'm not that good at peacetime.\" It was an argument that convinced many voters, who gambled that what the country needed was a safe pair of hands. Carney ran - and won - as a newcomer to politics and sought to draw a clear line between himself and his Liberal predecessor Justin Trudeau - but he nonetheless is steering a government into its fourth term. To run again, he would be asking voters for a fifth consecutive Liberal win in a country that \"believes it healthy for different parties to govern\", said Gillezeau. \"There's a real likelihood that he gets between two and four years as prime minister. And because he's been thinking for long about entering politics, I suspect he's aware of that - and so there is a meaningful chance that he does make good use of the time.\" By midweek, it became clear the Liberals had fallen just four seats short of a majority government, with some races decided by a handful of votes. For a brief period of time as votes were counted, it appeared as though the Liberals would be forced to rely on the Bloc Quebecois, a separatist party that is politically toxic outside Quebec and whose leader recently claimed Canada was an \"an artificial country with very little meaning\". Parliament resumes on 26 May, with King Charles travelling to Canada to formally open proceedings the following day - \"an historic honour that matches the weight of our times\", said Carney. Once the grind of legislating begins, Carney can partner with three parties to pass bills, giving his minority government far more stability. The most likely partner for the Liberals are the New Democrats, who faced a wipeout but managed to win seven seats held by incumbents. Those federal seats, alongside the Liberal's 168, give the two parties more than enough to pass legislation. \"Minority governments will take political sophistication to navigate. It's about seeing the whole chessboard listening and taking counsel from many people,\" said Jordan Leichnitz, a former senior strategist with the New Democratic party. \"This will give us a glimpse into whether Carney has the intangible skills that make somebody a durable political leader and able to survive in this environment. Because there's a question mark over whether he has any interest or is capable of doing this. And not everybody who voted for Carney quite knows what they got.\" In its electoral collapse, the NDP also lost both its leader, Jagmeet Singh, and official party status, which grants certain parliamentary privileges, including the ability to ask questions during question period and to sit on key committees. With the Bloc and Conservatives both potentially hostile to the Liberals, they could use the committees to grind government to a halt. \"It's in the power of the Liberals to lower the threshold for party status and grant it to the NDP. Doing so wouldn't be out of the goodness of their heart, but instead reflect an understanding of political considerations,\" said Leichnitz. \"And we'll see soon if this government - and Carney - has these instincts.\" The nature of his victory and the unusual cobbling together of his voter base - a mix of progressives fleeing the NDP and older voters typically voting Conservative, gives the prime minister a shorter than typical honeymoon. While Trump figured prominently in the early days of the federal election to Carney's benefit, many of the issues that previously fueled growing support for the Conservatives are likely to bubble back to the surface in the coming months. Housing remains unaffordable, the cost-of-living crisis hasn't yet abated and wage growth feels stagnant to young workers. A somewhat chastened Conservative party, whose leader, Pierre Poilievre, lost his own seat, will want electoral revenge. And despite winning seats in every province, the prime minister also faces a hostile Prairie region, where a small but vocal minority are agitating for oil-rich Alberta to secede from the country. \"Carney could be in a Keir Starmer situation where he's elected, but it's a loveless victory and he has a very short window in which to deliver what voters think they should be getting from him,\" said Leichnitz. \"If you don't deliver soon and people began peeling away, it can be really difficult to recover from that. And so in many ways, I think his honeymoon ended the minute he stepped off the stage after giving his victory speech.\"",
      "ml_hf_summary": "Mark Carney, a former central banker, was elected Prime Minister of Canada following a minority government victory for the Liberal party.  Carney's victory came as a surprise to many and is considered a \"loveless\" win due to the unusual coalition of voters that propelled him to power. His first post-election press conference saw him address concerns about Canada joining the US, stating it was \"never, ever going to happen.\" He will now face challenges in navigating a minority government with potential for political gridlock and economic uncertainty stemming from US President Trump's erratic policies.  Carney's ability to effectively govern in this environment will be crucial as he seeks to address pressing issues such as housing affordability, the cost-of-living crisis, and stagnant wage growth. The coming months will see how Carney navigates these challenges and whether his short honeymoon period allows him to deliver on voter expectations. \n"
    },
    {
      "title": "Canada’s Mark Carney to Visit Trump and Begin Tariff Negotiations",
      "link": "https://www.nytimes.com/2025/05/02/world/canada/mark-carney-trump-visit-tariffs.html",
      "published": "2025-05-03",
      "summary": "Prime Minister Mark Carney, who will make his first visit to Washington since his election, said President Trump’s call to annex Canada as the 51st state would not be on the table.",
      "content": "Prime Minister Mark Carney of Canada said on Friday that he would travel next week to meet with President Trump for a high-stakes encounter between the two leaders of countries whose once-close friendship has collapsed amid a trade war and Mr. Trump's threats to Canada's sovereignty. \n Mr. Carney also announced that King Charles III would visit Canada later this month, his first trip to the country since Charles's coronation two years ago. The news of the trip, which was also announced by Buckingham Palace, is seen by analysts as a clear rebuke to calls by Mr. Trump to make Canada the 51st state because Charles is also Canada's official head of state. \n Mr. Carney, the former leader of the central banks of England and Canada, led the Liberal Party to victory in Monday's national elections, in which dealing with Mr. Trump, his tariffs on Canadian exports and his repeated talk of making Canada another state were high on the minds of voters. \n The Trump administration's bellicose campaign against Canada, Mr. Carney said, has made it clear that Canada needs to negotiate new deals with the United States around a variety of issues, including economic and security alliances.",
      "ml_hf_summary": "Canadian Prime Minister Mark Carney announced he will meet with President Trump next week following his victory in Monday's national elections.  Carney's win was partly attributed to voters' concerns over Trump's trade war with Canada and his statements about incorporating Canada into the United States.  King Charles III will also visit Canada later this month, his first trip since his coronation two years ago, which analysts view as a response to Trump's calls for Canada to become the 51st state. Carney stated that the Trump administration's actions necessitate new agreements between Canada and the US on economic and security matters.  \n"
    },
    {
      "title": "Canada’s Mark Carney to Visit Trump and Begin Tariff Negotiations",
      "link": "https://www.nytimes.com/2025/05/02/world/canada/mark-carney-trump-visit-tariffs.html",
      "published": "2025-05-03",
      "summary": "Prime Minister Mark Carney, who will make his first visit to Washington since his election, said President Trump’s call to annex Canada as the 51st state would not be on the table.",
      "content": "Prime Minister Mark Carney of Canada said on Friday that he would travel next week to meet with President Trump for a high-stakes encounter between the two leaders of countries whose once-close friendship has collapsed amid a trade war and Mr. Trump's threats to Canada's sovereignty. \n Mr. Carney also announced that King Charles III would visit Canada later this month, his first trip to the country since Charles's coronation two years ago. The news of the trip, which was also announced by Buckingham Palace, is seen by analysts as a clear rebuke to calls by Mr. Trump to make Canada the 51st state because Charles is also Canada's official head of state. \n Mr. Carney, the former leader of the central banks of England and Canada, led the Liberal Party to victory in Monday's national elections, in which dealing with Mr. Trump, his tariffs on Canadian exports and his repeated talk of making Canada another state were high on the minds of voters. \n The Trump administration's bellicose campaign against Canada, Mr. Carney said, has made it clear that Canada needs to negotiate new deals with the United States around a variety of issues, including economic and security alliances.",
      "ml_hf_summary": "Prime Minister Mark Carney of Canada will meet with President Donald Trump next week for high-stakes talks amidst strained relations due to trade disputes and threats to Canadian sovereignty.  King Charles III is scheduled to visit Canada later this month, marking his first trip since his coronation two years ago. This visit is seen as a counterpoint to calls by President Trump to make Canada the 51st state. Carney's victory in Monday's national elections was influenced by concerns about trade tensions and Mr. Trump's actions towards Canada.  The meeting will focus on renegotiating economic and security alliances between the two countries. \n"
    },
    {
      "title": "Far-Right AfD Is Labeled Extremist by Germany’s Intelligence Agency",
      "link": "https://www.nytimes.com/2025/05/02/world/europe/germany-afd-far-right-extremist.html",
      "published": "2025-05-03",
      "summary": "The designation is certain to inflame debates over whether the party should be banned, though some polls show it to be the most popular in the country.",
      "content": "Among other things, the AfD pointed to the timing of the decision, characterizing it as a parting shot by the interior minister, Nancy Faeser, a left-wing Social Democrat, just days before she is to be replaced in Mr. Merz's new government by Alexander Dobrindt, a mainstream conservative. \n \"This decision by the Office for the Protection of the Constitution is complete nonsense in terms of substance, has nothing to do with law and justice, and is purely political in the fight between the cartel parties against the AfD,\" Stephan Brandner, an AfD leader, told D.P.A., a German news agency, referring to the mainstream parties. \n Nonetheless, the domestic intelligence agency made its determination after thoroughly monitoring the AfD for years, and based its decision on the findings of a 1,100-page report compiled by the Office for the Protection of the Constitution. \n The office was specifically created in 1950 to monitor domestic threats to Germany's democracy and prevent any takeover of the Parliament and government by extremist actors. It was an attempt by modern Germany's founders to avert the kind of rupture that took place in 1933, when the Nazis seized control of Parliament and the government. \n While the office is under the aegis of the interior ministry, which is responsible for domestic security, it is designed to operate independently from the government, to insulate it from the political pressures that the AfD alleges were behind the decision.",
      "ml_hf_summary": "Germany's domestic intelligence agency, the Office for the Protection of the Constitution, has classified the right-wing Alternative for Germany (AfD) as a suspected case of unconstitutional activity. This decision, based on a 1,100-page report and years of monitoring, was made by the agency despite criticism from AfD leaders who claim it is politically motivated. The Office for the Protection of the Constitution, established in 1950 to prevent extremist takeovers of government, operates independently from the interior ministry to avoid political influence.  The decision comes days before Interior Minister Nancy Faeser, a Social Democrat, is replaced by Alexander Dobrindt, a conservative.   \n"
    },
    {
      "title": "Far-Right AfD Is Labeled Extremist by Germany’s Intelligence Agency",
      "link": "https://www.nytimes.com/2025/05/02/world/europe/germany-afd-far-right-extremist.html",
      "published": "2025-05-03",
      "summary": "The designation is certain to inflame debates over whether the party should be banned, though some polls show it to be the most popular in the country.",
      "content": "Among other things, the AfD pointed to the timing of the decision, characterizing it as a parting shot by the interior minister, Nancy Faeser, a left-wing Social Democrat, just days before she is to be replaced in Mr. Merz's new government by Alexander Dobrindt, a mainstream conservative. \n \"This decision by the Office for the Protection of the Constitution is complete nonsense in terms of substance, has nothing to do with law and justice, and is purely political in the fight between the cartel parties against the AfD,\" Stephan Brandner, an AfD leader, told D.P.A., a German news agency, referring to the mainstream parties. \n Nonetheless, the domestic intelligence agency made its determination after thoroughly monitoring the AfD for years, and based its decision on the findings of a 1,100-page report compiled by the Office for the Protection of the Constitution. \n The office was specifically created in 1950 to monitor domestic threats to Germany's democracy and prevent any takeover of the Parliament and government by extremist actors. It was an attempt by modern Germany's founders to avert the kind of rupture that took place in 1933, when the Nazis seized control of Parliament and the government. \n While the office is under the aegis of the interior ministry, which is responsible for domestic security, it is designed to operate independently from the government, to insulate it from the political pressures that the AfD alleges were behind the decision.",
      "ml_hf_summary": "The German Office for the Protection of the Constitution (BfV) has classified the Alternative für Deutschland (AfD) as a potential threat to democracy. The decision was made after years of monitoring by the BfV, based on a 1,100-page report.  The AfD leadership claims this is politically motivated and unrelated to actual threats. The BfV's independence from government influence is designed to ensure objective assessment of potential threats. This decision comes amidst political changes in Germany with Interior Minister Nancy Faeser being replaced by Alexander Dobrindt. \n"
    },
    {
      "title": "Germany hits back at Marco Rubio after he panned labeling of AfD as ‘extremist’",
      "link": "https://www.theguardian.com/world/2025/may/03/marco-rubio-germany-afd",
      "published": "2025-05-03",
      "summary": "Far-right German party was labeled a ‘confirmed rightwing extremist group’ by country’s domestic intelligence service",
      "content": "Germany's foreign ministry has hit back at the US secretary of state, Marco Rubio, following his criticism of Germany's decision to label the far-right Alternative fur Deutschland party as a \"confirmed rightwing extremist group\". On Thursday, Rubio took to X and wrote: \"Germany just gave its spy agency new powers to surveil the opposition. That's not democracy - it's tyranny in disguise. What is truly extremist is not the popular AfD - which took second in the recent election - but rather the establishment's deadly open border immigration policies that the AfD opposes.\" Rubio went on to say: \"Germany should reverse course.\" In a response on X, the German foreign ministry pushed back against the US secretary of state, saying: \"This is democracy. This decision is the result of a thorough & independent investigation to protect our Constitution & the rule of law. It is independent courts that will have the final say. We have learnt from our history that rightwing extremism needs to be stopped.\" Germany's response to Rubio comes after its domestic intelligence service, the Federal Office for the Protection of the Constitution (BfV), designated the AfD as a \"confirmed rightwing extremist\" force on Friday. The BfV's decision marks a step up from its previous designation of the country's anti-immigrant, pro-Kremlin and largest opposition party as a \"suspected\" threat to Germany's democratic order. According to the BfV, the AfD's xenophobic stances based on an \"ethnic-ancestry-based understanding\" of German identity are \"incompatible with the free democratic basic order\" as indicated by the country's constitution. The spy agency added that the AfD \"aims to exclude certain population groups from equal participation in society, to subject them to unconstitutional unequal treatment and thus to assign them a legally devalued status\". It also said: \"This exclusionary understanding of the people is the starting point and ideological basis for ongoing agitation against certain individuals or groups of people, through which they are defamed and despised indiscriminately and irrational fears and rejection are stirred up.\" During February's general election in Germany which was rocked by extensive US interference including public votes of confidence by staunch AfD supporters such as Elon Musk and JD Vance, the AfD amassed approximately 21% of the vote, finishing second. The far-right party's rise to popularity in Germany has come as a result of a broader wave of growing rightwing extremism across Europe. At the same time, public figures in the US have openly made remarks or gestures that are sympathetic to nazism, despite the Trump administration's sweeping crackdown on antisemitism across the country - a move which has been called into question by higher education institutions and Jewish senators who accuse Trump of targeting free speech. Musk, who had been given the designation of a \"special government employee\" by the Trump administration, made back-to-back apparent fascist salutes during the president's inauguration rally earlier this year. Last month, during a Capitol Hill hearing that sought to explore supposed government censorship under Joe Biden, Republican representative Keith Self quoted Joseph Goebbels, the Nazi propaganda minister under Adolf Hitler. \"A direct quote from Joseph Goebbels: 'It is the absolute right of the state to supervise the formation of public opinion,' and I think that may be what we're discussing here,\" he said.",
      "ml_hf_summary": "The German Foreign Ministry responded to US Secretary of State Marco Rubio's criticism of Germany's designation of the Alternative für Deutschland (AfD) party as a \"confirmed rightwing extremist group.\" The BfV, Germany's domestic intelligence service, upgraded its assessment of the AfD from \"suspected\" to \"confirmed,\" citing their xenophobic stances and incompatibility with German democratic principles.  The AfD garnered approximately 21% of the vote in February's general election, finishing second, as a result of growing right-wing extremism across Europe. Rubio criticized Germany's decision, arguing that it was tyranny disguised as democracy, while also highlighting US opposition to open border immigration policies. The German Foreign Ministry defended its decision, stating it was based on an independent investigation and would be subject to judicial review. \n"
    },
    {
      "title": "‘I know I might not come back’: the young Ukrainians enlisting early to fight Russia",
      "link": "https://www.theguardian.com/world/2025/may/03/i-know-i-might-not-come-back-the-young-ukrainians-enlisting-early-to-fight-russia",
      "published": "2025-05-03",
      "summary": "Kyiv has brought in new incentives for those under 25 in an effort to repopulate the frontline as the war grinds on",
      "content": "\"I'm not just here to avenge my brother,\" says Luntik, 20, one of Ukraine's newest soldiers, as he takes a break from training. He has joined up, he says, to try to liberate the territory of Ukraine from the Russian invaders: \"When the thief is coming to your house and you are afraid he might harm you or kill your wife, you will take actions and, if necessary, kill the thief.\" The mild spring day, somewhere in Kharkiv region, belies the seriousness of the conversation. Luntik is one of a dozen or so young recruits, all aged between 18 and 24, who have agreed to join Ukraine's army before the age of 25, at which men can be forcibly mobilised. The lure is a bonus of 1m hryvnia (nearly PS18,000), 0% mortgages and a short one-year contract; the scheme, launched in February, is a fresh effort to repopulate Ukraine's frontline. Luntik is a model recruit for the 92nd brigade, though his family story, like so many others three years into the full-scale Russian invasion, is difficult. His parents died before he grew up and he was raised by foster parents in Lviv. He lost one of his brothers, Serhii, 22, in fighting near Bakhmut earlier in the war, \"shot by a bullet in the neck\", but despite this, he says he is not afraid of death. \"I didn't come here to play cat and mouse. I know all the risks. I understand there is a situation where I might not come back\" Luntik says. On today's frontline, the typical Ukrainian soldier is far older, often in their 40s or 50s, frequently fighting with drones or other technologies that require patience and endurance, not physical strength. For the first two years of the war, the minimum age for potential conscription was 27, the maximum 60. It was lowered to 25, but the Biden and Trump administrations both pressed for it to be lowered to 18, arguing Ukraine was not doing enough to address shortages of personnel. Though Russia and Ukraine's armed forces are estimated to be roughly of a similar size - just over 600,000 - the Kremlin can draw on a far larger pool of people, particularly from the country's poorer regions. Russia's population, 140.8 million, is roughly four times those remaining in Ukraine (35.6 million). Most of the Ukrainians who were willing to join up and fight did so a long time ago, and many others who have not been drafted would rather leave the country than risk losing their lives in a war that, for all the talk about a ceasefire, continues to grind on. Though 10,000 young people initially expressed interest, fewer than 500 have signed up, an adviser to Ukraine's president has said, though a further 1,500 are said to be in the process of doing so. In the past month or so, the country's best-regarded units have been allowed to recruit young people - \"Mum, I joined Azov,\" reads a fresh campaign from one - but it is not clear this has much of a positive impact on numbers either, raising the question of why the extra money and short tour of duty has not proved particularly attractive. Volodymyr is 22, going on 23, he says, and is another of the new recruits. He says he wanted to join the army because \"if my children ask me some day: 'Dad what were you doing during the war?' I just want to have a proper answer for them. I want them to understand I was defending my country, the same as our fathers.\" But he acknowledges that even though he was keen to sign up, it took a while and the new scheme for him to do so. Before the war, Volodymyr spent time as a DJ between the ages of 16 and 18, followed by a short spell working in construction in Volyn region, which borders Poland to the west. After the full-scale invasion, he signed on for a territorial defence unit based there, but realised there was no prospect of the war coming to his part of the country. Wanting to do more, he tried to join the Third Assault Brigade, but said he was talked out of it by friends. \"They said if you go there you might die soon,\" and so he hesitated until the new contact offer arrived. Oleksiy Moskalenko, an analyst at the Come Back Alive foundation, which provides support to Ukraine's military, said that young people were often subject to a lot of pressure from friends and family, and the long years of war made it clear to people that \"it is easy to lose your life\". In February, President Volodymyr Zelenskyy said that 46,000 Ukrainians had been killed and 390,000 wounded and there is no shortage of stories of newly trained soldiers losing their lives within days or weeks of reaching the frontline, sometimes on hopelessly risky missions. But Moskalenko also argues that \"younger people were more disconnected from the public discourse\" because blotting out the war in their minds is \"a strategy to survive - it's rational to distance yourself from it\". At a lower intensity, Ukraine's war with Russia has been running since 2014, he adds, meaning it has always been part of the background of young people's lives. It helps, he adds, that \"it is always an option to hide, to run, or find other ways not to be recruited\" - though Ukraine is trying to make it harder for adult men to leave the country. The young recruits say they are not expecting to be sent to the frontline until June. Luntik will be in a reconnaissance unit, he says, while Volodymyr has been earmarked for a more dangerous infantry role, where combat life expectancy can be short. Both say they expect to rejoin the military after they serve their initial year, albeit after a short break for a holiday.But as Luntik emphasises: \"The first thing I need to do is survive.\"",
      "ml_hf_summary": "Ukraine's government has launched a new program offering financial incentives and shorter contracts to young men aged 18-25 to bolster its military forces. This initiative, launched in February, provides recruits with a bonus of approximately $18,000, 0% mortgages, and a one-year contract.  The program aims to address the shortage of personnel as Ukraine continues to fight against Russia's invasion. While over 10,000 young people expressed interest initially, fewer than 500 have signed up, highlighting the challenges in attracting recruits. The program has been implemented by units like the 92nd brigade, but its effectiveness remains unclear.  The war has had a significant impact on Ukrainian society, with many young men choosing to join the military or seeking refuge abroad. Despite the risks and uncertainties of the conflict, some young people are motivated by a desire to defend their country and provide answers for their children about their experiences during the war. \n"
    },
    {
      "title": "‘Protest shapes the world’: Rebecca Solnit on the fight back against Trump",
      "link": "https://www.theguardian.com/world/2025/may/03/protest-can-shape-the-world-rebecca-solnit-on-the-fight-back-against-trump",
      "published": "2025-05-03",
      "summary": "Demonstrations against the US president have been underplayed and dismissed, but a lifetime of activism has taught me how powerful collective action can be",
      "content": "On 5 April, millions of people rallied against the Trump administration and its campaigns of destruction. In small towns and big cities from Alaska to Florida, red counties and blue (and a handful of European cities), they gathered with homemade signs full of fury and heartbreak and sarcasm. Yet the \"Hands Off\" protests received minimal media coverage, and the general response was that they didn't do anything, because they didn't have immediate and obvious, and most of all quantifiable, consequences. I've heard versions of \"no one cares\", \"no one is doing anything\" and \"nothing came of it\" for all my activist life. These responses are sometimes a sign that the speaker isn't really looking and sometimes that they don't recognise impacts that aren't immediate, direct or obvious. Tracking those indirect and unhurried impacts, trying to offer a more complex map of the world of ideas and politics, has been at the heart of my writing. For more direct impact, at least when it came to the rally I attended in San Francisco, you could have walked six or seven blocks to the Tesla dealership. Weekly protests there since February, like those across the country and beyond, have helped tank the Tesla brand and Tesla shares. They remind Elon Musk that he's in retail, where the customer is always right - and right now the customer would like him and his Doge mercenaries to stop dismantling the US government the way a hog dismantles a garden. Tesla aside, activists sometimes really do have tangible results and even immediate ones. The protests around the world and in Seattle, where we blockaded the 1999 World Trade Organization meeting, encouraged the global south nations inside to stand up and refuse a raw deal from the global north and corporations. At that very meeting that very week. It might be the most immediately and obviously effective protest I ever attended, in fortysomething years of attending protests (even if protesting this version of corporate globalisation under the rubric \"free trade\" is hard to explain during a catastrophic tariff crisis). But that was an exception. Mostly protests, campaigns, boycotts and movements do a lot, but do it in less tangible and direct ways than these. They influence public opinion, make exploitation and destruction and their perpetrators more visible, shift what's considered acceptable and possible, set new norms or delegitimise old ones. Because politics arises from culture, if culture is our values, beliefs, desires, aspirations shaped by stories, images - and yeah, memes - that then turns into politics as choices and actions that shape the world. If you want to measure impact you need more sophisticated tools and longer timeframes than the many versions of \"where's the payoff for this thing we just did\". Take the Green New Deal, advocated for passionately by the young climate activists in the Sunrise Movement, starting around 2018. The simple story to tell about it is that, as legislation cosponsored by congresswoman Alexandria Ocasio-Cortez and senator Ed Markey, it did not pass. The complex story is that it shifted the frameworks in which we think about climate and economics in consequential ways. In other words, it was very effective, just not directly. It strongly influenced the Biden campaign's platform in 2020. His administration sought to pass it as Build Back Better and succeeded in doing so with the watered-down but still impactful Inflation Reduction Act, which influenced governments in other countries to amplify their own climate policies. (The Trump administration is dismantling some of it, but some will survive.) The Green New Deal as a proposal and campaign moved us beyond the old jobs-versus-the-economy framing that had plagued environmental activists for decades, making it clear that doing what the climate requires is a jobs-creation programme, and you could care about both. I don't hear the old framework any more, and one of the hardest things to detect in the department of indirect consequences is the thing that doesn't happen or the frame that no longer circulates. Jobs v environment is one. Another is the many stereotypes-become-slurs that treated female rape survivors as inherently dishonest and unreliable, deployed to protect countless rapists. This blanket discrediting is not part of the culture the way it was before the feminist insurrections that began in 2012-13. Seeing what's no longer there or what didn't happen is also an art, whether it's seeing the persecution that ceased or the forest that wasn't cut down. One of the aphorisms I have been coming back to for at least half my lifetime is \"everything should be as simple as possible, but not simpler\", attributed to Einstein and useful for almost everything. Because we get explanations of how things work - big things such as politics, change, history, human nature - that themselves don't work when they fail to account for the complexities, ambiguities, uncertainties and indirect and delayed influences and consequences. It's like hacking off all the limbs of a tree because you'd rather call it a log or because you haven't quite figured out what leaves and branches do. Or looking at a tree today and saying it isn't growing, since it hasn't visibly changed since yesterday. Which, put that way, sounds infinitely ridiculous and yet in speech - which, ideally, reflects thought - people do it all the time. As I write in my forthcoming essay anthology No Straight Road Takes You There: Essays for Uneven Terrain, \"It's not that I have anything against the easy, the immediate, the obvious, the straightforward, and the predictable. It's just that I think much of what we face and endeavour to achieve requires an embrace or at least a recognition of its opposite. So I have chased after the long trajectories of change as both the often forgotten events and ideas leading up to a rupture, a breakthrough, or a revolution, and the often overlooked indirect consequences that come afterward. I've celebrated how a movement that may not achieve its official goal may nevertheless generate or inspire those indirect consequences that matter sometimes as much or more than the original goal. I've also noticed how often a movement is dismissed as having failed during the slow march to victory, when victory comes. So much activism has, on the sidelines, people telling us we can't win, who routinely vanish if and when we do.\" One of the curiosities of American political life is that Republicans refuse to acknowledge the complexities and interconnections as ideology, but are very good at working with them practically, while the opposite is true of the Democrats. Republicans and the far right famously built power from the ground up, getting their people to run for school board and other low-level positions at the state and local level, working hard on winning state legislatures to pass voter-suppression measures that would help Republicans broaden their power even while they narrowed their support. They played the long game, patiently building power, pushing propaganda, recruiting - and of course did so with hugely wealthy foundations and billionaire donors who could afford to underwrite such efforts and provide the stability for such campaigns. In other respects, Republicans deny that everything or anything is connected to everything else, that actions and policies have consequences, that the shape of a life is not entirely up to that individual but is influenced by economic and social forces, that everything exists in relationship. It's convenient for rightwing ideology to deny the reality of environmental impacts, be it mining and burning fossil fuel or spreading toxins, because acknowledging the impact of individual and corporate actions would justify the regulations and collective responsibilities that are anathema to their deregulated free-enterprise rugged individual ethos. Likewise, it's convenient to claim that poverty and inequality are the result of individual failure, that the playing field is level and everyone has equal opportunity, because if you acknowledge that discrimination is real - well, discrimination is itself a system, and they prefer to deny systems exist. Democrats on the other hand have long recognised the existence of systems, including the systems that are the environment and climate, as well as the ugly systems of discrimination that have permeated American life such as racism, misogyny, homophobia and so forth. But they're remarkably bad at building political frameworks to address this, failing where Republicans succeed when it comes to the long game of building power from the ground up, being on message, having a long-term strategy and sometimes, it seems, any strategy at all. So we live in an environment of conflicting and confusing information, furthered by the way the mainstream media too often see background and context on what just happened as editorialising and bias, so tend to present facts so stripped of context that only those who are good at building context themselves can find meaning in them. Media outlets routinely play down protest and when they cover it often do so dismissively. Media critic and former Washington Post columnist Margaret Sullivan writes of the thin coverage of the Hands Off rallies: \"Organizers said that more than 100,000 demonstrators came to the protests in both New York and Washington DC. Crowd estimates are always tricky, but that certainly seems like a big story to me.\" She points out that for many months news outlets have commented on how the public resistance to Trump is so much quieter than in 2017. \"But when the protests did happen, much of the media reaction was something between a yawn and a shrug. Or, in some outlets, a sneer.\" Protests against Trumpism in 2017, which were probably sneered at and dismissed at the time, are now being used to dismiss 2025 protests. But the most precise calibrators of these protests, Erica Chenoweth and colleagues at the Crowd Counting Consortium, write: \"And since Jan. 22, we've seen more than twice as many street protests than took place during the same period eight years ago ... In February 2025 alone, we have already tallied over 2,085 protests, which included major protests in support of federal workers, LGBTQ rights, immigrant rights, Palestinian self-determination, Ukraine, and demonstrations against Tesla and Trump's agenda more generally. This is compared with 937 protests in the United States in February 2017.\" The Consortium counted 686 protests on 21 January, 2017, with total participation above 3 million, making the Women's March the biggest one-day protest in US history. Meanwhile more than 1,300 US rallies happened on 5 April this year. This is part of why it's hard to recognise the impact of such events; they're so often written out of the story of change. Mostly the story of change we get is that great men hand it down to us, and we should admire and be grateful to them and periodically implore them for more crumbs. This is built into how history narrows down the civil rights movement and all the crucial work done by women into a few great men, into how the decades of dedicated work by the abolitionist movement are written out of the version in which Abraham Lincoln freed the slaves out of the blue. It's built into the superhero movies in which problems are solved by musclebound men deploying violence to definitively defeat evil, when the real superheroes of our time mostly look like scruffy stubborn people who build alliances and networks and movements over years, with an occasional burst of drama in the legislatures, courts and streets (but mostly through stuff that looks like office work, even if it's administration for liberation). The language of \"save the whales/children/country\" suggests some kind of finality, and so do the plots of action movies. But evil comes back, so you have to keep defending your reproductive rights, your freedom of speech, your marriage equality, your forests and rivers and climate, even though maintenance is not as exciting as conflict. The phrase \"theory of change\" has become popular in recent years, as in \"what's your theory of change?\" Mine is that categories are leaky and anomalies abound. That change happens in complex, sometimes unpredictable ways, that it often unfolds with slow and indirect consequences, and that what ends up in the centres of power often begins in the margins and shadows. That stories have profound power and changing the story is often the beginning of changing the world. Something the current crisis in the US demonstrates is that power is rarely as simple as it's supposed to be. We see those who are supposed to be immensely powerful - captains of industry, prestige law firms, Ivy League universities - cringe and cave in fear while ordinary people (including lawyers and professors) stand on principle and judges mete out the law without intimidation. As for the unpredictability, I find hope in the fact that we're making the future in the present, and while you can't predict it with the certainty too many self-anointed prophets seem afflicted with, you can learn a lot from the patterns of the past - if you can remember the past and view events on the scale of those patterns that spread across decades and centuries. Places popular with tourists often put out maps that oversimplify the terrain on the assumption that we visitors are too dumb to contend with the real lay of the land, but those maps often mislead, literally, so you wander into a sketchy neighbourhood or a marsh that's not on the map. What I've tried to do as a writer is give people maps adequate to navigate the rocky, uneven territory of our lives and times. * No Straight Road Takes You There: Essays for Uneven Terrain by Rebecca Solnit will be published by Granta on 8 May. To support the Guardian, order your copy at guardianbookshop.com. Delivery charges may apply.",
      "ml_hf_summary": "This is a fascinating piece that explores the complexities of social change and the often-unpredictable nature of progress. Here's a breakdown of some key themes and insights:\n\n**1. The Complexity of Change:** \n\n* **Slow and Indirect Consequences:** Solnit emphasizes that societal shifts rarely happen in a neat, linear fashion.  Change is often slow, indirect, and unfolds through a series of seemingly insignificant actions and events.\n* **The Power of Stories:** She argues that narratives shape our understanding of the world and influence how we perceive change. Changing the story itself can be a powerful tool for driving progress. \n\n**2. The Importance of Marginality:**\n\n* **Power Dynamics:** Solnit highlights how power often resides in unexpected places, challenging the notion of \"great men\" as sole drivers of societal change. Ordinary people and their actions are crucial to dismantling established structures.\n* **The Unpredictability of Progress:**  She acknowledges that predicting the future is impossible, but learning from past patterns can provide valuable insights into navigating the present.\n\n**3. The Role of Maps and Navigation:**\n\n* **Navigating Complex Terrain:** Solnit uses the metaphor of maps to illustrate how we need tools for understanding complex social landscapes. \n* **Finding Our Way:**  She encourages readers to develop their own \"maps\" for navigating the challenges and opportunities of life, recognizing that progress is often a journey of exploration and discovery.\n\n**4. The Power of Collective Action:**\n\n* **The Strength in Numbers:** Solnit emphasizes the importance of collective action and building networks to achieve lasting change. \n* **Ordinary People Making a Difference:**  She celebrates the everyday actions of individuals who contribute to social progress, even when they don't have grand pronouncements or immediate recognition.\n\n\n**Overall, this piece is a powerful reminder that societal change is rarely straightforward.** It encourages us to embrace complexity, acknowledge the power of narratives and stories, and recognize the importance of collective action in navigating the uneven terrain of our lives. \n"
    },
    {
      "title": "‘This is your victory’: Churchill’s VE Day radio address to be broadcast by Timothy Spall",
      "link": "https://www.theguardian.com/world/2025/may/03/this-is-your-victory-churchills-ve-day-radio-address-to-be-broadcast-by-timothy-spall",
      "published": "2025-05-03",
      "summary": "Actor joins four days of national events including concerts, church services and a military procession in London",
      "content": "Eighty years after Winston Churchill addressed the nation from Downing Street with the words \"This is your victory!\" a recitation of his famous VE Day speech will be broadcast as the nation commemorates the day the Allies formally accepted Germany's surrender in 1945. Events across four days of national UK commemorations include a military procession through central London on Monday, with tens of thousands expected to line the route from Parliament Square to Buckingham Palace, and a service at Westminster Abbey on the 8 May anniversary on Thursday. The actor Timothy Spall, who portrayed Churchill in the film The King's Speech, will read extracts from the wartime prime minister's VE Day broadcast on Monday, as the Normandy veteran Alan Kennett, 100, formally starts the procession after being handed the Commonwealth War Graves Torch for Peace. More than 1,300 members of the armed forces and youth groups will march down Whitehall, through Admiralty Arch and up the Mall towards Buckingham Palace watched by the king and queen, senior royals, the prime minister and a number of second world war veterans. Members of the royal family will then watch a flypast from the palace balcony where, 80 years ago, George VI, Queen Elizabeth the Queen Mother and the princesses Elizabeth and Margaret made multiple appearances before a cheering crowd. Later, Charles and Camilla will host a tea party reception for about 50 veterans and members of the second world war generation at Buckingham Palace. The Cenotaph, the nation's focal point of remembrance, will be bedecked in union flags for the duration of the four-day commemorations, echoing the 1920 unveiling of the monument to the fallen. VE Day 80 street parties, barbecues and get-togethers have been organised by communities across the country, including a party on HMS Belfast, from which were fired some of the opening shots on D-day in 1944 and which protected Arctic convoys during the war. An installation of ceramic poppies will return to the Tower of London on Tuesday, comprising 30,000 of the original poppies from the 2014 display. On Tuesday evening, hundreds of buildings across the country will be lit up, including Buckingham Palace, 10 Downing Street and the Houses of Parliament. A Scotland Salutes VE80 concert will take place at Usher Hall in Edinburgh. On Wednesday, the Parliament Choir will host a Victory in Europe Day anniversary concert in Westminster Hall at the Palace of Westminster. At a VE Day event at the Imperial War Museum North in Greater Manchester, jointly produced by the IWM and the National Theatre, a performance will be based on wartime letters submitted by members of the public. A national service of remembrance will be held at Llandaff Cathedral in Cardiff. The actual anniversary on Thursday will be marked with a service at Westminster Abbey, to begin with a national two-minute silence. Commemoration events will conclude with a concert at Horse Guards Parade attended by about 10,000 people. The concert will feature stars of stage and screen including John Newman and dames Joan Collins, Mary Berry and Sheila Hancock, as well as military musicians, and tell the story of victory and the legacy of the second world war in Europe. Looking ahead to the commemorations, the prime minister, Keir Starmer, said: \"This 80th anniversary is a moment of national unity. A time to celebrate that hard-won peace, honour the memory of those who lost their lives, and remember the sacrifices made by so many to secure our freedom. \"Their legacy lives on today in how we stand together in defence of the values they fought for and which bind us together as a nation. This week, we come together to salute their service.\" Victory in Europe Day, celebrated on 8 May each year, marks the day the Allies formally accepted Germany's surrender in 1945. With German surrender eagerly anticipated, many had already draped their houses with bunting and bought union flags. On VE Day 1945, the then Princess Elizabeth, dressed in her Auxiliary Territorial Service uniform, slipped out of the palace and joined the cheering crowds outside incognito. She once described it as \"one of the most memorable nights of my life\". This will be the first significant VE Day anniversary without her. Lisa Nandy, the culture secretary, said: \"80 years ago millions of people celebrated the end of the second world war in Europe. This week, we will recreate this moment across towns and cities, in our homes, in pubs and on our streets. \"We must do all we can to ensure that the stories and memories of this period in our history are not forgotten. We must not forget the hardships, the heroics and the millions who lost their lives. \"We are here because of the sacrifices they made and the horrors they endured. This week, I urge the nation to come together and send a powerful message: we will remember them.\"",
      "ml_hf_summary": "The UK commemorates 80 years since Victory in Europe Day (VE Day) with four days of events across the country.  A military procession through central London on Monday features tens of thousands of participants, including veteran Alan Kennett who receives the Commonwealth War Graves Torch for Peace. The events include a service at Westminster Abbey on May 8th, a flypast from Buckingham Palace, and a concert featuring stars like John Newman and Joan Collins.  The Cenotaph will be adorned with union flags throughout the four-day commemoration.  Events also include street parties, installations of ceramic poppies, and a national service of remembrance in Cardiff. The Prime Minister's message emphasizes unity and remembering the sacrifices made during World War II. \n"
    },
    {
      "title": "Erdoğan tells protesters against Islamification in northern Cyprus they will fail",
      "link": "https://www.theguardian.com/world/2025/may/03/erdogan-tells-protesters-against-islamification-in-northern-cyprus-they-will-fail",
      "published": "2025-05-03",
      "summary": "Turkish president at odds with thousands of Turkish Cypriots who object to his attempts to undermine their secular way of life",
      "content": "Turkey's president, Recep Tayyip Erdogan, has warned protesters in breakaway northern Cyprus not \"to sow seeds of hatred\" amid mounting discord over Ankara's perceived attempts to Islamise one of the world's most secular Muslim societies. In a whirlwind visit to the Turkish-occupied territory on Saturday the leader had tough words for Turkish Cypriots who have stepped up demonstrations against policies he openly endorses, not least a controversial law allowing headscarves to be worn in schools. \"Those who try to disrupt our brotherhood, to create a rift between us, and to sow the seeds of hatred ... will not be successful,\" he said as he inaugurated a new presidential residence and parliament in the self-styled state. Later, as he addressed a technology festival, he went further, telling trade unions that opposed the measure: \"If you try to mess with our girls' headscarves in the Turkish republic of northern Cyprus, I am sorry, you will find us against you.\" On Friday thousands of Turkish Cypriots took to the streets of Nicosia, the country's war-split capital, chanting \"hands off our land\" as they denounced the legislation. In a speech before a crowd metres away from Turkey's embassy compound, Selma Eylem, who heads the Cyprus Turkish secondary education teachers' trade union, said the regulation was tantamount to imposing political Islam on a society that not only prided itself on its secular identity but inherently secular way of life. \"We say, once again, to the representatives of the AKP [Erdogan's Islamist-rooted party]: Keep your hands off our children and keep your hands off our society.\" Erdogan had hoped to use the trip to showcase Ankara's continuing support for a community that it had in 1974 sought to rescue when Turkish troops were ordered to invade Cyprus, seizing its northern third. The military operation had followed a rightwing, Athens-backed coup aimed at uniting the island with Greece. In the more than 50 years that have elapsed, the territory, which unilaterally declared independence in 1983, has been recognised by no other country but Turkey. Ahead of his visit officials had said that Erdogan's focus would be on the opening of the big government complex, financed by Ankara with the aim of promoting international acceptance for the isolated entity. On Saturday the Turkish president insisted that in the wake of decades of failed peace talks between Greek and Turkish Cypriots only \"a two-state solution\" could be discussed to resolve the west's longest running diplomatic dispute. \"The two-state solution is the joint vision of Turkey and northern Cyprus,\" he said. \"Any new negotiation process must be between two sovereign states.\" Friday's demonstration, which followed almost daily protests over the hijab law, was organised by more than 100 trade unions and civil societies many of which still advocate the island's reunification as a bi-zonal, bi-communal federation. \"Partly because of Kemalism but also because of eighty-two years of British colonial rule, Turkish Cypriots are by far the most secular Muslims in the world,\" said Hubert Faustmann, professor of history and political science at the University of Nicosia in the internationally recognised south. For Turkish Cypriots who have long opposed Ankara's ever-expanding influence in the north, the regulation, he said, was further proof of the leader's determination to not only erode long-held secular traditions but ultimately alter their own identity. \"What we are witnessing is a cultural clash,\" Faustmann said. \"The legislation on headscarves is seen as part of a package of continuous attempts by Erdogan to unwind the secular character of the community.\" With the backlash showing no sign of abating, Turkish Cypriots appear determined to have the measure repealed - even if it has been vigorously defended by the community's leader, Ersin Tatar, a close Erdogan ally who argues the law protects students from discrimination. \"If we are to save ourselves we have to continue this struggle,\" said Sener Elcil, a veteran former trade unionist. Increasingly, he lamented, Turkish Cypriots had been made to feel like a minority \"in our own land\" as a result of hundreds of thousands of mainland settlers moving to the north. \"Religion was never a point of division on this island but after years of building mosques that Turkish Cypriots don't even go to, they want to make it one in our schools,\" he added. \"Now, more than ever, we need to stand up to Erdogan and have our voices heard.\"",
      "ml_hf_summary": "Turkish President Recep Tayyip Erdoğan visited northern Cyprus on Saturday, where he inaugurated a new government complex and addressed protests against a controversial law allowing headscarves in schools. Thousands of Turkish Cypriots protested in Nicosia on Friday, denouncing the law as an attempt to impose political Islam on a secular society. Erdoğan defended the law, stating that those who oppose it will face opposition from Turkey. The visit aimed to showcase Ankara's support for northern Cyprus, which declared independence in 1983 and is recognized only by Turkey.  Erdoğan reiterated his stance on a \"two-state solution\" for Cyprus, while protesters continue to advocate for reunification as a bi-zonal, bi-communal federation.   \n\n\n"
    },
    {
      "title": "Israeli airstrikes kill at least 40 people in Gaza, officials say",
      "link": "https://www.theguardian.com/world/2025/may/03/israeli-airstrikes-gaza-death-toll-bureij-beit-lahiya-khan-younis",
      "published": "2025-05-03",
      "summary": "Bureij, Beit Lahiya, Gaza City and Khan Younis hit as Israeli government prepares to expand offensive",
      "content": "Israeli airstrikes have killed at least 40 people across Gaza during the past 24 hours, civil defence officials in the devastated Palestinian territory said, as Israel's government prepared to order an expansion of its military offensive. Nine people were killed when a strike hit a home in the Bureij refugee camp in central Gaza; another six people died in a separate strike targeting a family home in the northern city of Beit Lahiya; six more died in a strike on a community kitchen in Gaza City, and an overnight attack on the Khan Younis refugee camp killed at least 11 people including three babies up to a year old, the officials said. Asked to comment on the strikes, an Israel Defense Forces (IDF) spokesperson said the military \"takes feasible precautions to mitigate civilian harm\". Israel resumed its bombing campaign in Gaza on 18 March, ending a fragile ceasefire. Since then, at least 2,326 people have been killed, bringing the death toll since the war broke out to 52,418, according to the health ministry in Gaza. Israel has accused Hamas of using civilians as human shields, a charge denied by the radical Islamist organisation. It also accuses Hamas of stealing and selling aid to fund its military and other operations. The war was triggered by a surprise attack launched by Hamas into Israel on 7 October 2023. Militants killed more than 1,200 people on the Israeli side, mostly civilians, and abducted 251 people, 58 of whom are still held in Gaza, including 34 whom the Israeli military says are dead. Aid officials have warned of a humanitarian catastrophe in Gaza, with famine again looming. On Friday, the International Committee of the Red Cross (ICRC) warned that the humanitarian response in Gaza was on the \"verge of total collapse\". \"This situation must not - and cannot - be allowed to escalate further,\" Pascal Hundt, the ICRC's deputy director of operations, said in a statement. There has been no progress in faltering negotiations for a new ceasefire-for-hostages deal in recent weeks, and reports in Israeli media suggest Benjamin Netanyahu, the prime minister, will soon approve a new broader offensive as well as a new plan drawn up by Israeli officials for renewed distribution of aid in Gaza involving private contractors and a small number of \"hubs\" to be constructed in the south of the territory. Humanitarian officials in Gaza told the Guardian last week that the proposed Israeli aid plan was impracticable and unethical. \"The current scheme just won't work unless there are a lot more distribution hubs and even then we cannot be a party to something that may drive massive and possibly permanent displacement within Gaza,\" one senior humanitarian official said. The US president, Donald Trump, is thought to be likely to press Israel for some concessions on aid entering Gaza before he visits Saudi Arabia, the UAE and Qatar this month. A week ago, he told Netanyahu to be \"good to Gaza\". Analysts are divided on whether warnings issued to tens of thousands of Israeli reservists to expect to be called up in the coming days or weeks are designed to put further pressure on Hamas to make concessions in talks or are evidence that a new offensive in Gaza is imminent. Israel's military is already overstretched after 18 months of war, with a shortfall of about 7,000 combat soldiers. Government officials describe a \"seven-front war\" that could last another year. On Saturday morning, sirens sounded in Israel for the second day running, warning of an incoming missile launched by Iran-backed Houthi rebels in Yemen, who say the attacks are in solidarity with Palestinians in Gaza. Air defences intercepted the missile. Separately, Israel's military said on Saturday its forces deployed in southern Syria were ready to protect the Druze minority, without specifying whether this was a new deployment or giving further details on the number of troops on the ground. After deadly sectarian clashes near Damascus earlier this week, Israel has conducted multiple strikes it says were meant to protect the Druze community and warned Syria's Islamist rulers against harming the minority group. On Saturday, the Israeli military said that \"five Syrian Druze citizens were evacuated to receive medical treatment in Israel overnight\" after sustaining injuries on Syrian territory. A Druze official in the southern Syrian city Sweida said those evacuated had been wounded \"in clashes in Sahnaya\", the site of recent sectarian violence near Damascus, but were afraid of being sent to hospitals in the Syrian capital out of fear of being detained. Israel launched a new wave of more than 20 airstrikes in Syria late on Friday, according to the Syrian Observatory for Human Rights, a UK-based monitoring group. Early on Friday, Israel had launched an attack near the presidential palace in Damascus, which Syrian authorities condemned as a \"dangerous escalation\". Israel's defence minister, Israel Katz, warned on Thursday that Israel would respond forcefully if Syria's new government failed to protect the Druze minority. Since the fall of Bashar al-Assad's regime in December, Israel has launched repeated airstrikes on Syria. It has also sent troops to what was a demilitarised zone in the Golan Heights, on Syria's south-west border with Israel, seizing key strategic terrain where Syrian troops were once deployed. Analysts in Israel say the strategy aims to undermine the new Syrian government while also protecting and so co-opting a potential proxy ally within the country. The strategy is controversial, however, with some officials arguing that a stable Syria would better serve Israel's interests. The government in Damascus took power after ousting Assad and is dominated by the militant group Hayat Tahrir al-Sham, which has its roots in al-Qaida's jihadist network. Though Syria's new rulers have promised inclusive rule in the multiconfessional, multi-ethnic country, they face pressures from extremists within their own ranks. Agence France-Presse contributed to this report",
      "ml_hf_summary": "Israeli airstrikes have killed at least 40 people in Gaza over the past 24 hours, according to civil defense officials. The strikes targeted homes and community kitchens, resulting in a significant loss of life.  Since the war began on October 7th, 2023, at least 52,418 people have died in Gaza, with Israel accusing Hamas of using civilians as human shields.  The conflict has led to a humanitarian crisis in Gaza, with aid officials warning of famine and a potential displacement of residents. The Israeli government is preparing to expand its military offensive, while the US president, Donald Trump, is expected to pressure Israel for concessions on aid distribution. Tensions remain high, with reports of increased violence in Syria, including airstrikes targeting Syrian Druze communities and clashes near Damascus. \n"
    },
    {
      "title": "Rumours, rock-star cardinals and street cleaning: Rome gets ready for conclave ",
      "link": "https://www.theguardian.com/world/2025/may/03/rumours-rock-star-cardinals-rome-pope-conclave",
      "published": "2025-05-03",
      "summary": "Papal electors gossip in bars and restaurants and try to avoid journalists seeking clues to Pope Francis’s successor",
      "content": "Some journalists brave the warm spring sun, others seek respite in the shade of the Vatican's colonnades. Whatever their strategy, the aim is the same: to spot the red-capped cardinals emerging from Synod Hall and try to elicit from them a clue as to who will succeed Pope Francis. The men responsible for picking a new pontiff are enjoying rock-star status in Rome this week as they prepare for conclave: the secret, centuries-old ritual of electing a leader of the Catholic church that is due to begin on 7 May. Marina Garcia Dieguez is among the journalists partaking in the daily stakeout. She is a conclave novice, but was quick to suss out the cunning ways the cardinals try to avoid the gaggle of reporters. \"Each one has his own strategy,\" said Dieguez, who works for the Spanish radio station Cadena Ser and Mediaset Espana. \"Some already have cars with blacked-out windows waiting for them, so they can make a sharp exit. Others remove their red skullcaps and leave by foot, taking a route that crosses St Peter's Square, where they can get lost among the tourists, before escaping through Via della Conciliazione.\" It was at that point, she advised, that you stood a good chance of catching one. Dieguez had managed to obtain quotes from a couple, including Fernando Filoni, an Italian cardinal whose name cropped up this week among the favourites for pope. The Guardian's attempt to give chase was not as successful. \"I don't speak English, which at this precise moment, is a very good thing,\" said an Argentinian cardinal, before politely adding, in Italian: \"But we are working very well together,\" and striding off. About 180 cardinals from all over the world have been gathering each morning this week at Synod Hall to get to know each other and to share their visions of the church, but ultimately to establish a clear pope contender. Of that number, 133 are eligible to vote after two dropped out of the conclave for health reasons. Eight in 10 of the voters were appointed by Francis, with 20 becoming cardinals only in December. Francis made a point of selecting cardinals from places where there had never previously been one, such as Myanmar, Haiti and Rwanda. Until this past week or so, many had never met. During conclave, the men will be sequestered in their humble lodgings at Casa Santa Marta, the guesthouse where Pope Francis lived during his 12-year papacy, and the Sistine Chapel, where the voting takes place. The cardinals swear an oath of silence before each pre-conclave meeting and will do so again when the election begins. But until they are sequestered, it is in the bars and restaurants in the area surrounding the Vatican where the real talking happens, with some mischievous cardinals exploiting the press while they can to leak titbits or to discredit the main candidates. Al Passetto di Borgo, a restaurant in Borgo Pio, has been a favourite among Rome's clergy for years. According to a framed newspaper article hanging on the wall, this was the place where cardinals, over carbonara and tiramisu, plotted to ensure the election of Joseph Ratzinger in the 2005 conclave. Sean Patrick O'Malley, an American cardinal who leads a commission tasked with preventing clerical abuse against minors, was among the diners this week. Aged 80, O'Malley is too old to vote but has been named by some church-watchers as a possibility for pontiff. Another diner was Donald Wuerl, who in 2018 resigned as archbishop of Washington over his handling of a sexual abuse scandal. Showing a photo on his phone of a plain-clothed Wuerl in Al Passetto di Borgo, the restaurant's owner, Antonello Fulvimari, said: \"He's been coming here since 1969.\" The only information Fulvimari had been able to glean from his prestigious clients this week was that they wanted the conclave over \"as soon as possible\". \"They all want to get home,\" he added. \"But this is where the real decisions get made.\" Another popular restaurant is Marcantonio, although according to a waiter, the presence of cardinals has petered out because of journalists. Cardinals who want to spread rumours tend to resort to the veteran Vatican reporters from the Italian press. They have sought to diminish the credibility of some leading contenders - for example Pietro Parolin, the Vatican's secretary of state - by claiming they have health issues. Luis Antonio Tagle, a reformer from the Philippines and a strong favourite, has also had a rough ride from conservative cardinals after a video of him singing John Lennon's Imagine emerged on the internet. Another meeting point is reportedly Caffe dei Papi, a coffee bar tucked away from the main hubbub on Via Vespasiano. \"But I never know when they are here,\" said Ilda, the bar's manager. \"I just read about it in the newspaper.\" Unsurprisingly, the main chatter in the bar has revolved around who will be elected pope. \"I think it should be someone who embraces everyone,\" said Ilda. Vincenzo Aru, a building concierge who works nearby, is a lapsed Catholic and therefore indifferent. \"I'm just happy they've cleaned the streets,\" he said. \"The only time that happens around here is when a pope dies.\"",
      "ml_hf_summary": "The upcoming papal conclave in Rome will begin on May 7th, with approximately 180 cardinals from around the world gathering to elect a new leader of the Catholic Church.  Among those attending are 133 eligible voters, many of whom were appointed by Pope Francis and represent diverse geographical backgrounds. The cardinals will be sequestered at Casa Santa Marta and the Sistine Chapel during the conclave. While they are expected to maintain silence before meetings, informal discussions and potential leaks occur in restaurants like Al Passetto di Borgo and Marcantonio, where cardinals gather for meals and strategy sessions.  The selection process is shrouded in secrecy, with rumors circulating about potential contenders such as Fernando Filoni, Luis Antonio Tagle, and Donald Wuerl. The conclave's outcome will be determined by the cardinals' votes, which are expected to take place within the Sistine Chapel. \n"
    }
  ]
}