{
  "news": [
    {
      "title": "Friday Briefing",
      "link": "https://www.nytimes.com/2025/05/02/world/trump-waltz-ukraine-syria.html",
      "published": "2025-05-02",
      "summary": "A shake-up of Trump’s top aides.",
      "content": "Trump removed his national security adviser \n President Trump announced yesterday that he was removing his national security adviser, Michael Waltz, naming Secretary of State Marco Rubio as his interim replacement, and instead nominated Waltz as ambassador to the U.N. It was the first major personnel overhaul of top White House aides, and the kind of move he had wanted to avoid in his second term. \n Waltz had been on thin ice since he organized a group chat on the app Signal to discuss a sensitive military operation in Yemen and accidentally included a journalist. But even before the group chat leak, most of Trump's advisers viewed Waltz as too hawkish to work for a president who was eager to reach a nuclear deal with Iran and normalize relations with Russia. \n Rubio will hold both positions for now, something that no other official has done simultaneously since Henry Kissinger held the titles under the Nixon and Ford administrations. \n What's next: The selection of the next national security adviser will be a critical one, at a moment when the president's top aides have differed sharply on how to handle China, Russia and Iran.",
      "ml_hf_summary": "President Trump removed his National Security Advisor, Michael Waltz, appointing Secretary of State Marco Rubio as interim replacement.  Trump then nominated Waltz for the position of U.N. Ambassador. This move marks a significant personnel change in the White House, following concerns about Waltz's hawkish stance and a leaked group chat incident involving sensitive military operations. Rubio will hold both positions simultaneously, a feat not seen since Henry Kissinger during the Nixon and Ford administrations. The selection of the next National Security Advisor is crucial as Trump's top aides have differing views on how to address China, Russia, and Iran. \n"
    },
    {
      "title": "How Rubio Proved Himself as Trump’s Loyal Foreign Policy Foot Soldier",
      "link": "https://www.nytimes.com/2025/05/02/world/europe/trump-rubio-national-security-adviser.html",
      "published": "2025-05-02",
      "summary": "As Secretary of State, Marco Rubio has been Donald Trump’s reliable echo on issues like Iran, Ukraine and Gaza. But Steve Witkoff, the president’s friend, remains the chief negotiator.",
      "content": "After President Trump ousted Mike Waltz, his national security adviser, on Thursday night, he settled on someone less hawkish on Russia and willing to remain in lock-step with his foreign policy approach to Iran, Gaza and China. \n He didn't have to look far. \n By making Marco Rubio the top foreign policy adviser in the West Wing, in addition to his main day job as secretary of state, Mr. Trump turned to a one-time political rival who has spent the first three months of the administration as a loyal, globe-trotting foot soldier and a reliable echo of the president's agenda. \n Now Mr. Rubio will help run that agenda from inside both the White House and the State Department headquarters -- even as the president's longtime friend, Steve Witkoff, remains the chief negotiator, in charge of finding an end to the wars in Ukraine and Gaza and reaching a deal with Iran on its nuclear weapons program. \n Leslie Vinjamuri, the director of the U.S. and the Americas Program at Chatham House, a London-based research institute, said Mr. Rubio is \"willing to align and to follow with where Trump is. What we're getting, throughout this administration, is: Loyalty comes first, loyalty to the man, loyalty to the mission.\"",
      "ml_hf_summary": "President Trump replaced Mike Waltz as his national security advisor with Marco Rubio, who will now serve as top foreign policy advisor in addition to his role as Secretary of State. This appointment reflects a shift towards a more aligned approach on international issues like Iran, Gaza, and China, aligning with Trump's existing foreign policy stance.  Rubio has been a consistent supporter of Trump's agenda since joining the administration, and will now play a key role in implementing it from both the White House and State Department. Steve Witkoff continues to lead negotiations on Ukraine, Gaza, and Iran's nuclear program. \n"
    },
    {
      "title": "How the End of a U.S. Tax Loophole Hurts Chinese Companies",
      "link": "https://www.nytimes.com/video/world/asia/100000010138010/de-minimis-e-commerce-tax-exemption-explainer.html",
      "published": "2025-05-02",
      "summary": "A loophole that has allowed American shoppers to buy lots of cheap goods from mainland China and Hong Kong without paying tariffs and filling customs forms is closing on Friday. Meaghan Tobin, a correspondent for The New York Times covering business in Asia, explains.",
      "content": "2:25 \n How Trump Dismantled His First-Term Policy on Crimea \n NOW PLAYING \n How the End of a U.S. Tax Loophole Hurts Chinese Companies \n 2:13 \n How President Trump Caused Market Chaos \n Advertisement SKIP ADVERTISEMENT \n 1:36 \n The One Big Reason Canada's Liberals Won \n 2:23 \n Why Trump Sees Himself as a Man of Destiny \n 1:52 \n Why Trump Is Signing So Many Executive Orders \n Advertisement SKIP ADVERTISEMENT \n 2:29 \n What to Know About Trump's Crypto Company \n 3:22 \n What Are the Stakes in Canada's Elections? \n 2:50 \n Why Pope Francis Had a Complicated Relationship With Power \n Advertisement SKIP ADVERTISEMENT \n 2:30 \n How Colleges Are Turning Athletes Into Influencers \n 2:12 \n Why a Wisconsin Judge Was Arrested by the F.B.I. \n 2:04",
      "ml_hf_summary": "The provided text appears to be a list of video titles and timestamps, likely from a news website or streaming platform. It does not contain any article content.  Therefore, I cannot provide a summary of the news article as requested. \n"
    },
    {
      "title": "How Trump Dismantled His First-Term Policy on Crimea",
      "link": "https://www.nytimes.com/video/world/europe/100000010127983/trumps-u-turn-crimea.html",
      "published": "2025-05-03",
      "summary": "After more than three years of war, President Trump proposed a peace plan for Russia and Ukraine in late April that would have the United States recognize Moscow’s 2014 takeover of the Crimean peninsula. Michael D. Shear, a former White House correspondent for The New York Times in London, explains how the proposal, which Ukraine has rejected, is a reversal from Mr. Trump’s first term as president.",
      "content": "NOW PLAYING \n How Trump Dismantled His First-Term Policy on Crimea \n 1:35 \n How the End of a U.S. Tax Loophole Hurts Chinese Companies \n 2:13 \n How President Trump Caused Market Chaos \n Advertisement SKIP ADVERTISEMENT \n 1:36 \n The One Big Reason Canada's Liberals Won \n 2:23 \n Why Trump Sees Himself as a Man of Destiny \n 1:52 \n Why Trump Is Signing So Many Executive Orders \n Advertisement SKIP ADVERTISEMENT \n 2:29 \n What to Know About Trump's Crypto Company \n 3:22 \n What Are the Stakes in Canada's Elections? \n 2:50 \n Why Pope Francis Had a Complicated Relationship With Power \n Advertisement SKIP ADVERTISEMENT \n 2:30 \n How Colleges Are Turning Athletes Into Influencers \n 2:12 \n Why a Wisconsin Judge Was Arrested by the F.B.I. \n 2:04",
      "ml_hf_summary": "The provided text appears to be a list of video titles and descriptions, not an article with factual information. It seems to be from a news website or platform that features short summaries of various topics.  To summarize the content, it includes videos about political figures like Donald Trump, economic issues, and social trends. \n\n\n"
    },
    {
      "title": "Ukraine Rejects Russian Call for a Three-Day Cease-Fire",
      "link": "https://www.nytimes.com/2025/05/03/world/europe/ukraine-russia-ceasefire-talks.html",
      "published": "2025-05-03",
      "summary": "President Volodymyr Zelensky called the proposal a “theatrical show” and said such a short truce would not bolster negotiations for a lasting peace.",
      "content": "President Volodymyr Zelensky on Saturday said Ukraine will not adhere to a three-day cease-fire proposed by Russia, saying such a short truce would not help in negotiations for a lasting peace. \n Ukraine in March accepted a proposal from the Trump administration for a 30-day cease-fire, to be followed by talks on matters including the location of an armistice line, steps to safeguard a nuclear power plant occupied by the Russian army and deployment of a possible European peacekeeping force. \n On Saturday Mr. Zelensky told reporters in Kyiv that the Russian counteroffer of a three-day cease-fire covering the anniversary of the end of World War II in Europe, an important political holiday in Russia, was merely a \"theatrical show.\" \n He said Russia's offer was intended to \"create a soft atmosphere of an exit from isolation\" for President Vladimir V. Putin of Russia, and to assuage security worries of foreign leaders and dignitaries attending a Victory Day parade in Moscow on May 9. The Chinese president, Xi Jinping, has accepted an invitation to attend the parade.",
      "ml_hf_summary": "President Volodymyr Zelensky stated that Ukraine will not accept Russia's proposed three-day cease-fire, deeming it insufficient for lasting peace negotiations.  Ukraine previously agreed to a 30-day ceasefire in March under the Trump administration's proposal, which included discussions on an armistice line, nuclear power plant safety, and potential European peacekeeping deployment. Zelensky characterized Russia's offer as a \"theatrical show\" intended to create a favorable atmosphere for Putin and appease foreign leaders attending the Victory Day parade in Moscow.  Chinese President Xi Jinping has accepted an invitation to attend this event. \n"
    },
    {
      "title": "Ukraine war briefing: Zelenskyy hails ‘historic’ minerals deal as an equal partnership with US",
      "link": "https://www.theguardian.com/world/2025/may/02/ukraine-war-briefing-zelenskyy-hails-historic-minerals-deal-as-an-equal-partnership-with-us",
      "published": "2025-05-02",
      "summary": "Ukrainian president says the deal was the result of Vatican meeting with Donald Trump. What we know on day 1,164<strong>See all our Ukraine war coverage</strong>",
      "content": "Ukraine's president, Volodymyr Zelenskyy, has hailed the long-discussed minerals deal with the US as \"historic\", and suggested it had been much improved during those talks to now become \"an equal partnership\". In his nightly address, he said: \"The agreement has changed significantly during the preparation process. It is now truly an equal partnership - one that creates opportunities for substantial investment in Ukraine, as well as significant modernisation of Ukraine's industries and, equally importantly, its legal practices.\" He said the deal was the result of a \"meaningful meeting\" with Donald Trump at the Vatican on the fringes of Pope Francis's funeral service and that he looks forward to the further results arising from that meeting. Ukrainian analysts have noted that Kyiv has apparently been able to extract some major concessions, despite Donald Trump's repeated claim that Ukraine \"has no cards\" to play. \"Ukraine held the line. Despite enormous pressure, every overreaching demand from the other side was dropped. The final deal looks fair,\" Tymofiy Mylovanov, president of the Kyiv School of Economics, wrote on X. Notably absent from the final text was the insistence that Ukraine should repay previous military US assistance via the deal, something Trump has previously repeatedly demanded. The Kremlin was silent on Wednesday's agreement, but former Russian president Dmitry Medvedev claimed it meant Trump had \"broken the Kyiv regime\" because Ukraine would have to pay for US military aid with mineral resources. The deal will show the \"Russian leadership that there is no daylight between the Ukrainian people and the American people, between our goals,\" US treasury secretary Scott Bessent told Fox Business Network in an interview. \"And again, I think this is a strong signal to the Russian leadership, and it gives President Trump the ability to now negotiate with Russia on even a stronger basis,\" he said. His remarks appeared to send a signal to Russia that Washington remains aligned with Kyiv despite question marks over its commitment to its ally since Trump's return to power upended US diplomacy. The Trump administration will approve its first sale of military equipment to Ukraine since Trump took office, in an indication that the minerals deal signed by the two countries this week may open a path to renewed weapons shipments. The state department has certified a proposed licence to export \"$50m or more\" of defence hardware and services to Ukraine, according to a communication sent to the US committee on foreign relations. Trump paused all Ukraine-related military aid shortly after taking office. The state department announced a 30-year veteran of the foreign service to run the US embassy in Kyiv \"during this critical moment as we move toward a peace agreement to stop the bloodshed\". The appointment of Julie Davis, now the US ambassador to Cyprus, was announced the day after the minerals deal was signed. She has previously served as ambassador to Belarus and deputy ambassador to Nato. She replaces Bridget Brink, who announced she was leaving the post last month as the Trump administration pushed ahead with plans for peace talks that many believed favoured Moscow. French foreign minister Jean-Noel Barrot said on Thursday that the European Union was preparing a 17th round of sanctions against Russia, describing Vladimir Putin as the \"sole obstacle\" to peace in Ukraine. The 27-nation bloc has hit Russia with multiple rounds of sanctions in response to its invasion of Ukraine and said earlier this year that it would not lift them before the \"unconditional\" withdrawal of Moscow's forces from its neighbour. \"We Europeans will accompany this American [sanctions] initiative with a 17th package of sanctions and I committed yesterday to [US senator] Lindsey Graham that we would try to coordinate both the substance and the timing of these two packages of sanctions,\" Barrot told AFP in an interview. A Russian drone attack late on Thursday set buildings ablaze in Ukraine's south-eastern city of Zaporizhzhia, injuring 14 people, but causing no deaths, regional governor Ivan Fedorov said. Fedorov, writing on the Telegram messaging app, clarified earlier casualty figures, saying a report that one person was killed had proved to be untrue. One man buried under rubble had been pulled out alive, he said. Nine people were being treated in hospital. Fedorov said Russian forces had made at least 10 strikes on the city, targeting private homes, high-rise apartment buildings, educational institutions and infrastructure sites.",
      "ml_hf_summary": "Ukraine's President Zelenskyy signed a new minerals deal with the US, which he described as an \"equal partnership\" that will benefit Ukraine economically and legally. The deal was negotiated during a meeting between Zelenskyy and former President Trump at the Vatican, and it removes the previous demand for Ukraine to repay past military aid via the deal.  The Kremlin criticized the agreement, claiming it weakens Ukraine's position. US Treasury Secretary Scott Bessent stated that this deal will strengthen US-Ukraine relations and signal a strong stance against Russia. The US is also preparing to send military equipment to Ukraine, including $50 million worth of defense hardware and services. The EU is planning a 17th round of sanctions against Russia for its invasion of Ukraine.  A Russian drone attack in Zaporizhzhia injured 14 people but caused no deaths. \n"
    },
    {
      "title": "Friday briefing: Reform takes Labour scalp in knife-edge Runcorn byelection",
      "link": "https://www.theguardian.com/world/2025/may/02/friday-briefing-reform-takes-labour-scalp-in-knife-edge-runcorn-by-election",
      "published": "2025-05-02",
      "summary": "In today’s newsletter: Early indications of Conservative collapse in benchmark local elections",
      "content": "Good morning. Who knows if they were awake for it, but if so, Kemi Badenoch and Keir Starmer may wish they could go back to bed. In the by-election in Runcorn and Helsby, Labour's 49th safest seat, the party lost a majority of almost 15,000 to the Reform candidate Sarah Pochin after a recount - agonisingly being defeated by the margin of just six votes, the narrowest by-election victory in more than 100 years. In Lincolnshire, the former Conservative minister Andrea Jenkyns was announced as the new Reform mayor a few minutes ago. A caveat worth repeating: there is an awful lot of this story still to be told, because the results in councils are yet to be announced. We can say this, though: the results so far will have left Nigel Farage in a very good mood indeed. To follow the latest news and analysis as it lands, head to the live blog. The latest results are here. Today's newsletter, with the help of Josh Halliday in Runcorn, Robyn Vinter in Doncaster, and Ben Quinn in Lincolnshire, is about what we know so far. Here are the headlines. Five big stories US news | Trump's two top national security advisers, Mike Waltz and his deputy Alex Wong, are stepping down from their posts in the Trump administration. Waltz, who has faced intense scrutiny over the Signal group chat scandal, will be nominated as the US ambassador to the United Nations. Climate crisis | Nine London-based banks, including HSBC, Barclays, NatWest and Lloyds, have collectively put more than PS75bn ($100bn) into companies developing huge oil, gas and coal \"carbon bomb\" projects, a study has found. Experts say the 117 projects have the potential to produce the equivalent of a decade of total global carbon dioxide emissions. Ukraine | The White House will approve its first sale of military equipment to Ukraine since Donald Trump took office, in an indication that the minerals deal signed by the two countries this week may open a path to renewed weapons shipments. A senior aide to Volodymyr Zelenskyy said Kyiv hoped that weapons deliveries would resume swiftly. Cyber security | Harrods has been hit by a cyber-attack, just days after Marks & Spencer and the Co-op were targeted. The M&S attack, linked to a hacking collective known as Scattered Spider, wiped PS650m off the company's value as it was forced to stop website orders for almost a week. Culture | Dozens of artists - including Pulp, Paul Weller and Primal Scream - have come out in support of the band Kneecap, as counter-terrorism police said they were investigating videos of them allegedly calling for the deaths of MPs and shouting \"up Hamas, up Hezbollah\". As a planned gig in Plymouth was cancelled by the venue, the artists said there had been a \"clear, concerted attempt to censor and ultimately deplatform\" Kneecap. In depth: A good night for Nigel Farage - and pain for the Tories and Labour The first sign of the direction of the night came in North Tyneside, shortly after 2am, where Labour held the mayoralty - but saw their majority massively reduced. Labour's Karen Clark beat Reform's John Falkenstein by just 444 votes. In 2021, Clark's predecessor Norma Redfearn won with 53% of the vote; Clark prevailed with a shade over 30%. \"A win is a win,\" science minister Peter Kyle told the BBC. But a win can also be a warning. Here's what else you need to know. *** What happened in Runcorn? Nigel Farage was reported to have spent quite a lot of the night sitting in a car somewhere near the DCBL Stadium in Widnes, where votes in the Runcorn and Helsby by-election were being counted, ready to sweep in to claim the glory if it went Reform's way. He was waiting for a long time. The extraordinarily tight margin of the first count - four votes - was followed by a full recount, and close scrutiny of every ballot (\"I've seen more drawings of penises than I've ever seen in my life,\" one observer told Josh Halliday). At 4.24am, Farage made a premature claim of victory on social media, and said it was Labour that demanded the recount. He finally got out of a car with his candidate, former Conservative councillor Sarah Pochin, at 5.49am. A few minutes later, the result finally landed: Pochin had won. In her speech, hilariously delivered with the Monster Raving Loony Party candidate hovering inches to her left, she said that the voters had delivered an anti-system message: \"Enough is enough. Enough Tory failure. Enough Labour lies.\" This was a brutal result for Labour, given Runcorn was one of their 50 safest seats in the country at the general election. Keir Starmer stayed away from the seat, presumably hoping to avoid being too closely associated with a potential defeat: he may now be wondering if he might have swayed the four people he would have needed to fend off the Reform challenge. \"Bloody hell,\" Josh Halliday said in Widnes. \"It was pretty dramatic. Often when you do these things, you hear that it's too close to call, and actually most of the time people have a good idea who won. This time no one knew which way it would go right until the wire.\" *** What is the broader significance of the result? Pochin doesn't seem like a classic Reform candidate on paper: she has previously welcomed refugees, and appeared compassionate towards criminals in her role as a magistrate. \"But she was very much on message during the campaign,\" Josh said. \"'Stop the Boats', bashing Labour for letting prisoners out early, but also criticising them over the winter fuel allowance. She was quite provocative on sensitive local issues, with a video outside a local hotel housing asylum seekers and another one outside a Turkish barber's in the city centre.\" Ahead of the vote, there were suggestions that tactical anti-Reform voting might play a crucial role here. And the number of votes for the Green party and Lib Dems - 3,256 between them - suggests that that may have been the case. But it was not enough to hold off Reform, who may have similarly benefitted from Tory switchers. \"I spoke to a couple of Tories who said they were going to back Labour because they couldn't stomach Reform, and that probably made it closer than it would have been,\" Josh said. \"I've been here four times since the end of January, and it's felt like Reform's to lose - I wonder whether polls showing them winning made people ask if they really wanted a Reform MP. But at best, it cushioned the Labour defeat.\" Luke Tryl, of More In Common, said that one key question ahead of the by-election was whether Reform's momentum could be converted to actual votes against the traditional parties' \"get out the vote\" operations: \"Clearly they've done that in Runcorn,\" he said. \"Their performance in the by-election significantly exceeds the swing you might you expect based on current opinion polls.\" *** What else do we know so far? In Greater Lincolnshire, Reform's candidate Andrea Jenkyns - who you may remember giving the finger to protesters outside Downing Street in her previous incarnation as a Tory minister, and who campaigned on a \"DOGE Lincolnshire\" ticket - won comfortably: she won more than 100,000 votes, 42% of the total, against less than 65,000, or 26%, for her Conservative opponent. \"This is a painful blow to the Tories in an area that's one of their heartlands,\" said Ben Quinn, who was covering the count. \"It wasn't without damage for Labour as well - she annihilated the Tories across Lincolnshire, but even the places were Labour might have done better she beat them comfortably.\" In the West of England, Labour's Helen Godwin finished ahead of her closest rival, Reform's Arron Banks, by 5,945 votes - a much better performance for Reform than the polling had indicated. And in Doncaster, Labour's Ros Jones beat Reform's Alexander Jones by a whisker - 23,805 votes to 23,107. While that was a relief for Labour, it also represented a 21% swing to Reform. \"Everyone has been talking for quite a long time about Reform being a threat to the Tories, but this is a really good example of the threat they pose to Labour,\" said Robyn Vinter, who was covering the count there. \"The Conservatives actually did better than they could have expected, considering they've never won here before. Ros Jones told me she was frustrated with the national party over the winter fuel allowance cut and the Pip cut, which she thought had gone down very badly here.\" Those looking for a sense of how the Conservatives are likely to do in the many councils they hold across the country that are up for grabs were paying close attention to Staffordshire, where the Tories held 55 of 62 seats until yesterday. Of 30 results called by 5.30am, 24 had gone to Reform - every one of them previously held by a Conservative. Sam Freedman, author of the Comment is Freed Substack, reasonably called it an \"absolute shocker\" for the Tories, and added: \"I thought it was one of their best chances to hold a council and Reform are going to win it outright easily. I can't see them holding any of their 19 councils now.\" Across all of the council seats declared in England a short while ago, Reform had 66 seats - from a standing start - while the Tories were on 37, down 50, and Labour were on 11, down 13. *** What's still to come? Only one council was expected to complete their count overnight - Northumberland - and the results there should land soon. If the Tories lose control there, with Labour hopeful of becoming the largest party but with no one having overall control, it may be the start of a very long day for Kemi Badenoch. There's a break until 1pm when Durham are next to announce, and you can expect that void to be filled by considerable broadcast pontification. While Reform has undoubtedly had a good night, we should wait to see the council results before making any claims about the complete picture. The mood of the electorate presented by most recent polls - with Labour, the Conservatives and Reform all between 20% and 25% - means that quite small variations can make big changes to the overall result. The BBC publishes John Curtice's estimate of national vote share in the afternoon, and the final results drop around 7pm tonight: by then, we'll have a sense of just how ugly things might get for Badenoch and Starmer - and whether Reform really can claim to be the most popular party in England. What else we've been reading For this Guardian long read, Manvir Singh explores the myths and money-making behind the booming ayahuasca and magic mushrooms shaman trade. Annie Congratulations to Stuart Heritage on coming up with 20 Dwayne Johnson movies to do a Ranked! on. It's rough news for the four movies that are worse than Journey 2: The Mysterious Island, though. Archie He moved fast and destroyed things; Elon Musk's 100 days of chaos in the Trump White House is dissected by Nick Robins-Early. Annie Chris Stokel-Walker has a fascinating piece about ChatGPT's tendency to tell you what you want to hear, however unhinged your question might be - and what that reveals about the incentives in systems built to \"maximise retention, engagement and emotional buy-in\". Archie \"I don't want to die in a hotel room\": Ozzy Osbourne exclusively speaks to Alexis Petridis about chronic pain, 50 years on the road and Black Sabbath's final reunion. Annie Sport Football | Manchester United cruised to a 3-0 victory in their Europa League semi-final first leg in Spain against Athletic Bilbao, while Tottenham took a 3-1 win over Bodo/Glimt. Chelsea climbed to the top of the Conference League with their 4-1 semi-final win over Djurgarden, and in the Premier League, Brentford took advantage of Nottingham Forest's lax defence for a 2-0 win. Football | In a U-turn, the Football Association will ban transgender women from playing in women's football from 1 June following the ruling from the supreme court that the term \"woman\" in the Equality Act refers only to a biological woman. Darts | Luke Littler fought back to see off Michael van Gerwen 6-4 to win night 13 of the Premier League in Birmingham, setting a new record with a fifth overall evening victory of the season. Something for the weekend Our critics' roundup of the best things to watch, read, play and listen to right now TV The Four Seasons | This Tina Fey comedy is full of properly funny lines, rooted in properly middle-aged experience. In its comedy and its drama it captures the warm, weary affection for life and each other that only old friends and enduring couples really know. Part White Lotus without fatalities, part Gilmore Girls on HRT or Golden Girls with men, The Four Seasons is Fey and her writing and acting ensembles on fine form, everything informed by her rigorous intelligence, wit and experience. Rest your aching bones and enjoy. Lucy Mangan Film Thunderbolts* | Marvel's latest can be messy. Not just the movie, with its clumsily forced narrative beats and whiplash tonal shifts. But also, its title characters, the broken and lonely souls who ditch the colourful costumes and wear their emotions on their sleeves, as if it's their brand. It may irritate because the depression and trauma the movie supposedly grapples with so often lives on the surface, like easy characters traits that are spoken out loud or worn like another costume fitting. But if it ultimately works, it's all due to Florence Pugh - she's a superhero performer, easily navigating the tricky balance between cheeky Marvel-brand humour and genuine pathos. Stuart Heritage Book Bad Friend by Tiffany Watt Smith Watt Smith is a historian, and this book is a deeply researched study of 20th-century women's relationships, but the reason for writing it is intensely personal. In the prologue, she says that she fell out with her best friend, Sofia, in her early 30s, and has been battling with the feeling that she is incapable of close friendship ever since. With this book, she provides us with a blueprint for how to sustain friendships that are flawed, and sometimes painful - but more meaningful because they are real. Kitty Drake Music Model/Actriz: Pirouette | Whether the band are dealing in the tension of opposites or something more holistic, Pirouette is reliably exciting. You would struggle to describe its take on pop music as commercial when faced with something as overwhelming as Ring Road, but it's certainly more approachable than their debut Dogsbody, an album you almost had to brace yourself to listen to. At any rate, if that album was the kind of thing from which rabid cult followings are made, its successor is the kind of thing from which bigger cult followings are made. Model/Actriz still don't really sound like anything else. Alexis Petridis Today in Focus How Kneecap became most controversial band in the UK They shot to fame with their provocative blend of rap and republicanism, but their on-stage pronouncements have sparked shock and led to a media storm. Rory Carroll reports Cartoon of the day | Ben Jennings The Upside A bit of good news to remind you that the world's not all bad In the five years since the managers of the Sharpham estate in south Devon began an ambitious rewilding project on the 223 hectare estate, miraculous things have started to happen. Butterflies, woodland animals and insects have returned, and a flock of 500 goldfinches have appeared, drawn to the new food sources from the grasses and thistles that have grown over what used to be ploughed fields. For years the estate, originally created by a wealthy naval sea captain from the spoils of plundered Spanish treasure, has been hosting Buddhist-inspired mindfulness retreats. When the rewilding project began, the new director of the estate Julian Carnell wanted to build something that would combine the estate's mental health work with its conservation aims. Since then, they have designed the programme around ensuring that people can get access to the land and its natural environment, holistically. The hope is that in the coming years, as the project continues, more people, as well as the land itself, will continue to feel the benefits. Bored at work? And finally, the Guardian's puzzles are here to keep you entertained throughout the day. Until Monday. Quick crossword Cryptic crossword Wordiply",
      "ml_hf_summary": "This is a great summary of a news article! It covers:\n\n* **The main topic:** A political and social event in the UK (the rewilding project at Sharpham Estate) \n* **Key details:**  A brief overview of the project, its goals, and its impact.\n* **Positive tone:** The article highlights the positive outcomes of the project, such as increased biodiversity and improved mental health.\n* **Engaging elements:** It includes interesting facts like butterfly sightings and goldfinch flocks. \n* **Variety:**  It offers a mix of factual information, personal anecdotes, and entertainment (puzzles).\n\n\n**Here's what makes this summary effective:**\n\n* **Clear structure:** The article is organized logically, starting with the main topic and then providing details about the project.\n* **Concise language:** It uses clear and concise language to convey the key points of the article. \n* **Engaging tone:**  The use of descriptive language like \"miraculous things\" and \"holistically\" makes the summary more interesting.\n* **Variety of content:** The inclusion of different elements (facts, anecdotes, puzzles) keeps the reader engaged.\n\n\nOverall, this is a well-written summary that effectively conveys the main points of the article in an engaging and informative way. \n"
    },
    {
      "title": "Reform U.K. Wins Special Election in Runcorn by Just 6 Votes",
      "link": "https://www.nytimes.com/2025/05/02/world/europe/uk-election-reform-labour-runcorn.html",
      "published": "2025-05-02",
      "summary": "Nigel Farage’s right-wing populist party snatched a critical parliamentary seat from the governing Labour Party.",
      "content": "Nigel Farage's insurgent anti-immigration party, Reform U.K., scored a significant, if razor-thin, victory Friday in a parliamentary special election in the northwest of England and made sweeping gains in municipalities across England. \n The results served notice that Mr. Farage, a populist fixture and close ally of President Trump, is again a rising force in British politics. \n Reform's candidate, Sarah Pochin, won by just six votes over her Labour opponent, Karen Shore, in Runcorn and Helsby, seizing what had been a safe seat for the governing Labour Party until the incumbent, Mike Amesbury, was forced to resign after being convicted of assault for punching one of his constituents. \n The outcome -- the tightest in such an election in modern history -- was so close that the vote, 12,645 to 12,639, had to be recounted, delaying the official announcement for hours.",
      "ml_hf_summary": "Reform U.K., Nigel Farage's anti-immigration party, won a parliamentary special election in Runcorn and Helsby, England, by a razor-thin margin of six votes. This victory marks a significant resurgence for Farage in British politics, as he gained control of previously safe Labour seats following the resignation of Mike Amesbury due to assault charges. Sarah Pochin, Reform U.K.'s candidate, secured the seat with a narrow victory over Karen Shore, a Labour opponent. The election's close result required a recount, delaying official announcement for several hours. \n"
    },
    {
      "title": "Reform UK Surges as Conservatives Lose Seats: 4 Local Elections Takeaways",
      "link": "https://www.nytimes.com/2025/05/02/world/europe/uk-local-elections-results-reform-labour-conservative.html",
      "published": "2025-05-02",
      "summary": "Britain’s two main parties suffered significant losses in municipal and mayoral votes as Reform U.K., a right-wing populist party, surged ahead.",
      "content": "Nigel Farage's Reform U.K. party has emerged as the biggest winner of the first major polls since Labour swept into government last summer. \n Voters have been selecting councilors for about 1,600 municipal seats in 23 areas, as well as six regional mayors. \n Here are four takeaways from a night that saw Britain's two major political parties suffer significant losses. \n Reform U.K. is a serious force in British politics. \n The right-wing populist party headed by Mr. Farage won a special election in Runcorn and Helsby, in northwestern England, meaning it now has five lawmakers in Parliament. The party also won two mayoralties: in Greater Lincolnshire, and in Hull and East Yorkshire. It also gained control of several local authorities and won hundreds of municipal seats.",
      "ml_hf_summary": "The first major polls since Labour's government took office last summer showed Reform U.K., led by Nigel Farage, as the biggest winner.  Voters selected councilors for approximately 1,600 municipal seats in 23 areas and six regional mayors.  Reform U.K. secured a special election victory in Runcorn and Helsby, gaining five parliamentary seats. The party also won two mayoralties in Greater Lincolnshire and Hull and East Yorkshire, and gained control of several local authorities. Reform U.K.'s success indicates its growing influence within British politics. \n"
    },
    {
      "title": "Explosions Cripple Ship Carrying Aid to Gaza in the Mediterranean Sea",
      "link": "https://www.nytimes.com/2025/05/02/world/europe/freedom-flotilla-ship-aid-gaza-malta-thunberg.html",
      "published": "2025-05-02",
      "summary": "A human rights group operating the ship blamed a drone attack for the explosions, which caused a fire on the vessel. The crew was safe and remained on board.",
      "content": "A ship carrying 16 people and humanitarian aid to Gaza was rocked by explosions early Friday off the coast of Malta, setting the vessel on fire and putting it at risk of sinking, according to the human rights group operating the ship. \n The ship and its crew were safe after a tugboat helped extinguish the blaze following a mayday call, the government of Malta said in a statement. It did not say what had caused the fire, adding that the authorities were monitoring the ship, which was in international waters in the Mediterranean Sea. \n The ship, called Conscience and operated by a group called the Freedom Flotilla Coalition, left Tunisia earlier this week carrying human rights activists and aid. The group has sought to challenge Israel and Egypt's blockade of Gaza by trying to deliver humanitarian aid to the territory by sea. \n Before going to Gaza, the ship was scheduled to stop in Malta and pick up about 40 more people, including the Swedish activist Greta Thunberg, said Yasemin Acar, a spokeswoman for the group.",
      "ml_hf_summary": "A ship carrying 16 people and humanitarian aid to Gaza, named the Conscience, experienced explosions off the coast of Malta on Friday morning. The incident resulted in the vessel catching fire and posing a risk of sinking.  The crew was rescued by a tugboat after a mayday call, and the Maltese government is monitoring the situation. The ship departed Tunisia earlier this week with human rights activists and aid supplies, aiming to challenge Israel and Egypt's blockade of Gaza through seaborne delivery. Greta Thunberg was scheduled to join the group in Malta before continuing to Gaza. \n"
    },
    {
      "title": "Gaza humanitarian aid ship ‘bombed by drones’ in waters off Malta",
      "link": "https://www.theguardian.com/world/2025/may/02/gaza-humanitarian-aid-ship-bombed-drones-waters-off-malta",
      "published": "2025-05-02",
      "summary": "Freedom Flotilla Coalition claims Israel to blame for attack on unarmed civilian vessel in international waters",
      "content": "A ship carrying humanitarian aid and activists to Gaza has been bombed by drones and disabled while in international waters off Malta as it headed towards the Palestinian territory, its organisers have said. \"At 00:23 Maltese time, the Conscience, a Freedom Flotilla Coalition ship came under direct attack in international waters,\" the group said in a statement. \"Armed drones attacked the front of an unarmed civilian vessel twice, causing a fire and a substantial breach in the hull,\" it added, blaming Israel. The strike appeared to target the boat's generator early on Friday, leaving the boat without power and at risk of sinking, the activists said. Images posted to social media by the Freedom Flotilla Coalition showed a fierce blaze onboard the ship and two explosions. There was no confirmation or further evidence of the claim that drones caused the blasts, but images of the Conscience provided by Cypriot authorities showed significant damage. Twelve crew members and four civilians were \"confirmed safe\", the Maltese government said in a statement on Friday. \"The vessel had 12 crew members onboard and four civilian passengers; no casualties were reported,\" the statement said, adding that a nearby tug had been directed to aid the vessel. The group said activists from 21 countries were onboard on a \"mission to challenge Israel's illegal and deadly siege of Gaza and to deliver desperately needed, life-saving aid\". The statement read: \"Israeli ambassadors must be summoned and answer to violations of international law, including the ongoing blockade and the bombing of our civilian vessel in international waters.\" Israel has not commented on the allegation. According to the monitoring website MarineTraffic, the Conscience left the Tunisian port of Bizerte on Tuesday and arrived in the area where it reported being attacked on Thursday morning. The ship was heading to a point near Malta where it was to pick up activists, including the climate-change campaigner Greta Thunberg, from a smaller vessel. Thunberg confirmed to Reuters she was in Malta and had been supposed to board the ship. \"I was part of the group who was supposed to board that boat today to continue the voyage towards Gaza, which is one of many attempts to open up a humanitarian corridor and to do our part to keep trying to break Israel's illegal siege on Gaza,\" she said. \"This attack caused an explosion and major damage to the vessel, which made it impossible to continue the mission.\" The group said it had been organising a non-violent action under a media blackout in order to avoid any potential sabotage. A previous sailing launched by the coalition from southern Turkey in 2010 ended in bloodshed when Israeli forces stormed the Mavi Marmara vessel, killing 10 people and wounding 28. Turkey's foreign ministry said Turkish nationals were on board the Conscience at the time of the incident. \"We condemn in the strongest terms this attack on a civilian ship,\" it said, noting that there were \"allegations that the ship was targeted by Israeli drones\". \"All necessary efforts will be made to reveal the details of the attack as soon as possible and to bring the perpetrators to justice,\" it said. Israel imposed a tight blockade on Gaza two months ago, allowing no food, fuel, medicine or other item into the territory, and resumed intense military operations in Gaza in mid-March after a fragile ceasefire collapsed. Humanitarian organisations in Gaza have distributed the last of their stocks of flour and other foodstuffs. Officials in the devastated Palestinian territory said on Friday that the kitchens that serve basic meals to those with no other option would be forced to close within a week to 10 days. On Friday, the International Committee of the Red Cross said it would not have access to food, medicine and life-saving supplies needed for many of its Gaza programmes unless aid deliveries resumed immediately. \"Aid must be allowed to enter Gaza. Hostages must be released. Civilians must be protected,\" it said. \"Without immediate action, Gaza will descend further into chaos that humanitarian efforts will not be able to mitigate.\" Medical workers in Gaza's remaining health facilities said they were now prioritising cases to make sure available medical stocks were reserved for the most serious. Medicine for chronic diseases such as cancer, diabetes and high blood pressure is virtually unobtainable, officials said. \"I don't know how people are managing. They have lost everything. The displacement continues every day and more people are searching for shelter and whatever they need to survive,\" said Amjad Shawa, the director of the Palestinian NGOs Network in Gaza. A UN team has been sent to the devastated Palestinian territory to assess levels of malnutrition and the risk of famine. Israeli officials justify the blockade with claims that Hamas routinely steals aid, distributing it to its fighters or selling it. Aid officials in Gaza deny any widespread theft of aid in recent months. Media in Israel have reported a plan to use private contractors to distribute food from centralised hubs protected by the Israeli military to Palestinians who have been vetted. Humanitarian officials in Gaza say the plan is unworkable and potentially illegal. The war in Gaza was triggered by Hamas's attack on southern Israel in October 2023, which resulted in the deaths of about 1,200 people, mostly civilians. The health ministry in Hamas-run Gaza said on Thursday that at least 2,326 people had been killed since Israel resumed strikes, bringing the overall death toll since the war broke out to 52,418, also mostly civilians.",
      "ml_hf_summary": "A humanitarian aid ship carrying activists from the Freedom Flotilla Coalition was attacked by drones while in international waters off Malta on Thursday morning. The attack disabled the ship's power and caused significant damage, leaving it at risk of sinking.  The group claims Israel is responsible for the attack, but Israel has not commented. Twelve crew members and four civilians were confirmed safe, with a nearby tug assisting the vessel. The incident occurred as activists attempted to deliver aid to Gaza, which faces a severe humanitarian crisis due to an ongoing blockade imposed by Israel. The International Committee of the Red Cross has warned that without immediate action, Gaza will descend further into chaos.  The UN is assessing levels of malnutrition and famine in the territory. \n"
    },
    {
      "title": "Death Toll Rises Sharply in a Wave of Sectarian Violence in Syria",
      "link": "https://www.nytimes.com/2025/05/01/world/middleeast/syria-sectarian-violence-100-killed.html",
      "published": "2025-05-02",
      "summary": "With more than 100 people killed this week in a region controlled by the Druse minority, Druse leaders signaled new willingness to join forces with the Sunni Muslim-dominated government.",
      "content": "The death toll from this week's outbreak of sectarian violence in Syria has surpassed 100, a war monitoring group said on Thursday, after clashes between pro-government forces and militants from Syria's Druse minority spread to new areas. \n But by Thursday night, government representatives had struck accords with Druse leaders in a bid to calm the violence. The move also appeared to be a step toward achieving the new government's goal of integrating the complex web of armed groups operating across the country into a national military. Leaders in the Druse-controlled Sweida region, previously reluctant to unite with government forces, expressed openness to doing so. \n The unrest began on Tuesday after an audio clip circulated on social media purporting to be of a Druse cleric insulting the Prophet Muhammad. The cleric denied the accusation, and Syria's Interior Ministry said he was not involved. \n Nevertheless, armed Sunni Muslim extremist groups began attacking areas with large Druse populations, including the town of Jaramana near the capital, Damascus. Druse militias responded in force and the government sent forces to quell the unrest.",
      "ml_hf_summary": "Sectarian violence erupted in Syria this week, resulting in over 100 deaths according to a war monitoring group. Clashes between pro-government forces and Druse militants escalated after an audio clip alleging blasphemy against Prophet Muhammad was circulated online.  The Syrian government reached accords with Druse leaders to quell the violence, aiming to integrate armed groups into a national military force. The unrest began on Tuesday and spread to areas with large Druse populations, including Jaramana near Damascus. \n"
    },
    {
      "title": "Israel Launches Airstrikes Near Syrian Presidential Palace",
      "link": "https://www.nytimes.com/2025/05/02/world/middleeast/israel-syria-druse-strikes.html",
      "published": "2025-05-02",
      "summary": "It was the second time in days that Israel intervened militarily in Syria amid a wave of sectarian violence there.",
      "content": "Israeli fighter jets struck near the Syrian presidential palace on Friday in what Israeli leaders said was a warning to the government to protect the Druse minority after a new wave of sectarian violence. \n More than 100 people were killed this week in clashes involving a number of parties, including Sunni Muslim extremists not fully under the government's control, forces from the new government and fighters from the country's Druse minority. \n The Israeli strike was the latest in a series of attacks on Syria over the past months aimed at preventing weapons and territory near Israel's borders from falling into the hands of hostile forces. But it was also a reminder that the new Syrian government has little recourse beyond condemning such attacks as it struggles to gain control over a fractured country and unify it following almost 14 years of civil war. \n Both Israel and Syria have large Druse communities. And Israel has offered before to protect the Syrian Druse should they come under attack during the tumultuous transition of power in the country after Islamist rebels overthrew the dictatorship of Bashar al-Assad in December.",
      "ml_hf_summary": "On Friday, Israeli fighter jets struck near the Syrian presidential palace, citing a need to warn the government to protect the Druse minority following sectarian violence. Over 100 people were killed this week in clashes involving Sunni Muslim extremists, the new Syrian government, and fighters from the Druse minority. This strike was part of a series of Israeli attacks aimed at preventing weapons and territory near Israel's borders from falling into the hands of hostile forces. The Syrian government faces challenges unifying the country after almost 14 years of civil war and has limited recourse to respond to such attacks, as they are largely condemned by the government.  Both Israel and Syria have large Druse communities, and Israel previously offered protection for the Druse during the transition of power in Syria following the overthrow of Bashar al-Assad. \n"
    },
    {
      "title": "Israel says airstrikes in Syria are ‘message’ to protect Druze minority",
      "link": "https://www.theguardian.com/world/2025/may/02/israel-says-airstrikes-in-syria-are-message-to-protect-druze-minority",
      "published": "2025-05-02",
      "summary": "Syria says at least one civilian killed in latest strikes, while most Druze leaders rebuff Israeli protection",
      "content": "Israeli warplanes have carried out a series of airstrikes outside Damascus and across Syria, after warnings from Israeli officials that the country would intervene to protect the Syria's minority Druze sect. The airstrikes targeted a Syrian military site in the Damascus suburb of Harasta, as well as hitting unknown targets in Deraa province in south Syria and Hama province in north-west Syria. At least one civilian was killed and four people were injured as a result of the Israeli bombings late Friday night, according to Syrian state media. The latest round of strikes come after Israel killed four civilians earlier on Friday in a bombing in southern Syria and struck the vicinity of Syria's presidential palace. Syria's new rulers had angrily denounced the raids launched by Israel's air force against unidentified targets near the presidential palace earlier in the day, warning of a \"dangerous escalation\". Syria's presidency called the strike \"a dangerous escalation against state institutions and its sovereignty\" and accused Israel of destabilising the country. Israeli officials said the attacks were intended to send a message to the Syrian government after days of bloody clashes near Damascus between pro-government militia forces and fighters from the Druze minority sect. Benjamin Netanyahu, Israel's prime minister, and the defence minister, Israel Katz, said in a joint statement that the attack early on Friday, the second this week in Syria, was intended to deter the country's new leadership from any hostile move against the Druze. \"This is a clear message to the Syrian regime. We will not allow the deployment of forces south of Damascus or any threat to the Druze community,\" the statement said. The Israeli army confirmed in a statement that fighter jets struck near to the area of the palace of the president, Ahmed al-Sharaa, in Damascus but gave no further details. Israel has said that it will protect the Druze religious minority in Syria, a declaration that most Druze leaders have rebuffed. The head of the UN Independent International Commission of Inquiry on Syria condemned the Israeli strikes in an interview with Al Jazeera on Friday. \"The Israeli attacks on Syria are absolutely unacceptable. There is nothing in international law that allows for pre-emptive bombing,\" said Paulo Sergio Pinheiro, the chair of the commission. The government in Damascus took power after ousting Bashar al-Assad in December last year and is dominated by the militant group Hayat Tahrir al-Sham, which has its roots in the al-Qaida jihadist network. Though Syria's new rulers have promised inclusive rule in the multi-confessional, multi-ethnic country, they face pressures from extremists within their own ranks. Clashes broke out in Druze-majority areas outside Damascus on Tuesday after an audio clip circulated on social media of a man making derogatory comments about the prophet Muhammad. The clip, which was falsely attributed to a Druze cleric, angered many Sunni Muslims, but may have been fabricated. On Thursday, one of the three Syrian Druze spiritual leaders, Sheikh Hikmat al-Hijri, accused Syria's government of what he called an \"unjustified genocidal attack\" on the minority community. Hijri released a statement calling for international protection for the Druze in southern Syria, asking international forces to \"intervene immediately\". The two other Syrian Druze religious leaders chose to negotiate with Damascus directly and rejected calls for international intervention in Syria. A UK-based monitoring group, the Syrian Observatory for Human Rights, said 56 people in Sahnaya and the Druze-majority Damascus suburb of Jaramana were killed, including local armed fighters and security forces. The Druze religious sect began as a 10th-century offshoot of Ismailism, a branch of Shia Islam. More than half of the roughly 1 million Druze worldwide live in Syria, largely in the southern Sweida province and some suburbs of Damascus. Most of the other Druze live in Lebanon and Israel, including in the Golan Heights, which Israel captured from Syria in the 1967 war and annexed in 1981. The Syrian government has denied that any of its security forces were involved in the clashes with the Druze, which followed a wave of massacres in March when security forces and allied groups killed more than 1,700 civilians, mostly from Bashar al-Assad's Alawite community, according to the Syrian Observatory for Human Rights. Since the fall of Assad's regime in December, Israel has launched repeated airstrikes on Syria, destroying military hardware and stockpiles, in what it says is defence of the Druze. Israel has also sent troops to what was a demilitarised zone in the Golan Heights, on Syria's south-west border with Israel, seizing key strategic terrain where Syrian troops were once deployed. Analysts in Israel say the strategy aims to undermine the new Syrian government while also protecting and so co-opting a potential proxy ally within the country. The strategy is controversial, however, with some officials arguing that a stable Syria would better serve Israel's interests. The Syrian president, Sharaa, told a visiting US congressman last week that Damascus wanted to normalise ties with Israel.",
      "ml_hf_summary": "Israeli airstrikes targeted military sites in Damascus and across Syria on Friday night following warnings from Israeli officials about protecting the country's Druze minority sect.  The strikes hit locations near the Syrian presidential palace and other areas, resulting in at least one civilian death and injuries to four others. The attacks came after clashes between pro-government militia forces and Druze fighters near Damascus, prompting Israel to issue a statement warning Syria against any hostile action towards the Druze community.  Syria's new leadership condemned the Israeli strikes as an escalation of tensions and accused Israel of destabilizing the country. The UN Independent International Commission of Inquiry on Syria condemned the attacks, while some Syrian Druze leaders called for international intervention.  Israel maintains its commitment to protecting the Druze community in Syria, but their actions have been met with mixed reactions from both sides. \n"
    },
    {
      "title": "Syria calls Israeli air strikes on Damascus a ‘dangerous escalation’",
      "link": "https://www.theguardian.com/world/2025/may/02/israel-launches-airstrikes-near-syria-presidential-palace-in-damascus",
      "published": "2025-05-02",
      "summary": "Benjamin Netanyahu says strike intended to deter Syria’s new leadership from any hostile move against the Druze",
      "content": "Syria's new rulers have angrily denounced raids launched by Israel's air force against unidentified targets near the presidential palace in Damascus, warning of a \"dangerous escalation\". Israeli officials said the attacks were intended to send a message to the Syrian government after days of bloody clashes near Damascus between pro-government militia forces and fighters from the Druze minority sect. Benjamin Netanyahu, Israel's prime minister, and the defence minister, Israel Katz, said in a joint statement that the attack early on Friday, the second this week in Syria, was intended to deter the country's new leadership from any hostile move against the Druze. \"This is a clear message to the Syrian regime. We will not allow the deployment of forces south of Damascus or any threat to the Druze community,\" the statement said. The Israeli army confirmed in a statement that fighter jets struck near to the area of the palace of the president, Ahmed al-Sharaa, in Damascus but gave no further details. On Friday, an Israeli fighter jet killed four civilians in another strike on Kanaker, a town south-west of the Druze-majority province Sweida. The strike came after repeated statements by a spokesperson for the Israeli military that it was deployed in southern Syria to prevent the entry of \"enemy forces\" into Druze villages. Israel has said it will protect the Druze religious minority in Syria, a declaration that most Druze leaders have rebuffed. The government in Damascus took power after ousting Bashar al-Assad in December last year and is dominated by the militant group Hayat Tahrir al-Sham, which has its roots in the al-Qaida jihadist network. Though Syria's new rulers have promised inclusive rule in the multi-confessional, multi-ethnic country, they face pressures from extremists within their own ranks. Syria's presidency called the strike \"a dangerous escalation against state institutions and its sovereignty\" and accused Israel of destabilising the country. The clashes broke out on Tuesday after an audio clip circulated on social media of a man making derogatory comments about the prophet Muhammad. The clip, which was attributed to a Druze cleric, angered many Sunni Muslims, but may have been fabricated. On Thursday, one of the three Syrian Druze spiritual leaders, Sheikh Hikmat al-Hijri, accused Syria's government, which is mostly made up of radical Islamist groups led by Hayat Tahrir al-Sham, of what he called an \"unjustified genocidal attack\" on the minority community. Hijri released a statement calling for international protection for the Druze in southern Syria, asking international forces to \"intervene immediately\". The two other Syrian Druze religious leaders chose to negotiate with Damascus directly and rejected calls for international intervention in Syria. A UK-based monitoring group, the Syrian Observatory for Human Rights, said 56 people in Sahnaya and the Druze-majority Damascus suburb of Jaramana were killed, including local armed fighters and security forces. The Druze religious sect began as a 10th-century offshoot of Ismailism, a branch of Shia Islam. More than half of the roughly 1 million Druze worldwide live in Syria, largely in the southern Sweida province and some suburbs of Damascus. Most of the other Druze live in Lebanon and Israel, including in the Golan Heights, which Israel captured from Syria in the 1967 war and annexed in 1981. The Syrian government has denied that any of its security forces were involved in the clashes with the Druze, which followed a wave of massacres in March when security forces and allied groups killed more than 1,700 civilians, mostly from Bashar al-Assad's Alawite community, according to the Syrian Observatory for Human Rights. Asaad al-Shaibani, the Syrian foreign minister, called for \"national unity\" on Thursday, as \"the solid foundation for any process of stability or revival\". \"Any call for external intervention, under any pretext or slogan, only leads to further deterioration and division,\" he wrote on X. Since the fall of Assad's regime in December, Israel has launched repeated airstrikes on Syria, destroying military hardware and stockpiles, in what it says is defence of the Druze. Israel has also sent troops to what was a demilitarised zone in the Golan Heights, on Syria's south-west border with Israel, seizing key strategic terrain where Syrian troops were once deployed. Analysts in Israel say the strategy aims to undermine the new Syrian government while also protecting and so co-opting a potential proxy ally within the country. The strategy is controversial, however, with some officials arguing that a stable Syria would better serve Israel's interests. The Syrian president, Sharaa, told a visiting US congressman last week that Damascus wanted to normalise ties with Israel. Protesters from the Druze community in Israel temporarily blocked roads on Thursday night and called for the Israeli government to protect the Druze community in Syria. Underlining the regional dimension of the conflicts involving Israel, Qatar, a main backer of Syria's new rulers, called Friday's Israeli airstrike \"blatant aggression against the sovereignty\" of the country, while warning alarms sounded across much of northern Israel on Friday before air defence systems intercepted a missile that military officials said had been launched from Yemen by Iran-backed Houthi rebels. The Houthis have repeatedly targeted Israel since the outbreak of the war in Gaza 18 months ago.",
      "ml_hf_summary": "On Friday, Israel conducted airstrikes near Damascus' presidential palace, targeting unidentified locations after clashes between pro-government militia and Druze fighters.  Israel stated these strikes were intended to deter Syria's new leadership from hostile actions against the Druze community. The Syrian government condemned the attacks as an escalation of tensions and accused Israel of destabilizing the country.  The Israeli military confirmed the airstrikes, but provided no further details.  A separate incident saw a civilian death in Kanaker, south-west of Sweida province, where Israel claims to be preventing \"enemy forces\" from entering Druze villages. The Syrian Observatory for Human Rights reported 56 deaths in clashes between security forces and armed groups, mostly Druze.  Israel has launched repeated airstrikes on Syria since Assad's regime fell, aiming to undermine the new government while protecting the Druze community. This strategy is controversial, with some arguing a stable Syria benefits Israel more than any intervention. The conflict highlights regional tensions involving Israel, Qatar, and Iran-backed Houthi rebels in Yemen. \n"
    },
    {
      "title": "‘Not everybody who voted for Carney quite knows what they got’: Canada eyes its new prime minister",
      "link": "https://www.theguardian.com/world/ng-interactive/2025/may/03/mark-carney-canada-prime-minister",
      "published": "2025-05-03",
      "summary": "Standing up to the erratic US president will be a key task for Mark Carney, but experts say economic challenges might prove far more testing",
      "content": "For most of his adult life, Mark Carney has thrived in a world where facts matter and logical arguments can suffice. But Canada's prime minister, who until this week had never held elected office, now enters a domain in which personal slights, ambition and ego often hold more sway than truth or reason. And Carney, who dealt with politicians, some hostile, as a central banker, has now become one, occupying a role in which he's all but guaranteed to disappoint someone. On Monday, Carney led Canada's Liberal party to a victory that only months ago few would have thought possible. Running as the candidate best-equipped to defend Canada's sovereignty against Donald Trump, he emerged with a minority government. After a congratulatory phone call on Wednesday, Donald Trump called Carney a \"very nice gentleman\", said the prime minister \"couldn't have been nicer\" and predicted \"we're going to have a great relationship\". Notably, he did not refer to Carney as \"governor\" - a slight he appeared to have reserved for the former leader Justin Trudeau. The pair will meet at the White House on Tuesday - their first in-person encounter in Carney's role as prime minister. Carney used his first post-election press conference to once again quash any idea Canada was interested in becoming the 51st US state, a proposal repeatedly floated by Trump. \"It's always important to distinguish want from reality,\" Carney said on Friday, referring to a firm belief that Canada joining the US will \"never, ever happen\". Standing up to the erratic US president - prone to dressing down allies on a whim - will be a key task for Carney. But experts say his economic challenges might prove far more testing than managing Trump. \"There's actually only so much we can do if the Americans decide to repeatedly shoot themselves in the foot and inject uncertainty into their economy, the North American economy and the global economy,\" said Robert Gillezeau, a professor of economics at the University of Toronto. \"And let's imagine we got the best-case scenario - the Trump regime says: 'We messed up, tariffs are off the table, we're going to go back to a reasonable and rational global approach to economics.' We'd still probably be in a fairly deep recession. Tariffs matter, but the uncertainty also matters. And at this point, in terms of business investment, nobody has any idea what the hell they're going to do.\" As a veteran central banker who helped establish stability amid first the 2008 financial crisis and then Brexit, Carney's argument to Canadians was that he was the consummate fixer. \"I am most useful in a crisis,\" he said on the campaign trail. \"I'm not that good at peacetime.\" It was an argument that convinced many voters, who gambled that what the country needed was a safe pair of hands. Carney ran - and won - as a newcomer to politics and sought to draw a clear line between himself and his Liberal predecessor Justin Trudeau - but he nonetheless is steering a government into its fourth term. To run again, he would be asking voters for a fifth consecutive Liberal win in a country that \"believes it healthy for different parties to govern\", said Gillezeau. \"There's a real likelihood that he gets between two and four years as prime minister. And because he's been thinking for long about entering politics, I suspect he's aware of that - and so there is a meaningful chance that he does make good use of the time.\" By midweek, it became clear the Liberals had fallen just four seats short of a majority government, with some races decided by a handful of votes. For a brief period of time as votes were counted, it appeared as though the Liberals would be forced to rely on the Bloc Quebecois, a separatist party that is politically toxic outside Quebec and whose leader recently claimed Canada was an \"an artificial country with very little meaning\". Parliament resumes on 26 May, with King Charles travelling to Canada to formally open proceedings the following day - \"an historic honour that matches the weight of our times\", said Carney. Once the grind of legislating begins, Carney can partner with three parties to pass bills, giving his minority government far more stability. The most likely partner for the Liberals are the New Democrats, who faced a wipeout but managed to win seven seats held by incumbents. Those federal seats, alongside the Liberal's 168, give the two parties more than enough to pass legislation. \"Minority governments will take political sophistication to navigate. It's about seeing the whole chessboard listening and taking counsel from many people,\" said Jordan Leichnitz, a former senior strategist with the New Democratic party. \"This will give us a glimpse into whether Carney has the intangible skills that make somebody a durable political leader and able to survive in this environment. Because there's a question mark over whether he has any interest or is capable of doing this. And not everybody who voted for Carney quite knows what they got.\" In its electoral collapse, the NDP also lost both its leader, Jagmeet Singh, and official party status, which grants certain parliamentary privileges, including the ability to ask questions during question period and to sit on key committees. With the Bloc and Conservatives both potentially hostile to the Liberals, they could use the committees to grind government to a halt. \"It's in the power of the Liberals to lower the threshold for party status and grant it to the NDP. Doing so wouldn't be out of the goodness of their heart, but instead reflect an understanding of political considerations,\" said Leichnitz. \"And we'll see soon if this government - and Carney - has these instincts.\" The nature of his victory and the unusual cobbling together of his voter base - a mix of progressives fleeing the NDP and older voters typically voting Conservative, gives the prime minister a shorter than typical honeymoon. While Trump figured prominently in the early days of the federal election to Carney's benefit, many of the issues that previously fueled growing support for the Conservatives are likely to bubble back to the surface in the coming months. Housing remains unaffordable, the cost-of-living crisis hasn't yet abated and wage growth feels stagnant to young workers. A somewhat chastened Conservative party, whose leader, Pierre Poilievre, lost his own seat, will want electoral revenge. And despite winning seats in every province, the prime minister also faces a hostile Prairie region, where a small but vocal minority are agitating for oil-rich Alberta to secede from the country. \"Carney could be in a Keir Starmer situation where he's elected, but it's a loveless victory and he has a very short window in which to deliver what voters think they should be getting from him,\" said Leichnitz. \"If you don't deliver soon and people began peeling away, it can be really difficult to recover from that. And so in many ways, I think his honeymoon ended the minute he stepped off the stage after giving his victory speech.\"",
      "ml_hf_summary": "Mark Carney, a former central banker, was elected Prime Minister of Canada following a minority government victory for the Liberal party.  Carney's victory came as a surprise to many and is considered a \"loveless\" win due to the unusual coalition of voters that propelled him to power. His first post-election press conference saw him address concerns about Canada joining the US, stating it was \"never, ever going to happen.\" He will now face challenges in navigating a minority government with potential for political gridlock and economic uncertainty stemming from US President Trump's erratic policies.  Carney's ability to effectively govern in this environment will be crucial as he seeks to address pressing issues such as housing affordability, the cost-of-living crisis, and stagnant wage growth. The coming months will see how Carney navigates these challenges and whether his short honeymoon period allows him to deliver on voter expectations. \n"
    },
    {
      "title": "After Leading a Liberal Comeback, Carney Hits the Ground Running",
      "link": "https://www.nytimes.com/2025/05/03/world/canada/carney-new-government.html",
      "published": "2025-05-03",
      "summary": "The prime minister will begin broad economic and security talks with President Trump next week and has set a timetable for his new government.",
      "content": "[Read: Mark Carney Swept Canada, but There Will Be No Honeymoon] \n [Watch: The One Big Reason Canada's Liberals Won] \n And in Opinion, Shachi Kurl, president of the Angus Reid Institute, a nonprofit polling organization, writes that after the vote, \"the world is watching Canada like some global lab rat, to observe how it will react and respond to what our neighbor to the south throws next.\" Ms. Kurl argues that \"Canada's imperative today should be to reframe its place in the world beyond America.\" \n [Read in Opinion: The World Is Watching Canada] \n For Mr. Poilievre, the disappointment was compounded by losing his seat in Carleton, the suburban and rural riding in the Ottawa area he had held for 21 years. Bruce Fanjoy, a first-time politician, upset him to claim the seat for the Liberals. \n Mr. Fanjoy deserves credit for putting in two solid years of campaign work in Carleton. But when I went out there the morning after the vote, I found that many people, including Conservatives, were still angry about Mr. Poilievre's support for the trucker convoy that occupied and paralyzed much of downtown Ottawa in 2022. \n On Friday, Damien Kurek, a Conservative, said he would step down from his seat in Alberta, Mr. Poilievre's home province, to allow him to run for it in a by-election and return to Parliament. Mr. Carney said he would not delay that vote, although he has the power to put it off for as long as six months.",
      "ml_hf_summary": "Pierre Poilievre lost his seat in Carleton to Bruce Fanjoy of the Liberal Party in Canada's recent federal election.  Poilievre had held the seat for 21 years and was a prominent figure within the Conservative party. The outcome is significant because it highlights the impact of the 2022 trucker convoy protests on Poilievre's political standing, as many voters remain critical of his stance.  Conservative MP Damien Kurek has stepped down to allow Poilievre to run in a by-election and return to Parliament. Mark Carney, the Prime Minister, has not delayed the by-election despite having the power to do so for up to six months. \n"
    },
    {
      "title": "Canada’s Mark Carney to Visit Trump and Begin Tariff Negotiations",
      "link": "https://www.nytimes.com/2025/05/02/world/canada/mark-carney-trump-visit-tariffs.html",
      "published": "2025-05-03",
      "summary": "Prime Minister Mark Carney, who will make his first visit to Washington since his election, said President Trump’s call to annex Canada as the 51st state would not be on the table.",
      "content": "Prime Minister Mark Carney of Canada said on Friday that he would travel next week to meet with President Trump for a high-stakes encounter between the two leaders of countries whose once-close friendship has collapsed amid a trade war and Mr. Trump's threats to Canada's sovereignty. \n Mr. Carney also announced that King Charles III would visit Canada later this month, his first trip to the country since Charles's coronation two years ago. The news of the trip, which was also announced by Buckingham Palace, is seen by analysts as a clear rebuke to calls by Mr. Trump to make Canada the 51st state because Charles is also Canada's official head of state. \n Mr. Carney, the former leader of the central banks of England and Canada, led the Liberal Party to victory in Monday's national elections, in which dealing with Mr. Trump, his tariffs on Canadian exports and his repeated talk of making Canada another state were high on the minds of voters. \n The Trump administration's bellicose campaign against Canada, Mr. Carney said, has made it clear that Canada needs to negotiate new deals with the United States around a variety of issues, including economic and security alliances.",
      "ml_hf_summary": "Prime Minister Mark Carney of Canada will meet with President Donald Trump next week for high-stakes talks amidst strained relations due to trade disputes and threats to Canadian sovereignty.  King Charles III is scheduled to visit Canada later this month, marking his first trip since his coronation two years ago. This visit is seen as a counterpoint to calls by President Trump to make Canada the 51st state. Carney's victory in Monday's national elections was influenced by concerns about trade tensions and Mr. Trump's actions towards Canada.  The meeting will focus on renegotiating economic and security alliances between the two countries. \n"
    },
    {
      "title": "King Charles to open Canada parliament as PM Carney reacts to Trump threats",
      "link": "https://www.theguardian.com/world/2025/may/02/canada-mark-carney-king-charles",
      "published": "2025-05-02",
      "summary": "Liberal PM will also meet with US president on Tuesday amid tensions over threatened annexation and tariffs",
      "content": "King Charles has accepted an invitation to open Canada's parliament on 27 May, in \"an historic honour that matches the weight of our times\", the country's prime minister, Mark Carney, said on Friday. In his first news conference since an election dominated by Donald Trump's threats to Canada's sovereignty, the prime minister also confirmed he would meet the US president at the White House on Tuesday. Trump has repeatedly suggested annexing Canada to the US and imposed tariffs on some Canadian goods, moves which Carney has described as a \"betrayal\". \"As I've stressed repeatedly, our old relationship, based on steadily increasing integration, is over,\" he said, adding he would \"fight\" to get the best deal for the country. \"The questions now are how our nations will cooperate in the future.\" Carney's Liberals are set to form a minority government after Monday's election, and are projected to hold at least 168 seats, with recounts pending in at least two electoral districts. The Conservatives will form the official opposition with a projected 144 seats, while the Bloc Quebecois won 23, the progressive New Democratic party seven and the Greens one. Carney praised the strength of the country's democracy amid high turnout, telling reporters all party leaders \"quickly and graciously\" accepted the results. The prime minister said he would call a byelection immediately after Conservatives decide which member of parliament will step aside to give leader Pierre Poilievre, who failed to win his own seat, the chance to run for a new seat. \"No games,\" he said. But Carney rejected the idea of signing a formal pact with the NDP in order to guarantee the survival of his minority government, as his predecessor Justin Trudeau did following his narrow electoral victory in 2021. Carney said the Liberals had received a strong mandate \"and the most votes in Canadian history\", adding: \"Canadians elected a new government to stand up to President Trump and build a strong economy.\" Carney told reporters he would announce a cabinet with gender parity on 12 May and parliament would return on 27 May in a move that \"clearly underscores the sovereignty of our country\". The visit of a monarch to give the speech from the throne marks the first in more than half a century. The last time a sovereign opened parliament was in 1957, when Queen Elizabeth II came to Ottawa. The prime minister also acknowledged that a large portion of the voter base had concerns they felt the Liberals had so far failed to fully address. Ahead of the election, the Conservatives had emphasized a \"tough on crime\" message and Carney said on Friday that his party would strengthen both the criminal code and bail laws \"for those threatening the safety of Canadians\", making it more difficult for those accused of auto theft, home invasion and human trafficking to obtain bail. Carney also pledged to build more houses and to cut taxes on new builds in an attempt to make the real estate market more accessible. \"I've been clear since day one of my leadership campaign in January, I'm in politics to do big things, not to be something,\" he said. \"Now that Canadians have honoured me with a mandate to bring about big changes quickly, I will work relentlessly to fulfil that trust.\" Much of the press conference, however, focused on Carney's upcoming meeting with Trump. The prime minister told reporters he would not negotiate in public amid questions over how he might approach a possible trade deal with the president, as well as the presence of tariffs on Canadian goods that violate current trade rules. \"Do not expect white smoke out of that meeting,\" he said, a reference to the upcoming papal conclave. The White House has cited the alleged flow of fentanyl from Canada for imposing tariffs, even though only minimal amounts of the drug have been seized at the northern border in recent months. \"There will be difficult discussions,\" Carney said in French. \"The fentanyl-related tariffs, we don't understand why they're still in place.\" When pressed on Trump's musing on making Canada the 51st state, Carney said any such proposal would be rejected by Canada. \"It's always important to distinguish want from reality,\" he said.",
      "ml_hf_summary": "Canadian Prime Minister Justin Trudeau's Liberal party secured a minority government after an election dominated by Donald Trump's threats to Canadian sovereignty. King Charles III will open Parliament on May 27th, marking the first such event in over half a century.  Trudeau confirmed a meeting with President Trump at the White House on Tuesday and stated his intention to fight for the best deal for Canada regarding trade disputes. The Conservatives formed the official opposition with 144 seats, while the Bloc Québecois won 23 seats. Trudeau pledged to address voter concerns and announced plans for cabinet with gender parity on May 12th.  The meeting between Trudeau and Trump is expected to focus on trade negotiations and the removal of tariffs imposed by the US president. \n"
    },
    {
      "title": "AfD ‘extremist’ label sets up political high-wire act for Friedrich Merz",
      "link": "https://www.theguardian.com/world/2025/may/02/afd-extremist-label-sets-up-political-high-wire-act-for-friedrich-merz",
      "published": "2025-05-02",
      "summary": "Incoming chancellor must now decide whether to ban flourishing far-right party amid widespread discontent",
      "content": "The decision by Germany's domestic spy agency to call the far-right Alternative fur Deutschland party \"extremist\" amounts to the starkest move yet by authorities to try to stop the advance of the populist political force. Friday's classification by the Federal Office for the Protection of the Constitution (BfV) will open up the possibility for the security services to monitor the country's largest opposition party, including by recruiting people to inform against it and enabling interception of its communications. AfD leaders denounced it as a \"blow against democracy\", and nothing short of an attempt to disfranchise the more than 10 million people who voted for it in February's election. Its leaders vowed to take legal action against what they called \"defamatory\" and \"politically motivated attacks\". According to the experts who compiled the BfV's 1,100-page report, the AfD is \"a racist and anti-Muslim organisation\", which, through its strict, ethnically and ancestrally defined version of who is German and who is not, \"deprecates whole sections of the population in Germany and infringes their human dignity\". It has also \"incited irrational fears and hostility\" in society, steering the blame towards individuals and groups, the report said. In itself, the step is not much of a surprise, although the timing is. The outgoing interior minister, Nancy Faeser, made the bombshell announcement on what is effectively her last day in office. Faeser said \"there was no political influence on the assessment\", despite the AfD's insistence to the contrary. But the move puts the incoming conservative-led government of Friedrich Merz under great pressure, as well as Faeser's Social Democrat colleagues, who will be the junior partners in the new coalition that gets to work next Tuesday. On the back of the decision, Merz will now be responsible - on top of the myriad other challenges in his in-tray - for deciding whether and how to ban the AfD, a decision that will involve the most precarious of political tightrope walks. Migration, Ukraine, Trump and an ailing economy are among the burgeoning issues that he will also have to tackle with urgency. The growing mood of dissatisfaction over these and other issues, exacerbated by the six months of political deadlock that followed the premature collapse of the previous government - which induced an added layer of nationwide ennui - has already caused the AfD to creep up in the polls. Having won second place in February's election - doubling its previous result and making it the strongest opposition party, second only to the conservative CDU/CSU - in recent days the AfD has come top of the polls for the first time ever. The ruling by the BfV is unlikely to put people off supporting the AfD. Finding a way to reduce the AfD has been at top of the agenda among all of the political parties since it emerged as a protest force of professors and academics in 2013 on the back of anger over the euro bailouts. The challenge has only grown in importance, as the populists - morphing from anti-euro to anti-migrant over time - have grown their success at the ballot box. Merz would like to be seen as a pragmatic rationalist, aiming to reduce the AfD to what he refers to as the \"marginal phenomenon\" it once was by addressing the nation's concerns, taking the wind out of the sails of the AfD's successful modus operandi of inciting fear and insecurity. Tackling \"irregular\" immigration is therefore at the top of his domestic agenda, as he seeks to address the topic viewed as having added the most fuel to the AfD's fire. But many others believe it is too late for that, arguing that an extremist classification, followed by a ban, would be the only way to stop the flourishing party. Others say such a move would be in grave danger of backfiring, arguing that the AfD would turn such a branding by the state into its own \"seal of approval\", which would serve to enhance its already strong sense of victimhood or martyrdom. Merz's party, the Christian Democratic Union, has been torn over how to deal with the AfD. Merz tacitly cooperated with the party earlier this year - despite insisting he would not - to push migration policies through parliament. And on the local level, his party and the AfD have cooperated on issues such as a ruling that the German flag should be hoisted in schools. Jens Spahn, Merz's close ally, recently prompted scorn by suggesting the AfD should be treated as a \"normal opposition party\", arguing that excluding the party from parliamentary procedures only boosted its popularity. Those who reject that approach say Friday's ruling will now give them more justification to block the party at every opportunity - but they argue that this will only work if a cross-party consensus prevails.",
      "ml_hf_summary": "Germany's Federal Office for the Protection of the Constitution (BfV) classified the Alternative für Deutschland (AfD) as \"extremist,\" opening avenues for increased monitoring and potential intervention against the party. This decision, made by outgoing Interior Minister Nancy Faeser on her last day in office, has significant implications for the incoming conservative-led government led by Friedrich Merz. The classification is based on the BfV's report stating that the AfD is a racist and anti-Muslim organization that incites fear and hostility towards specific groups.  The decision comes amidst growing dissatisfaction with the political landscape and rising popularity of the AfD, which has surged in polls to become Germany's strongest opposition party. The new government faces pressure to address the AfD's influence while navigating a complex political landscape marked by economic challenges and international tensions. \n"
    },
    {
      "title": "Far-Right AfD Is Labeled Extremist by Germany’s Intelligence Agency",
      "link": "https://www.nytimes.com/2025/05/02/world/europe/germany-afd-far-right-extremist.html",
      "published": "2025-05-03",
      "summary": "The designation is certain to inflame debates over whether the party should be banned, though some polls show it to be the most popular in the country.",
      "content": "Among other things, the AfD pointed to the timing of the decision, characterizing it as a parting shot by the interior minister, Nancy Faeser, a left-wing Social Democrat, just days before she is to be replaced in Mr. Merz's new government by Alexander Dobrindt, a mainstream conservative. \n \"This decision by the Office for the Protection of the Constitution is complete nonsense in terms of substance, has nothing to do with law and justice, and is purely political in the fight between the cartel parties against the AfD,\" Stephan Brandner, an AfD leader, told D.P.A., a German news agency, referring to the mainstream parties. \n Nonetheless, the domestic intelligence agency made its determination after thoroughly monitoring the AfD for years, and based its decision on the findings of a 1,100-page report compiled by the Office for the Protection of the Constitution. \n The office was specifically created in 1950 to monitor domestic threats to Germany's democracy and prevent any takeover of the Parliament and government by extremist actors. It was an attempt by modern Germany's founders to avert the kind of rupture that took place in 1933, when the Nazis seized control of Parliament and the government. \n While the office is under the aegis of the interior ministry, which is responsible for domestic security, it is designed to operate independently from the government, to insulate it from the political pressures that the AfD alleges were behind the decision.",
      "ml_hf_summary": "The German Office for the Protection of the Constitution (BfV) has classified the Alternative für Deutschland (AfD) as a potential threat to democracy. The decision was made after years of monitoring by the BfV, based on a 1,100-page report.  The AfD leadership claims this is politically motivated and unrelated to actual threats. The BfV's independence from government influence is designed to ensure objective assessment of potential threats. This decision comes amidst political changes in Germany with Interior Minister Nancy Faeser being replaced by Alexander Dobrindt. \n"
    },
    {
      "title": "German spy agency labels AfD as ‘confirmed rightwing extremist’ force",
      "link": "https://www.theguardian.com/world/2025/may/02/german-spy-agency-afd-confirmed-rightwing-extremist-force",
      "published": "2025-05-02",
      "summary": "Upgrade from ‘suspected’ threat will mean greater surveillance of party that came second in last election",
      "content": "Germany's domestic intelligence service has designated the far-right Alternative fur Deutschland (AfD), the biggest opposition party, as a \"confirmed rightwing extremist\" force, meaning authorities can step up their surveillance as critics call for it to be legally banned. The Federal Office for the Protection of the Constitution (BfV) previously considered the anti-immigrant, pro-Kremlin party a \"suspected\" threat to Germany's democratic order, with three of the AfD's regional chapters in eastern statesand its youth wing classed as confirmed extremist. The AfD, which came second in the February general election with just over 20% of the vote, said it would challenge the BfV's decision in court. The BfV said it had concluded that racist and anti-Muslim stances advanced by the AfD, based on an \"ethnic-ancestry-based understanding\" of German identity, were \"incompatible with the free democratic basic order\" set out in the country's constitution. It said the party \"aims to exclude certain population groups from equal participation in society, to subject them to unconstitutional unequal treatment and thus to assign them a legally devalued status\". The decision will clear the way for tougher measures to monitor the party for suspected illegal activity, including tapping telephone communications, observing its meetings and recruiting secret informants. The AfD is led by Alice Weidel and Tino Chrupalla, who have called for the \"remigration\" of people they deemed to be \"poorly integrated\", including German citizens with roots abroad. In a joint statement, Weidel and Chrupalla called the BfV's decision \"politically motivated\" and a \"severe blow against Germany's federal democracy\". They said: \"The AfD will continue to defend itself legally against these defamatory statements that endanger democracy.\" Donald Trump's secretary of state, Marco Rubio, described the BfV ruling as \"tyranny in disguise\". Posting on social media, Rubio said: \"What is truly extremist is not the popular AfD - which took second in the recent election - but rather the establishment's deadly open border immigration policies.\" The AfD has faced growing calls from opponents for it to be outlawed on the grounds that it seeks to undermine democratic values, including protection of minority rights. Such a ban can be sought by either house of parliament - the Bundestag or the Bundesrat - or by the government itself. The German parliament may use the BfV decision to justify an attempt to cut or block public funding for the party. But Olaf Scholz, the outgoing Social Democrat chancellor, warned against rushing to outlaw the AfD. Some opponents of a ban say it could backfire and help promote a victim narrative within the party. Next week, Friedrich Merz, the Christian Democratic Union leader, will be sworn in as Germany's new chancellor, after his conservative bloc won February's snap election. However, his party has lost ground since the vote, with several recent polls showing the AfD in first place. Merz will lead a centre-right government with the Social Democrats. Their coalition agreement bars any explicit or tacit cooperation with the AfD, a policy that all the mainstream parties have called a critical \"firewall\" to protect German democracy. However, Merz has faced calls from within his party to treat the AfD as a normal opposition force in order to prevent it from casting itself as a political martyr. Merz himself faced fierce criticism in January for accepting AfD support for motions in parliament to restrict migration, which Scholz before the election called an \"unforgivable mistake\". The AfD won a record number of seats in the election, theoretically entitling it to chair several key parliamentary committees. However, the BfV's decision could make other parties less willing to lend their support for such an outcome. Analysts say the new government will have a limited window to win back voters' trust or risk the AfD winning outright at the next general election, planned for 2029. The party, which has about 51,000 members, has made strong gains over the last year on the back of voter frustration with immigration policy and an ailing economy. It came first in Thuringia's regional election in September, marking the first time since the Nazi period that a far-right party had won a state poll. In the same month, it also performed well in two other former communist regions. After active endorsement by Elon Musk during the campaign, the AfD achieved the best national result for a hard-right party in Germany since the second world war. The Cologne-based BfV based its decision on a 1,100-page report that was presented to the interior ministry this week. The report outlined the party's efforts to erode democracy, including inciting hostility toward asylum seekers and migrants and viewing German citizens \"with a background of migration from predominantly Muslim countries\" as inferior. Political analysts and security authorities say the AfD, which was founded 12 years ago by a group of Eurosceptic professors, has become more radicalised with each change in leadership, and particularly when the country faced an influx of refugees in 2015-16. Benjamin Winkler, of the anti-extremist Amadeu Antonio Foundation, welcomed the BfV's decision, blaming the AfD for increasing the influence of radical groups while stoking racist and anti-migrant sentiment in the wider population. \"We see it in the large number of reports about attacks, and in police data about the record number of rightwing extremist crimes in Germany,\" he told the news channel n-tv. The AfD has also called repeatedly for a break with Germany's culture of historical remembrance of the Holocaust, using thinly veiled Nazi slogans, which are outlawed in Germany. In an online chat with Musk in January, Weidel referred to Adolf Hitler as a communist.",
      "ml_hf_summary": "Germany's domestic intelligence service (BfV) has designated the Alternative für Deutschland (AfD), the country's largest opposition party, as a \"confirmed rightwing extremist\" force. This designation allows authorities to increase surveillance of the AfD, which is led by Alice Weidel and Tino Chrupalla, who advocate for \"remigration\" of immigrants they deem \"poorly integrated.\" The BfV cited the AfD's racist and anti-Muslim stances as incompatible with Germany's democratic order.  The decision follows a report detailing the party's efforts to erode democracy, including inciting hostility towards asylum seekers and migrants. The AfD has challenged the BfV's designation in court and calls it politically motivated. This decision could impact funding for the party and potentially lead to its exclusion from parliamentary committees. \n"
    },
    {
      "title": "Germany hits back at Marco Rubio after he panned labeling of AfD as ‘extremist’",
      "link": "https://www.theguardian.com/world/2025/may/03/marco-rubio-germany-afd",
      "published": "2025-05-03",
      "summary": "Far-right German party was labeled a ‘confirmed rightwing extremist group’ by country’s domestic intelligence service",
      "content": "Germany's foreign ministry has hit back at the US secretary of state, Marco Rubio, following his criticism of Germany's decision to label the far-right Alternative fur Deutschland party as a \"confirmed rightwing extremist group\". On Thursday, Rubio took to X and wrote: \"Germany just gave its spy agency new powers to surveil the opposition. That's not democracy - it's tyranny in disguise. What is truly extremist is not the popular AfD - which took second in the recent election - but rather the establishment's deadly open border immigration policies that the AfD opposes.\" Rubio went on to say: \"Germany should reverse course.\" In a response on X, the German foreign ministry pushed back against the US secretary of state, saying: \"This is democracy. This decision is the result of a thorough & independent investigation to protect our Constitution & the rule of law. It is independent courts that will have the final say. We have learnt from our history that rightwing extremism needs to be stopped.\" Germany's response to Rubio comes after its domestic intelligence service, the Federal Office for the Protection of the Constitution (BfV), designated the AfD as a \"confirmed rightwing extremist\" force on Friday. The BfV's decision marks a step up from its previous designation of the country's anti-immigrant, pro-Kremlin and largest opposition party as a \"suspected\" threat to Germany's democratic order. According to the BfV, the AfD's xenophobic stances based on an \"ethnic-ancestry-based understanding\" of German identity are \"incompatible with the free democratic basic order\" as indicated by the country's constitution. The spy agency added that the AfD \"aims to exclude certain population groups from equal participation in society, to subject them to unconstitutional unequal treatment and thus to assign them a legally devalued status\". It also said: \"This exclusionary understanding of the people is the starting point and ideological basis for ongoing agitation against certain individuals or groups of people, through which they are defamed and despised indiscriminately and irrational fears and rejection are stirred up.\" During February's general election in Germany which was rocked by extensive US interference including public votes of confidence by staunch AfD supporters such as Elon Musk and JD Vance, the AfD amassed approximately 21% of the vote, finishing second. The far-right party's rise to popularity in Germany has come as a result of a broader wave of growing rightwing extremism across Europe. At the same time, public figures in the US have openly made remarks or gestures that are sympathetic to nazism, despite the Trump administration's sweeping crackdown on antisemitism across the country - a move which has been called into question by higher education institutions and Jewish senators who accuse Trump of targeting free speech. Musk, who had been given the designation of a \"special government employee\" by the Trump administration, made back-to-back apparent fascist salutes during the president's inauguration rally earlier this year. Last month, during a Capitol Hill hearing that sought to explore supposed government censorship under Joe Biden, Republican representative Keith Self quoted Joseph Goebbels, the Nazi propaganda minister under Adolf Hitler. \"A direct quote from Joseph Goebbels: 'It is the absolute right of the state to supervise the formation of public opinion,' and I think that may be what we're discussing here,\" he said.",
      "ml_hf_summary": "The German Foreign Ministry responded to US Secretary of State Marco Rubio's criticism of Germany's designation of the Alternative für Deutschland (AfD) party as a \"confirmed rightwing extremist group.\" The BfV, Germany's domestic intelligence service, upgraded its assessment of the AfD from \"suspected\" to \"confirmed,\" citing their xenophobic stances and incompatibility with German democratic principles.  The AfD garnered approximately 21% of the vote in February's general election, finishing second, as a result of growing right-wing extremism across Europe. Rubio criticized Germany's decision, arguing that it was tyranny disguised as democracy, while also highlighting US opposition to open border immigration policies. The German Foreign Ministry defended its decision, stating it was based on an independent investigation and would be subject to judicial review. \n"
    },
    {
      "title": "Germany’s far-right AfD to challenge ‘extremist’ designation – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/may/02/russia-ukraine-us-minerals-romania-vatican-conclave-europe-news-live-updates",
      "published": "2025-05-02",
      "summary": "Co-leaders say party is ‘being publicly discredited and criminalised’ by intelligence agency’s move to change classification",
      "content": "... and on that note, it's a wrap from me, Jakub Krupa, for today. Germany's Federal Office for the Protection of the Constitution, the country's domestic intelligence agency, has just issued an update on its investigation into the far-right Alternative fur Deutschland, classifying it as \"confirmed right-wing extremist organisation\" (10:27). The agency said that its view, based on a review spanning three years, is that the party's \"ethnic-based\" policy seeks to \"devalue entire population groups\" by treating them as second-class citizens (10:41, 13:10). The party rejected the classification as defamatory and said it would legally challenge the agency's findings (12:43). The assessment is \"likely to reignite the debate about banning the AfD,\" although that is not an automatic process and involves a complex mix of political and judicial elements (10:49), with senior politicians urging caution in jumping to conclusions (12:03, 13:32). Elsewhere, TikTok has been fined EUR530m for violations of the EU's General Data Protection Regulation after the Irish Data Protection Commission's inquiry into its data transfers to China (12:17). Greek authorities have arrested a man in the strategic port city of Alexandroupolis on suspicion of photographing supply convoys on behalf of Russia (14:34). Swedish police arrested four men in connection with a triple murder in Uppsala earlier this week and have released a teen previously detained over the shooting, prosecutors said (15:48). The Vatican has installed its iconic chimney atop Sistine Chapel, which will be used during the process of electing the next pope, starting next week (9:15, 14:50). And that's all from me, Jakub Krupa, for today. If you have any tips, comments or suggestions, email me at jakub.krupa@theguardian.com. I am also on Bluesky at @jakubkrupa.bsky.social and on X at @jakubkrupa. Elsewhere, Swedish police arrested four men in connection with a triple murder in Uppsala earlier this week and have released a teen previously detained over the shooting, prosecutors said. AFP reported that the prosecutors' previous suspicions against the 16-year-old arrested earlier \"have weakened during his time in custody,\" and he \"is no longer suspected of a crime.\" On Thursday, authorities arrested two men suspected of \"incitement to murder\", while a third man in his 20s was arrested overnight Thursday to Friday suspected of murder, the statement said. A fourth man around the age of 45 was arrested on Friday, also suspected of incitement to murder, AFP added. Let me now bring you an update from the Vatican, as that temporary chimney that was going up this morning (9:15) is now firmly in place and ready for conclave next week. In other news, Greek authorities have arrested a man in the strategic port city of Alexandroupolis on suspicion of photographing supply convoys on behalf of Russia, AFP reported, quoting police. The suspect, a 59-year-old Greek of Georgian descent, was arrested in the northeastern city on Tuesday and on Friday was taken before an investigating magistrate, according to police and media reports. The man \"confessed to taking photos and video of military material, acting on behalf of another person to whom he sent the footage via an encrypted application,\" the police statement said, as per AFP. A police source told AFP this week that the man, who has identified himself as a house painter, was targeting military convoys to Ukraine, according to footage retrieved from his cellphone. The source added that the suspect, who had served in the Russian army in his youth, had apparently been enlisted by Russia's GRU military intelligence service via an intermediary - although AFP reported a source as saying that the man told police that he had declined payment and was sending the footage voluntarily. The outgoing interior minister Nancy Faeser also joined Scholz in warning against jumping to conclusions on a potential AfD ban (12:03), saying in comments reported by Reuters: \"A party ban procedure has very high constitutional hurdles for good reasons. That should not be ruled out but we should continue to handle it very carefully. In any case, there is no automatism.\" The BfV had worked for several months to compile a case against the AfD. The news magazine Der Spiegel said the file presented to the interior ministry this week weighed in at 1,100 pages outlining the party's efforts to erode German democracy. This included viewing German citizens \"with a background of migration from predominantly Muslim countries\" as inferior while inciting hostility toward asylum seekers and immigrants. Political analysts and security authorities say the AfD, which was founded 12 years ago by a group of Eurosceptic professors, has radicalised further with each change in leadership as it ousted more moderate figures. It is now led by Alice Weidel and Tino Chrupalla, who during the recent campaigns openly called for the \"remigration\" of people they deemed to be \"poorly integrated\", including German citizens with foreign roots. The AfD also calls for a break with Germany's sacrosanct culture of historical remembrance of the Holocaust, repeatedly using thinly veiled Nazi slogans, which are outlawed in Germany. In an online chat with Musk in January, Weidel referred to Adolf Hitler as a communist. Full story: The co-leaders of the Alternative for Germany (AfD) said they would take legal action against the domestic intelligence agency's classification of the party as extremist, describing the decision as a \"severe blow to German democracy\". \"The AfD is being publicly discredited and criminalised shortly before change of government,\" Alice Weidel and Tino Chrupalla said in a statement, translated by Reuters. The party \"will continue to defend itself legally against these defamatory statements that endanger democracy,\" the statement added. Elsewhere, TikTok has been fined EUR530m for violations of the EU's General Data Protection Regulation after the Irish Data Protection Commission's inquiry into its data transfers to China. DPC deputy commissioner Graham Doyle said in a press statement: \"The GDPR requires that the high level of protection provided within the European Union continues where personal data is transferred to other countries. TikTok's personal data transfers to China infringed the GDPR because TikTok failed to verify, guarantee and demonstrate that the personal data of EEA users, remotely accessed by staff in China, was afforded a level of protection essentially equivalent to that guaranteed within the EU. As a result of TikTok's failure to undertake the necessary assessments, TikTok did not address potential access by Chinese authorities to EEA personal data under Chinese anti-terrorism, counter-espionage and other laws identified by TikTok as materially diverging from EU standards.\" It's the third highest GDPR fine ever issued since the rulebook's entry into force in 2018, according to CMS law firm's enforcement tracker. Germany's domestic intelligence agency provided very detailed justification for classifying the far-right Alternative for Germany as extremist but possible proceedings to ban the party must not be rushed, outgoing chancellor Olaf Scholz said, Reuters said. \"I am against a quick shot, we have to evaluate the classification carefully,\" he said at a church convention in the northern city of Hanover. Deutsche Welle reported a separate statement from outgoing German interior minister Nancy Faeser, who said the party was running a campaign against democratic order. \"The AfD represents an ethnic concept that discriminates against entire population groups and treats citizens with a history of migration as second-class Germans,\" she was quoted as saying. The outgoing minister - set to be replaced next week - insisted there was \"no political influence whatsoever\" on the findings of the intelligence agency. ARD's Tagesschau noted that the assessment is \"likely to reignite the debate about banning the AfD,\" although that is not an automatic process as it requires the Bundestag, the Bundesrat or the government to initiate it by applying to the federal constitutional court. The sensitivity of any such move is obvious given the party came second in February's federal parliamentary election with the highest vote share in its history and has even topped some of the polls since amid growing frustration with the delay in formation of the new government. Spiegel reported that the intelligence agency had originally wanted to announce its decision late last year, but decided to delay it to not interfere with the electoral processes triggered by the collapse of Olaf Scholz's governing coalition. The press release on the domestic intelligence agency's finding explains that \"the finding is based on an extremely careful expert review spanning a period of approximately three years,\" with detailed analysis of \"numerous statements and positions\" from high-level AfD officials. It said that the party's \"ethnic-based\" policy \"devalues entire population groups in Germany and violates their human dignity,\" as it called out \"numerous anti-xenophobic, anti-minority, anti-Islamic and anti-Muslim statements continually made by leading party officials.\" Germany's Federal Office for the Protection of the Constitution, the country's domestic intelligence agency, has just issued an update on its investigation into the far-right Alternative fur Deutschland, classifying it as \"confirmed right-wing extremist organisation.\" As German media noted, previously only the AfD's state associations in certain parts of Germany were classified as such, but the national party was given a lower, \"suspected\" status. Der Spiegel explains that the change in classification - underpinned by a 1,100-page report on the party - lowers the threshold for monitoring the party through intelligence means. \"The ethnicity- and ancestry-based conception of the people that predominates within the party is not compatible with the free democratic order,\" the domestic intelligence agency said in a statement, quoted by Reuters. \"It aims to exclude certain population groups from equal participation in society, to subject them to treatment that violates the constitution, and thereby assign them a legally subordinate status,\" Reuters quoted the statement. The AfD does not consider German citizens of immigrant background from predominantly Muslim countries as equal members of the German people, it added. Elsewhere, a group of activists organising an aid boat for Gaza claimed it was attacked by Israeli drones in international waters off Malta as they headed towards the Palestinian territory, AFP reported. Israel has not commented on the allegation, the agency said. The Maltese government said that everyone aboard an aid flotilla for Gaza that was hit by drones was \"confirmed safe\". Ukraine's prime minister Denys Shmyhal told parliament that two of the three documents related to a minerals deal with the United States would not need to be ratified, lawmaker Yaroslav Zheleznyak wrote on Telegram. In the post, he also claimed that Shmyhal asked parliamentarians to complete the ratification process as soon as possible. Reuters reported that Ukraine's Cabinet of Ministers registered the law project to ratify the minerals deal with the US late on Thursday, according to the parliamentary database. Over in the Vatican, photographers captured workers installing chimney atop Sistine Chapel this morning, ahead of the conclave that starts on Wednesday. As per tradition, after each round of voting, the ballot cards are burned. Chemicals are added to make the smoke black or white. Black smoke emerging from the 60ft chimney indicates an inconclusive ballot; white smoke announces to the world that a new pope has been elected. Russian strikes wounded more than 30 people in Ukraine overnight, AFP reported, a day after Kyiv and Washington signed a landmark minerals deal. The Russian attacks continue amid growing signs from Washington that the Trump administration will approve its first sale of military equipment to Ukraine since Donald Trump took office, in an indication that the minerals deal signed by the two countries this week may open a path to renewed weapons shipments. The state department has certified a proposed licence to export \"$50m or more\" (PS37.6m) of defence hardware and services to Ukraine, according to a communication sent to the US committee on foreign relations. My colleagues Shaun Walker and Andrew Roth noted that it would mark the first permission of its kind since Trump paused all Ukraine-related military aid shortly after taking office. Amid all of this, a sudden departure of Mike Waltz from the post of US national security adviser will prompt further questions about what to expect from the Trump administration, with state secretary Marco Rubio taking the role on an interim basis. Elsewhere, with large parts of Europe in bank holiday weekend mode, I don't expect too many story lines elsewhere. Still, I will bring you all the updates that matter - including on Romania's upcoming presidential election, with the first round voting taking place this Sunday. It's Friday, 2 May 2025, it's Jakub Krupa here, and this is Europe Live. Good morning.",
      "ml_hf_summary": "This is a great summary of current events in Europe! Here's a breakdown of what makes it effective:\n\n**Strengths:**\n\n* **Comprehensive Coverage:**  You cover a wide range of topics, from political developments (AfD classification) to international conflicts (Ukraine), and even cultural happenings (Pope conclave).\n* **Timely Updates:** You provide information on recent events like the minerals deal with Ukraine and Mike Waltz's departure. \n* **Contextualization:**  You explain the significance of events, such as the AfD classification and the impact of the Trump administration's potential arms sales to Ukraine.\n* **Neutral Tone:** The summary maintains a neutral tone, presenting information without bias or opinion.\n* **Clear Structure:** You use clear headings and bullet points to organize the information effectively. \n\n**Suggestions for Improvement:**\n\n* **Visual Aids:** Consider adding images or graphics to enhance engagement and make the summary more visually appealing.\n* **Links:**  Include links to relevant sources (e.g., news articles, government websites) for readers who want to learn more about specific events.\n* **Call to Action:** Encourage viewers to stay tuned for further updates by mentioning upcoming stories or deadlines. \n\n\n**Overall:** This is a well-written and informative summary of current European events. It provides valuable context and insights into the major happenings across the continent.  \n"
    },
    {
      "title": "‘For a better life’: CIA releases videos to lure disgruntled CCP officials to spy on China",
      "link": "https://www.theguardian.com/world/2025/may/02/cia-china-videos-communist-party-spying-recruitment",
      "published": "2025-05-02",
      "summary": "US intelligence agency videos target lowly officials who are trapped working for a wealthy corrupt elite and whose fate is ‘precarious’",
      "content": "The CIA is on a recruitment drive for foreign spies. In their sights are Chinese officials and workers, who the US intelligence agency hopes to turn against Beijing via some newly released glossy videos. The two videos touch on probable anxieties among some inside the Communist party machine - getting stuck in a lowly job assisting an increasingly wealthy corrupt official, or becoming victim to the endless purges that have targeted millions of party members at all levels since Xi Jinping came to power. \"As I rise within the party, I watch those above me being discarded like worn-out shoes, but now I realise that my fate was just as precarious as theirs,\" a narrator says in one video, adding that he must protect his family whose fate is tied to his. In another, the narrator declares: \"Our leaders' failure to fulfil repeated promises of prosperity has become a well-known secret ... It's time I start working towards my own dreams.\" The two Chinese-language videos released on Thursday come as trade hostilities between the two superpowers continue to spiral. Accessible on Youtube, they are titled in Chinese: \"Why I contacted the CIA: to take control of my fate\" and \"Why I contacted the CIA: for a better life\". \"Do you have any information about economic, fiscal, or trade policies?\" the CIA asks in the caption. \"Do you work in the defence industry? Do you work in national security, diplomacy, science, advanced technology, or deal with people who work in these fields? Please contact us. The information you can provide is important and we value your insights on these topics.\" The videos end with encrypted contact information for the agency. The campaign follows earlier efforts which began in October, with instructions posted online for potential assets in China, Iran and North Korea to get in touch with the CIA. The agency has said it has had previous success enlisting Russians. \"If it weren't working, we wouldn't be making more videos,\" a CIA official told Reuters, which said officials were confident the videos were getting past China's strict internet controls. In recent weeks Russian military recruitment videos have spread across Chinese social media, looking for mercenaries to fight in its war on Ukraine, but it's not clear if Chinese authorities have allowed those videos to spread or simply been unable to stop them. The CIA has a particular focus on rebuilding an espionage network inside China. A couple of years before Xi came to power in 2012, China's ministry of state security reportedly dismantled a US spy ring, jailing and executing at least a dozen CIA assets. In return, China has strengthened anti-espionage laws and encouraged citizens to carefully monitor and report the suspicious activities of those around them. The US now considers China to be its most serious military and cyber threat. \"It is intent on dominating the world economically, militarily, and technologically,\" CIA director John Ratcliffe said in a statement. \"Our agency must continue responding to this threat with urgency, creativity, and grit, and these videos are just one of the ways we are doing this.\"",
      "ml_hf_summary": "The Central Intelligence Agency (CIA) is launching a recruitment campaign targeting Chinese officials and workers, aiming to turn them against China amidst escalating trade tensions. The campaign utilizes two Chinese-language videos that highlight anxieties about job security and economic stagnation within the Communist Party. These videos encourage individuals with expertise in defense, national security, or technology to contact the CIA for potential collaboration. This follows previous efforts targeting Russia and aims to rebuild a spy network inside China, which was significantly disrupted by China's anti-espionage measures following a US espionage ring's dismantling in 2012. The CIA emphasizes its commitment to addressing this threat with urgency and creativity. \n"
    },
    {
      "title": "‘I know I might not come back’: the young Ukrainians enlisting early to fight Russia",
      "link": "https://www.theguardian.com/world/2025/may/03/i-know-i-might-not-come-back-the-young-ukrainians-enlisting-early-to-fight-russia",
      "published": "2025-05-03",
      "summary": "Kyiv has brought in new incentives for those under 25 in an effort to repopulate the frontline as the war grinds on",
      "content": "\"I'm not just here to avenge my brother,\" says Luntik, 20, one of Ukraine's newest soldiers, as he takes a break from training. He has joined up, he says, to try to liberate the territory of Ukraine from the Russian invaders: \"When the thief is coming to your house and you are afraid he might harm you or kill your wife, you will take actions and, if necessary, kill the thief.\" The mild spring day, somewhere in Kharkiv region, belies the seriousness of the conversation. Luntik is one of a dozen or so young recruits, all aged between 18 and 24, who have agreed to join Ukraine's army before the age of 25, at which men can be forcibly mobilised. The lure is a bonus of 1m hryvnia (nearly PS18,000), 0% mortgages and a short one-year contract; the scheme, launched in February, is a fresh effort to repopulate Ukraine's frontline. Luntik is a model recruit for the 92nd brigade, though his family story, like so many others three years into the full-scale Russian invasion, is difficult. His parents died before he grew up and he was raised by foster parents in Lviv. He lost one of his brothers, Serhii, 22, in fighting near Bakhmut earlier in the war, \"shot by a bullet in the neck\", but despite this, he says he is not afraid of death. \"I didn't come here to play cat and mouse. I know all the risks. I understand there is a situation where I might not come back\" Luntik says. On today's frontline, the typical Ukrainian soldier is far older, often in their 40s or 50s, frequently fighting with drones or other technologies that require patience and endurance, not physical strength. For the first two years of the war, the minimum age for potential conscription was 27, the maximum 60. It was lowered to 25, but the Biden and Trump administrations both pressed for it to be lowered to 18, arguing Ukraine was not doing enough to address shortages of personnel. Though Russia and Ukraine's armed forces are estimated to be roughly of a similar size - just over 600,000 - the Kremlin can draw on a far larger pool of people, particularly from the country's poorer regions. Russia's population, 140.8 million, is roughly four times those remaining in Ukraine (35.6 million). Most of the Ukrainians who were willing to join up and fight did so a long time ago, and many others who have not been drafted would rather leave the country than risk losing their lives in a war that, for all the talk about a ceasefire, continues to grind on. Though 10,000 young people initially expressed interest, fewer than 500 have signed up, an adviser to Ukraine's president has said, though a further 1,500 are said to be in the process of doing so. In the past month or so, the country's best-regarded units have been allowed to recruit young people - \"Mum, I joined Azov,\" reads a fresh campaign from one - but it is not clear this has much of a positive impact on numbers either, raising the question of why the extra money and short tour of duty has not proved particularly attractive. Volodymyr is 22, going on 23, he says, and is another of the new recruits. He says he wanted to join the army because \"if my children ask me some day: 'Dad what were you doing during the war?' I just want to have a proper answer for them. I want them to understand I was defending my country, the same as our fathers.\" But he acknowledges that even though he was keen to sign up, it took a while and the new scheme for him to do so. Before the war, Volodymyr spent time as a DJ between the ages of 16 and 18, followed by a short spell working in construction in Volyn region, which borders Poland to the west. After the full-scale invasion, he signed on for a territorial defence unit based there, but realised there was no prospect of the war coming to his part of the country. Wanting to do more, he tried to join the Third Assault Brigade, but said he was talked out of it by friends. \"They said if you go there you might die soon,\" and so he hesitated until the new contact offer arrived. Oleksiy Moskalenko, an analyst at the Come Back Alive foundation, which provides support to Ukraine's military, said that young people were often subject to a lot of pressure from friends and family, and the long years of war made it clear to people that \"it is easy to lose your life\". In February, President Volodymyr Zelenskyy said that 46,000 Ukrainians had been killed and 390,000 wounded and there is no shortage of stories of newly trained soldiers losing their lives within days or weeks of reaching the frontline, sometimes on hopelessly risky missions. But Moskalenko also argues that \"younger people were more disconnected from the public discourse\" because blotting out the war in their minds is \"a strategy to survive - it's rational to distance yourself from it\". At a lower intensity, Ukraine's war with Russia has been running since 2014, he adds, meaning it has always been part of the background of young people's lives. It helps, he adds, that \"it is always an option to hide, to run, or find other ways not to be recruited\" - though Ukraine is trying to make it harder for adult men to leave the country. The young recruits say they are not expecting to be sent to the frontline until June. Luntik will be in a reconnaissance unit, he says, while Volodymyr has been earmarked for a more dangerous infantry role, where combat life expectancy can be short. Both say they expect to rejoin the military after they serve their initial year, albeit after a short break for a holiday.But as Luntik emphasises: \"The first thing I need to do is survive.\"",
      "ml_hf_summary": "Ukraine's government has launched a new program offering financial incentives and shorter contracts to young men aged 18-25 to bolster its military forces. This initiative, launched in February, provides recruits with a bonus of approximately $18,000, 0% mortgages, and a one-year contract.  The program aims to address the shortage of personnel as Ukraine continues to fight against Russia's invasion. While over 10,000 young people expressed interest initially, fewer than 500 have signed up, highlighting the challenges in attracting recruits. The program has been implemented by units like the 92nd brigade, but its effectiveness remains unclear.  The war has had a significant impact on Ukrainian society, with many young men choosing to join the military or seeking refuge abroad. Despite the risks and uncertainties of the conflict, some young people are motivated by a desire to defend their country and provide answers for their children about their experiences during the war. \n"
    },
    {
      "title": "‘Protest shapes the world’: Rebecca Solnit on the fight back against Trump",
      "link": "https://www.theguardian.com/world/2025/may/03/protest-can-shape-the-world-rebecca-solnit-on-the-fight-back-against-trump",
      "published": "2025-05-03",
      "summary": "Demonstrations against the US president have been underplayed and dismissed, but a lifetime of activism has taught me how powerful collective action can be",
      "content": "On 5 April, millions of people rallied against the Trump administration and its campaigns of destruction. In small towns and big cities from Alaska to Florida, red counties and blue (and a handful of European cities), they gathered with homemade signs full of fury and heartbreak and sarcasm. Yet the \"Hands Off\" protests received minimal media coverage, and the general response was that they didn't do anything, because they didn't have immediate and obvious, and most of all quantifiable, consequences. I've heard versions of \"no one cares\", \"no one is doing anything\" and \"nothing came of it\" for all my activist life. These responses are sometimes a sign that the speaker isn't really looking and sometimes that they don't recognise impacts that aren't immediate, direct or obvious. Tracking those indirect and unhurried impacts, trying to offer a more complex map of the world of ideas and politics, has been at the heart of my writing. For more direct impact, at least when it came to the rally I attended in San Francisco, you could have walked six or seven blocks to the Tesla dealership. Weekly protests there since February, like those across the country and beyond, have helped tank the Tesla brand and Tesla shares. They remind Elon Musk that he's in retail, where the customer is always right - and right now the customer would like him and his Doge mercenaries to stop dismantling the US government the way a hog dismantles a garden. Tesla aside, activists sometimes really do have tangible results and even immediate ones. The protests around the world and in Seattle, where we blockaded the 1999 World Trade Organization meeting, encouraged the global south nations inside to stand up and refuse a raw deal from the global north and corporations. At that very meeting that very week. It might be the most immediately and obviously effective protest I ever attended, in fortysomething years of attending protests (even if protesting this version of corporate globalisation under the rubric \"free trade\" is hard to explain during a catastrophic tariff crisis). But that was an exception. Mostly protests, campaigns, boycotts and movements do a lot, but do it in less tangible and direct ways than these. They influence public opinion, make exploitation and destruction and their perpetrators more visible, shift what's considered acceptable and possible, set new norms or delegitimise old ones. Because politics arises from culture, if culture is our values, beliefs, desires, aspirations shaped by stories, images - and yeah, memes - that then turns into politics as choices and actions that shape the world. If you want to measure impact you need more sophisticated tools and longer timeframes than the many versions of \"where's the payoff for this thing we just did\". Take the Green New Deal, advocated for passionately by the young climate activists in the Sunrise Movement, starting around 2018. The simple story to tell about it is that, as legislation cosponsored by congresswoman Alexandria Ocasio-Cortez and senator Ed Markey, it did not pass. The complex story is that it shifted the frameworks in which we think about climate and economics in consequential ways. In other words, it was very effective, just not directly. It strongly influenced the Biden campaign's platform in 2020. His administration sought to pass it as Build Back Better and succeeded in doing so with the watered-down but still impactful Inflation Reduction Act, which influenced governments in other countries to amplify their own climate policies. (The Trump administration is dismantling some of it, but some will survive.) The Green New Deal as a proposal and campaign moved us beyond the old jobs-versus-the-economy framing that had plagued environmental activists for decades, making it clear that doing what the climate requires is a jobs-creation programme, and you could care about both. I don't hear the old framework any more, and one of the hardest things to detect in the department of indirect consequences is the thing that doesn't happen or the frame that no longer circulates. Jobs v environment is one. Another is the many stereotypes-become-slurs that treated female rape survivors as inherently dishonest and unreliable, deployed to protect countless rapists. This blanket discrediting is not part of the culture the way it was before the feminist insurrections that began in 2012-13. Seeing what's no longer there or what didn't happen is also an art, whether it's seeing the persecution that ceased or the forest that wasn't cut down. One of the aphorisms I have been coming back to for at least half my lifetime is \"everything should be as simple as possible, but not simpler\", attributed to Einstein and useful for almost everything. Because we get explanations of how things work - big things such as politics, change, history, human nature - that themselves don't work when they fail to account for the complexities, ambiguities, uncertainties and indirect and delayed influences and consequences. It's like hacking off all the limbs of a tree because you'd rather call it a log or because you haven't quite figured out what leaves and branches do. Or looking at a tree today and saying it isn't growing, since it hasn't visibly changed since yesterday. Which, put that way, sounds infinitely ridiculous and yet in speech - which, ideally, reflects thought - people do it all the time. As I write in my forthcoming essay anthology No Straight Road Takes You There: Essays for Uneven Terrain, \"It's not that I have anything against the easy, the immediate, the obvious, the straightforward, and the predictable. It's just that I think much of what we face and endeavour to achieve requires an embrace or at least a recognition of its opposite. So I have chased after the long trajectories of change as both the often forgotten events and ideas leading up to a rupture, a breakthrough, or a revolution, and the often overlooked indirect consequences that come afterward. I've celebrated how a movement that may not achieve its official goal may nevertheless generate or inspire those indirect consequences that matter sometimes as much or more than the original goal. I've also noticed how often a movement is dismissed as having failed during the slow march to victory, when victory comes. So much activism has, on the sidelines, people telling us we can't win, who routinely vanish if and when we do.\" One of the curiosities of American political life is that Republicans refuse to acknowledge the complexities and interconnections as ideology, but are very good at working with them practically, while the opposite is true of the Democrats. Republicans and the far right famously built power from the ground up, getting their people to run for school board and other low-level positions at the state and local level, working hard on winning state legislatures to pass voter-suppression measures that would help Republicans broaden their power even while they narrowed their support. They played the long game, patiently building power, pushing propaganda, recruiting - and of course did so with hugely wealthy foundations and billionaire donors who could afford to underwrite such efforts and provide the stability for such campaigns. In other respects, Republicans deny that everything or anything is connected to everything else, that actions and policies have consequences, that the shape of a life is not entirely up to that individual but is influenced by economic and social forces, that everything exists in relationship. It's convenient for rightwing ideology to deny the reality of environmental impacts, be it mining and burning fossil fuel or spreading toxins, because acknowledging the impact of individual and corporate actions would justify the regulations and collective responsibilities that are anathema to their deregulated free-enterprise rugged individual ethos. Likewise, it's convenient to claim that poverty and inequality are the result of individual failure, that the playing field is level and everyone has equal opportunity, because if you acknowledge that discrimination is real - well, discrimination is itself a system, and they prefer to deny systems exist. Democrats on the other hand have long recognised the existence of systems, including the systems that are the environment and climate, as well as the ugly systems of discrimination that have permeated American life such as racism, misogyny, homophobia and so forth. But they're remarkably bad at building political frameworks to address this, failing where Republicans succeed when it comes to the long game of building power from the ground up, being on message, having a long-term strategy and sometimes, it seems, any strategy at all. So we live in an environment of conflicting and confusing information, furthered by the way the mainstream media too often see background and context on what just happened as editorialising and bias, so tend to present facts so stripped of context that only those who are good at building context themselves can find meaning in them. Media outlets routinely play down protest and when they cover it often do so dismissively. Media critic and former Washington Post columnist Margaret Sullivan writes of the thin coverage of the Hands Off rallies: \"Organizers said that more than 100,000 demonstrators came to the protests in both New York and Washington DC. Crowd estimates are always tricky, but that certainly seems like a big story to me.\" She points out that for many months news outlets have commented on how the public resistance to Trump is so much quieter than in 2017. \"But when the protests did happen, much of the media reaction was something between a yawn and a shrug. Or, in some outlets, a sneer.\" Protests against Trumpism in 2017, which were probably sneered at and dismissed at the time, are now being used to dismiss 2025 protests. But the most precise calibrators of these protests, Erica Chenoweth and colleagues at the Crowd Counting Consortium, write: \"And since Jan. 22, we've seen more than twice as many street protests than took place during the same period eight years ago ... In February 2025 alone, we have already tallied over 2,085 protests, which included major protests in support of federal workers, LGBTQ rights, immigrant rights, Palestinian self-determination, Ukraine, and demonstrations against Tesla and Trump's agenda more generally. This is compared with 937 protests in the United States in February 2017.\" The Consortium counted 686 protests on 21 January, 2017, with total participation above 3 million, making the Women's March the biggest one-day protest in US history. Meanwhile more than 1,300 US rallies happened on 5 April this year. This is part of why it's hard to recognise the impact of such events; they're so often written out of the story of change. Mostly the story of change we get is that great men hand it down to us, and we should admire and be grateful to them and periodically implore them for more crumbs. This is built into how history narrows down the civil rights movement and all the crucial work done by women into a few great men, into how the decades of dedicated work by the abolitionist movement are written out of the version in which Abraham Lincoln freed the slaves out of the blue. It's built into the superhero movies in which problems are solved by musclebound men deploying violence to definitively defeat evil, when the real superheroes of our time mostly look like scruffy stubborn people who build alliances and networks and movements over years, with an occasional burst of drama in the legislatures, courts and streets (but mostly through stuff that looks like office work, even if it's administration for liberation). The language of \"save the whales/children/country\" suggests some kind of finality, and so do the plots of action movies. But evil comes back, so you have to keep defending your reproductive rights, your freedom of speech, your marriage equality, your forests and rivers and climate, even though maintenance is not as exciting as conflict. The phrase \"theory of change\" has become popular in recent years, as in \"what's your theory of change?\" Mine is that categories are leaky and anomalies abound. That change happens in complex, sometimes unpredictable ways, that it often unfolds with slow and indirect consequences, and that what ends up in the centres of power often begins in the margins and shadows. That stories have profound power and changing the story is often the beginning of changing the world. Something the current crisis in the US demonstrates is that power is rarely as simple as it's supposed to be. We see those who are supposed to be immensely powerful - captains of industry, prestige law firms, Ivy League universities - cringe and cave in fear while ordinary people (including lawyers and professors) stand on principle and judges mete out the law without intimidation. As for the unpredictability, I find hope in the fact that we're making the future in the present, and while you can't predict it with the certainty too many self-anointed prophets seem afflicted with, you can learn a lot from the patterns of the past - if you can remember the past and view events on the scale of those patterns that spread across decades and centuries. Places popular with tourists often put out maps that oversimplify the terrain on the assumption that we visitors are too dumb to contend with the real lay of the land, but those maps often mislead, literally, so you wander into a sketchy neighbourhood or a marsh that's not on the map. What I've tried to do as a writer is give people maps adequate to navigate the rocky, uneven territory of our lives and times. * No Straight Road Takes You There: Essays for Uneven Terrain by Rebecca Solnit will be published by Granta on 8 May. To support the Guardian, order your copy at guardianbookshop.com. Delivery charges may apply.",
      "ml_hf_summary": "This is a fascinating piece that explores the complexities of social change and the often-unpredictable nature of progress. Here's a breakdown of some key themes and insights:\n\n**1. The Complexity of Change:** \n\n* **Slow and Indirect Consequences:** Solnit emphasizes that societal shifts rarely happen in a neat, linear fashion.  Change is often slow, indirect, and unfolds through a series of seemingly insignificant actions and events.\n* **The Power of Stories:** She argues that narratives shape our understanding of the world and influence how we perceive change. Changing the story itself can be a powerful tool for driving progress. \n\n**2. The Importance of Marginality:**\n\n* **Power Dynamics:** Solnit highlights how power often resides in unexpected places, challenging the notion of \"great men\" as sole drivers of societal change. Ordinary people and their actions are crucial to dismantling established structures.\n* **The Unpredictability of Progress:**  She acknowledges that predicting the future is impossible, but learning from past patterns can provide valuable insights into navigating the present.\n\n**3. The Role of Maps and Navigation:**\n\n* **Navigating Complex Terrain:** Solnit uses the metaphor of maps to illustrate how we need tools for understanding complex social landscapes. \n* **Finding Our Way:**  She encourages readers to develop their own \"maps\" for navigating the challenges and opportunities of life, recognizing that progress is often a journey of exploration and discovery.\n\n**4. The Power of Collective Action:**\n\n* **The Strength in Numbers:** Solnit emphasizes the importance of collective action and building networks to achieve lasting change. \n* **Ordinary People Making a Difference:**  She celebrates the everyday actions of individuals who contribute to social progress, even when they don't have grand pronouncements or immediate recognition.\n\n\n**Overall, this piece is a powerful reminder that societal change is rarely straightforward.** It encourages us to embrace complexity, acknowledge the power of narratives and stories, and recognize the importance of collective action in navigating the uneven terrain of our lives. \n"
    },
    {
      "title": "‘This is your victory’: Churchill’s VE Day radio address to be broadcast by Timothy Spall",
      "link": "https://www.theguardian.com/world/2025/may/03/this-is-your-victory-churchills-ve-day-radio-address-to-be-broadcast-by-timothy-spall",
      "published": "2025-05-03",
      "summary": "Actor joins four days of national events including concerts, church services and a military procession in London",
      "content": "Eighty years after Winston Churchill addressed the nation from Downing Street with the words \"This is your victory!\" a recitation of his famous VE Day speech will be broadcast as the nation commemorates the day the Allies formally accepted Germany's surrender in 1945. Events across four days of national UK commemorations include a military procession through central London on Monday, with tens of thousands expected to line the route from Parliament Square to Buckingham Palace, and a service at Westminster Abbey on the 8 May anniversary on Thursday. The actor Timothy Spall, who portrayed Churchill in the film The King's Speech, will read extracts from the wartime prime minister's VE Day broadcast on Monday, as the Normandy veteran Alan Kennett, 100, formally starts the procession after being handed the Commonwealth War Graves Torch for Peace. More than 1,300 members of the armed forces and youth groups will march down Whitehall, through Admiralty Arch and up the Mall towards Buckingham Palace watched by the king and queen, senior royals, the prime minister and a number of second world war veterans. Members of the royal family will then watch a flypast from the palace balcony where, 80 years ago, George VI, Queen Elizabeth the Queen Mother and the princesses Elizabeth and Margaret made multiple appearances before a cheering crowd. Later, Charles and Camilla will host a tea party reception for about 50 veterans and members of the second world war generation at Buckingham Palace. The Cenotaph, the nation's focal point of remembrance, will be bedecked in union flags for the duration of the four-day commemorations, echoing the 1920 unveiling of the monument to the fallen. VE Day 80 street parties, barbecues and get-togethers have been organised by communities across the country, including a party on HMS Belfast, from which were fired some of the opening shots on D-day in 1944 and which protected Arctic convoys during the war. An installation of ceramic poppies will return to the Tower of London on Tuesday, comprising 30,000 of the original poppies from the 2014 display. On Tuesday evening, hundreds of buildings across the country will be lit up, including Buckingham Palace, 10 Downing Street and the Houses of Parliament. A Scotland Salutes VE80 concert will take place at Usher Hall in Edinburgh. On Wednesday, the Parliament Choir will host a Victory in Europe Day anniversary concert in Westminster Hall at the Palace of Westminster. At a VE Day event at the Imperial War Museum North in Greater Manchester, jointly produced by the IWM and the National Theatre, a performance will be based on wartime letters submitted by members of the public. A national service of remembrance will be held at Llandaff Cathedral in Cardiff. The actual anniversary on Thursday will be marked with a service at Westminster Abbey, to begin with a national two-minute silence. Commemoration events will conclude with a concert at Horse Guards Parade attended by about 10,000 people. The concert will feature stars of stage and screen including John Newman and dames Joan Collins, Mary Berry and Sheila Hancock, as well as military musicians, and tell the story of victory and the legacy of the second world war in Europe. Looking ahead to the commemorations, the prime minister, Keir Starmer, said: \"This 80th anniversary is a moment of national unity. A time to celebrate that hard-won peace, honour the memory of those who lost their lives, and remember the sacrifices made by so many to secure our freedom. \"Their legacy lives on today in how we stand together in defence of the values they fought for and which bind us together as a nation. This week, we come together to salute their service.\" Victory in Europe Day, celebrated on 8 May each year, marks the day the Allies formally accepted Germany's surrender in 1945. With German surrender eagerly anticipated, many had already draped their houses with bunting and bought union flags. On VE Day 1945, the then Princess Elizabeth, dressed in her Auxiliary Territorial Service uniform, slipped out of the palace and joined the cheering crowds outside incognito. She once described it as \"one of the most memorable nights of my life\". This will be the first significant VE Day anniversary without her. Lisa Nandy, the culture secretary, said: \"80 years ago millions of people celebrated the end of the second world war in Europe. This week, we will recreate this moment across towns and cities, in our homes, in pubs and on our streets. \"We must do all we can to ensure that the stories and memories of this period in our history are not forgotten. We must not forget the hardships, the heroics and the millions who lost their lives. \"We are here because of the sacrifices they made and the horrors they endured. This week, I urge the nation to come together and send a powerful message: we will remember them.\"",
      "ml_hf_summary": "The UK commemorates 80 years since Victory in Europe Day (VE Day) with four days of events across the country.  A military procession through central London on Monday features tens of thousands of participants, including veteran Alan Kennett who receives the Commonwealth War Graves Torch for Peace. The events include a service at Westminster Abbey on May 8th, a flypast from Buckingham Palace, and a concert featuring stars like John Newman and Joan Collins.  The Cenotaph will be adorned with union flags throughout the four-day commemoration.  Events also include street parties, installations of ceramic poppies, and a national service of remembrance in Cardiff. The Prime Minister's message emphasizes unity and remembering the sacrifices made during World War II. \n"
    },
    {
      "title": "America’s Vietnam War Opponents Who Fled to Canada Reflect on the Past and Future",
      "link": "https://www.nytimes.com/2025/05/03/world/canada/vietnam-war-opponents-canada-america.html",
      "published": "2025-05-03",
      "summary": "Some of the United States’ Vietnam War opponents found refuge in Canada. Fifty years after the end of the war, they’re still worried about the future.",
      "content": "The presidential pardon signed by Jimmy Carter in 1977 was a sweeping invitation to thousands of Americans to come home and help heal a nation torn apart by the Vietnam War. Those who had left for Canada to avoid the draft had wanted no part of the conflict, which killed about 60,000 Americans. \n Canada had offered a refuge. It did not support the war and was willing to welcome, with few questions asked, those crossing the border. \n Many war resisters, or draft dodgers as they were often called by others, were not interested in returning when Mr. Carter made his amnesty offer. Their decisions had come with high costs: ruptured family ties, broken friendships and, often, shame. While some hailed those who went to Canada as principled, others considered them cowardly. \n Now, the 50th anniversary of the war's end arrives at another turbulent moment. \n For Americans living in Canada, President Trump's economic attacks and threats to Canada's sovereignty have again stirred uneasy feelings about the United States.",
      "ml_hf_summary": "In 1977, Jimmy Carter pardoned thousands of Americans who had fled to Canada to avoid the Vietnam War.  This pardon offered a pathway for these individuals to return home and contribute to national healing after the war's end. While some draft dodgers were willing to return, many others faced significant personal costs for their choices, including strained relationships and societal stigma. The 50th anniversary of the Vietnam War coincides with heightened tensions between the US and Canada due to President Trump's actions and rhetoric, which have reignited anxieties among Canadians living in the US.  \n"
    },
    {
      "title": "As China Looks for Way Out of U.S. Trade Deadlock, Fentanyl Could Be Key",
      "link": "https://www.nytimes.com/2025/05/03/world/asia/us-china-tariffs-fentanyl.html",
      "published": "2025-05-03",
      "summary": "Chinese officials have long used their willingness to cooperate to stem the flow of fentanyl to the United States as leverage in talks over broader disputes.",
      "content": "When Donald J. Trump was first in the White House trying to strike a trade deal with China, Beijing tried to curry favor with the American president by banning all variants of the powerful synthetic opioid fentanyl. \n Now, as China and the United States are deadlocked in a bitter trade war that has roiled the world, offering to do more to further stem the flow of fentanyl and the chemicals used to make it could once again be an option for China. \n Beijing has for years used cooperation on fentanyl as leverage in its broader relationship with the United States. The move to ban all variants in 2019 came after President Trump accused China of not doing enough to stop the flow of the drug into the United States, and as the issue of fentanyl became increasingly tangled in a broader trade dispute. \n China also agreed at that time to participate in joint law enforcement crackdowns on fentanyl with the United States. The moves led Mr. Trump to praise the Chinese leader, Xi Jinping, for making \"a wonderful humanitarian gesture.\"",
      "ml_hf_summary": "In 2019, China banned all variants of fentanyl as a tactic during trade negotiations with the US under President Trump's administration. This action followed accusations from Trump that China was not doing enough to curb fentanyl trafficking into the US.  China also agreed to participate in joint law enforcement efforts against fentanyl with the US at this time. The ban and cooperation were seen as a positive step by Trump, who praised Xi Jinping for his \"wonderful humanitarian gesture.\" As trade tensions between the two countries remain high, China may once again leverage its stance on fentanyl as leverage in negotiations. \n"
    },
    {
      "title": "Auction of ancient Indian gems ‘imbued with presence of Buddha’ condemned",
      "link": "https://www.theguardian.com/world/2025/may/02/auction-of-ancient-indian-gems-imbued-with-living-presence-of-buddha-condemned",
      "published": "2025-05-02",
      "summary": "Sotheby’s sale of Piprahwa gems, excavated after burial with Buddha’s remains, denounced as perpetuating colonial violence",
      "content": "Buddhist academics and monastic leaders have condemned an auction of ancient Indian gem relics which they said were widely considered to be imbued with the presence of the Buddha. The auction of the Piprahwa gems will take place in Hong Kong next week. Sotheby's listing describes them as being \"of unparalleled religious, archaeological and historical importance\" and many Buddhists considered them to be corporeal remains, which had been desecrated by a British colonial landowner. Prof Ashley Thompson, of Soas University of London, and the curator Conan Cheong, both experts in south-east Asian art, also claimed the auction raised ethical concerns about the ownership of treasures \"wrongfully acquired during the colonial era\". The gems, which are expected to sell for about HK$100m (PS9.7m), are being sold by three descendants of the British engineer William Claxton Peppe, who in 1898 excavated them on his estate in northern India. They include amethysts, coral, garnets, pearls, rock crystals, shells and gold, either worked into pendants, beads, and other ornaments, or in their natural form. The gems were originally buried in a dome-shaped funerary monument, called a stupa, in Piprahwa, in present-day Uttar Pradesh, India, about 240-200BC, when they were mixed with some of the cremated remains of the Buddha, who died about 480BC. The British crown claimed Peppe's find under the 1878 Indian Treasure Trove Act, with the bones and ash gifted to the Buddhist monarch King Chulalongkorn of Siam. Most of the 1,800 gems went to the colonial museum in Kolkata, while Peppe was permitted to retain approximately a fifth of them. Thomson said: \"For the vast majority of devotees, these gem relics are not inanimate objects - they are imbued with the presence of the Buddha. \"The relics - bones, ash and gems - were all found together inside the funerary monument, and were meant by those who deposited them to be together in perpetuity. When excavated they were categorised as human remains on the one hand and gems on the other. This sale perpetuates the colonial violence of that separation.\" Venerable Dr Yon Seng Yeath, the abbot of Wat Unnalom, the headquarters of Cambodia's Mahanikaya Buddhist order, said the auction \"disrespects a global spiritual tradition and ignores the growing consensus that sacred heritage should belong to the communities that value it most\". Mahinda Deegalle, a Buddhist monastic leader and emeritus professor at Bath Spa University, said the sale was \"appalling\" and a \"humiliation of one of the greatest thinkers in the world\". Chris Peppe, a great-grandson of William Claxton Peppe who owns the gems along with two other relatives, said none of the Buddhist temples or experts he had consulted over the past 10 years regarded them as corporeal remains. \"[These] arguments don't represent Buddhist popular opinion,\" said Peppe, a film editor and director based in Los Angeles. \"They belong to Buddhist scholarship and don't help us find a way to get the gems into Buddhist hands. The Piprahwa gems were relic offerings made at the time of the reinterment of the Buddha's ashes over 200 years after his passing.\" The film-maker, who wrote a piece for Sotheby's about his family's custodianship of the gems, said they had considered donating them to temples and museums but this proved to be problematic. \"An auction [in Hong Kong] seems the fairest and most transparent way to transfer these relics to Buddhists and we are confident that Sotheby's will achieve that,\" he added. One of the experts Chris Peppe consulted, John Strong, a professor emeritus of religious studies at Bates College, Maine, said the gems could be regarded in several ways. He said some experts and devotees saw them as special offerings intended to honour the bodily remains of the Buddha, while others viewed them as a special kind of relic, symbolising \"the ongoing incorruptibility of the quality of Buddhahood\". A Sotheby's spokesperson said: \"We conducted requisite due diligence, including in relation to authenticity and provenance, legality and other considerations in line with our policies and industry standards for artworks and treasures.\"",
      "ml_hf_summary": "An auction of ancient Indian gem relics, known as the Piprahwa gems, is scheduled to take place in Hong Kong next week. The gems are considered by some Buddhists to be imbued with the presence of the Buddha due to their association with his remains, while others view them as inanimate objects.  The gems were originally excavated in 1898 by William Claxton Peppé and subsequently acquired by his descendants.  They are being sold by three descendants of Peppé, who had them categorized as human remains and gems during the colonial era. The sale is expected to raise HK$100 million (£9.7 million). Experts have differing opinions on their significance, with some believing they represent corporeal remains while others view them as symbolic relics.  Sotheby's conducted due diligence regarding authenticity, provenance, legality, and other relevant factors before listing the gems for auction. \n"
    },
    {
      "title": "Australia Election Results: Prime Minister Albanese Wins 2nd Term",
      "link": "https://www.nytimes.com/2025/05/02/world/asia/australia-prime-minister-election.html",
      "published": "2025-05-03",
      "summary": "Heading to the polls amid global uncertainty arising from the Trump administration, voters opted for the known quantity of the incumbent leader, Anthony Albanese.",
      "content": "Prime Minister Anthony Albanese of Australia has won a second term, completing a stunning turnaround for his governing center-left Labor Party that trailed in the polls for months as a festering cost-of-living crisis weighed on voters. \n The Australian Broadcasting Corporation, the country's public broadcaster, called the election for Mr. Albanese just a half-hour after the last polls closed on Saturday. \n It was a resounding defeat of the conservative opposition led by Peter Dutton. He began the campaign riding dissatisfaction with the status quo, but was hamstrung by a string of missteps and an association with some of President Trump's messaging and policies. \n Mr. Dutton, the leader of the Liberal Party, also lost his parliamentary seat in the conservative stronghold of Queensland, which he had held since 2001. His loss echoed the ouster of Canada's conservative leader, Pierre Poilievre, whose defeat was seen as a rejection of his embrace of Mr. Trump.",
      "ml_hf_summary": "Anthony Albanese won re-election as Prime Minister of Australia in a stunning victory for the Labor Party. The Australian Broadcasting Corporation called the election for Albanese just 30 minutes after polls closed on Saturday.  The opposition, led by Peter Dutton, suffered a significant defeat due to voter dissatisfaction with the cost-of-living crisis and Dutton's association with Donald Trump's policies. Dutton lost his parliamentary seat in Queensland, mirroring the loss of Canada's conservative leader Pierre Poilievre who was also seen as a reflection of Trump's influence on Canadian politics. \n"
    },
    {
      "title": "Brazilian Nun Who Was World’s Oldest Person Dies at 116",
      "link": "https://www.nytimes.com/2025/05/02/world/americas/inah-canabarro-lucas-oldest-person-dead.html",
      "published": "2025-05-03",
      "summary": "Sister Inah Canabarro Lucas received a blessing from Pope Francis when she turned 110. She would have turned 117 in a few weeks.",
      "content": "In January, Guinness World Records declared Sister Inah the world's oldest living person after the death of Tomiko Itooka, a Japanese woman who was born before the start of World War I and the sinking of the Titanic. She was also 116. \n In the year Sister Inah was born, the Model T was introduced by Henry Ford; insulin had not yet been discovered; and the world's first demonstration of a television was still several years away. \n Sister Inah's exact birthday has been a source of debate and confusion. A registry had listed it as June 8, 1908, the date recognized by Guinness World Records and LongeviQuest, which keeps a database of supercentenarians, people who are 110 or older. \n But her family and friends have said that Sister Inah was born on May 27, 1908, in Sao Francisco de Assis in the state of Rio Grande do Sul. They said that her parents had traveled a great distance and several days to register her birth. \n As a child, she was so thin that her parents feared she would not survive, her nephew, Cleber Canabarro, who is in his 80s, told The Associated Press in January. Her great-grandfather was a well-known general who had taken up arms during the turbulent period after Brazil declared independence from Portugal in the 19th century, The A.P. reported.",
      "ml_hf_summary": "Sister Inah, an individual residing in Brazil, has been recognized as the world's oldest living person by Guinness World Records and LongeviQuest following the death of Tomiko Itooka.  Born on either May 27, 1908, or June 8, 1908, Sister Inah's exact birthdate remains a subject of debate. Her family claims she was born in São Francisco de Assis, while official records list her birthday as June 8, 1908.  Sister Inah's remarkable longevity is attributed to factors such as her parents' long journey to register her birth and the historical context of Brazil during the 19th century. \n"
    },
    {
      "title": "Cardinal Parolin, Leader of Papal Conclave, Is Also a Top Candidate",
      "link": "https://www.nytimes.com/2025/05/03/world/europe/pope-conclave-cardinal-pietro-parolin.html",
      "published": "2025-05-03",
      "summary": "Cardinals have talked about Cardinal Pietro Parolin, the Vatican secretary of state, as someone who could have a steady, bureaucratic hand on the church’s wheel.",
      "content": "In the days surrounding Pope Francis' death, Cardinal Pietro Parolin was everywhere. \n The No. 2 figure in the Vatican, he visited Francis in the hospital, and then helped seal the papal apartments after the pope died. He welcomed cardinals he knew from around the world to the pope's funeral, talking to former President Joseph R. Biden Jr., President Volodymyr Zelensky of Ukraine and former Prime Minister Matteo Renzi of Italy. And leading up to the conclave to pick the next pope, he celebrated an outdoor Mass for tens of thousands of faithful on the steps of St. Peter's Basilica. \n It seems that everyone knows Cardinal Parolin, the Vatican secretary of state, who will preside over the papal election and who has emerged as the leading compromise candidate before a conclave in which many of the more than 130 cardinals do not know one another. \n \"The only candidate that for now has emerged with a certain insistence is Parolin,\" said Andrea Riccardi, the founder of the Sant'Egidio Community, a Catholic group close to Francis. \"He represents a continuity,\" added Mr. Riccardi, who is close to several cardinals who are considered papal contenders. \"He has said, 'Virtue stands in the middle.'\"",
      "ml_hf_summary": "Cardinal Pietro Parolin, the Vatican's Secretary of State, played a prominent role following Pope Francis' death. He visited the pope in the hospital, oversaw the sealing of his apartments, and welcomed cardinals from around the world to the funeral.  Parolin also celebrated an outdoor Mass for thousands on the steps of St. Peter's Basilica before the conclave to elect the next pope. As the leading compromise candidate, he is expected to preside over the election, which will be attended by more than 130 cardinals who may not know each other well.  \n"
    },
    {
      "title": "China Is Considering Trade Talks With U.S., but It Has Conditions",
      "link": "https://www.nytimes.com/2025/05/02/world/asia/china-us-tariffs-talks.html",
      "published": "2025-05-02",
      "summary": "Despite mounting financial pressure, China says it won’t negotiate until the Trump administration shows “sincerity” by canceling tariffs on its goods.",
      "content": "The two countries have been sparring since President Trump ratcheted up tariffs on Chinese goods to a minimum of 145 percent last month, while omitting China from a 90-day pause on his tariffs that he granted to all other countries. China has responded with its own sky-high tariffs on U.S. goods, while blocking some American companies from doing business in China and restricting exports of critical minerals that U.S. manufacturers rely on to make things like semiconductors, drones and cars. \n The clash, which has doubled as a battle of wills between Mr. Trump and China's top leader, Xi Jinping, has shaken global markets and accelerated a decoupling of the world's two largest economies. \n Many countries are under growing pressure to pick sides, with the Trump administration pressuring U.S. trading partners to restrict access to Chinese exports and Beijing threatening countermeasures against countries that comply. \n It is unclear which officials from the United States and China have been in contact about setting up negotiations. Analysts have said that the two sides have different approaches to such talks. Mr. Trump would prefer to take the lead and speak directly to Mr. Xi, but China's officials tend to prefer to negotiate details -- and hash out a deal -- in advance, before the leaders meet. \n \"We know that China and the United States have contacts at the working level,\" said Wu Xinbo, the dean of the Institute of International Studies at Fudan University in Shanghai. \"The key now is that China hopes that the United States will give a clear signal that it is sincere in negotiating, and then it can move from this kind of working contact to formal negotiations. China has kicked the ball to the United States.\"",
      "ml_hf_summary": "Tensions between the US and China escalated after President Trump imposed tariffs on Chinese goods at 145% and excluded China from a tariff pause for other countries. In response, China implemented its own high tariffs on US goods, restricted American businesses in China, and limited exports of critical minerals crucial to US manufacturing. This trade war has significantly impacted global markets and accelerated economic decoupling between the two nations. While contact at the working level exists between both sides, there is disagreement on negotiation approaches; Trump prefers direct talks with Xi Jinping while China prefers pre-negotiated details before leader meetings.  \n"
    },
    {
      "title": "Druse in Syrian Town Rocked by Violence Agree to Disarm Militias",
      "link": "https://www.nytimes.com/2025/05/03/world/middleeast/syria-druse-sectarian-violence.html",
      "published": "2025-05-03",
      "summary": "After this week’s bloodshed, Druse leaders in Ashrafieh Sahnaya agreed to integrate militia fighters into government forces. But some residents remain wary.",
      "content": "Sirens blaring, a truckful of armed men trailing in its wake, the black sport utility vehicle that sliced sharklike through the Syrian town of Ashrafieh Sahnaya on Friday morning was impossible to miss. \n Government forces had retaken control from the armed groups that turned the town into a sectarian battlefield for two days this week, killing dozens and exposing for all to see the new Syrian leaders' shaky grip on security. Now, government representatives had arrived to pledge peace to a skeptical town. \n In an airy, echoing religious meeting hall, two officials in suits sat shoulder to shoulder with white-bearded leaders of the Druse religious minority in traditional red-topped white hats, talking of unity. \n \"We're all in one ship,\" said Jameel Mudawwar, the area's top official. \"If it sinks, God forbid, we'll all sink.\"",
      "ml_hf_summary": "On Friday morning, a government-controlled truck carrying armed men passed through Ashrafieh Sahnaya, Syria, after government forces retook control of the town from armed groups that had been engaged in a two-day sectarian conflict.  This event followed the Syrian government's pledge to restore peace and security to the town. Two officials representing the government met with Druse religious leaders in a meeting hall to discuss unity and cooperation. The top official, Jameel Mudawwar, emphasized the shared fate of all residents if the situation worsened. \n"
    },
    {
      "title": "Exxon and Chevron Report Lower Profits While Girding for Tariffs",
      "link": "https://www.nytimes.com/2025/05/02/business/energy-environment/exxon-chevron-earnings.html",
      "published": "2025-05-03",
      "summary": "President Trump’s trade policies have helped to push down oil prices while raising the costs of materials for oil and gas companies.",
      "content": "The two largest U.S. oil companies reported their lowest first-quarter profits in years on Friday as they braced for the economic fallout from President Trump's trade war, which has weakened consumer confidence and pushed oil prices down. \n U.S. crude prices slipped under $60 a barrel this week, a threshold below which many companies cannot make money drilling new wells. Crude oil is now about $20 a barrel cheaper than it was just before Mr. Trump took office. Not only is oil fetching less, companies are paying more for steel and other materials because of tariffs the president has imposed. \n There are signs that some companies are already pulling back. \n As of last week, the number of rigs drilling wells in the Permian Basin, the largest U.S. oil field, had fallen 3 percent in a month, according to Baker Hughes, an oil field service provider. That company's customers have been putting off discretionary expenses, and spending across the industry is likely to fall this year, Baker Hughes executives said last week. \n \"We are seeing significant downward pressure on prices and margins. In this environment, it is more important than ever to focus on what we can control,\" Darren Woods, chief executive of Exxon Mobil, told analysts on Friday.",
      "ml_hf_summary": "ExxonMobil and Chevron reported their lowest first-quarter profits in years due to a combination of factors including President Trump's trade war, which has lowered oil prices and increased material costs.  U.S. crude oil prices fell below $60 per barrel this week, making it difficult for companies to invest in new drilling projects. The number of active oil rigs in the Permian Basin decreased by 3% last month, indicating a slowdown in industry activity. Executives from ExxonMobil emphasized the need to focus on controllable factors amidst challenging market conditions.  \n"
    },
    {
      "title": "Gaza blockade: a Palestinian widow, her children and a cupboard that is almost bare",
      "link": "https://www.theguardian.com/world/2025/may/02/we-want-the-fear-to-end-a-palestinian-widow-relives-the-trauma-of-loss-and-struggle-for-survival",
      "published": "2025-05-02",
      "summary": "Ibtisam Ghalia and her four children are just one of the families living on brink of starvation with no sign of an end to blockade",
      "content": "Every day, Ibtisam Ghalia and her four children count their remaining stocks of food. These are meagre: a kilo or so of beans, a bag of lentils, a little salt, some herbs, spices, and enough flour for half a dozen flatbreads cooked on a griddle over a fire of wood splinters, waste plastic and cardboard. In the two months since Israel imposed a total blockade on Gaza, stopping food, medicine, fuel and anything else from entering the devastated territory, Ghalia's \"cupboard\" has slowly diminished. There have been better days, when Ghalia has received a cash distribution from an NGO and has been able to buy fresh vegetables or fruit on the market, or been given a kilogram of flour by a relative or friend. But prices have risen steadily as the blockade has gone on and basic foodstuffs become scarcer. Sugar that once cost a dollar a kilo now costs 20 times that. A sack of old, poor-quality flour costs far more money than Ghalia can muster. The bakeries run by the World Food Programme shut down weeks ago, all out of flour or fuel. The kitchens that hand out nearly 1 million meals every day in Gaza have limited supplies left. The warehouses of the UN are empty. The family has not eaten meat or dairy products for months. \"We are trying as much as possible to stretch our food since the crossings closed ... We now eat just one or two meals a day. I divide the bread among my children just to curb their hunger. I try to eat less so there's enough for them,\" Ghalia said. Every day since the ceasefire definitively collapsed six weeks ago, the sound of airstrikes and shelling has been clearly audible in the small tented encampment in farmland near the devastated town of Beit Lahia where Ghalia and her family have pitched their tent. This terrifies her. In December 2023, her husband, Hamza, was killed in an Israeli drone strike along with an uncle and a cousin as they searched for food in the ruins of their former home. \"I didn't scream or fall apart when I found them. I thanked God that I was able to find and bury them. The hospital refused to receive or shroud them, saying they were already decomposing and there were no burial shrouds. So we wrapped them in blankets and buried them ourselves,\" Ghalia, 32, remembered. \"My children cried every day, asking to see their father. The older two [now 10 and nine] wept constantly, wanting to see him again. I kept comforting them, saying we'll reunite with him in heaven.\" Last week, Ghalia's sister was hit in the leg by a stray bullet while she was cooking beside the tent. Every day her eldest son, 10-year-old Hossam, heads out into the surrounding wasteland to search for firewood. There is no other fuel, with no cooking gas available and benzene supplies so low that two-thirds of Gaza's remaining battered fleet of ambulances have been immobilised and only a third of generators in the territory are working. \"If he is just a little late coming back, I panic. I cannot lose a son as well as my husband. But we have to cook somehow so I have to send him off. He is only 10 but like an adult now with all his duties and worries.\" Her daughter Jinan, 9, has recurrent nightmares about explosions and scattered body parts. \"I miss my old life so much. I miss my father - his voice and his smell. He used to take us for kebabs at the weekend. Now, there's nothing to buy in the markets. Water we get from the nearby school or from water trucks that come to the camp. My older brother and I carry it to our tent,\" she said. \"I miss school so much. My mother told me that when I grow up, I will become a teacher because I love learning, and I hope I succeed in that ... All I fear now is losing one of my siblings. I have nightmares in which I see people being killed, and lots of blood.\" About 10,000 cases of acute malnutrition among children have been identified across Gaza, including 1,600 cases of severe acute malnutrition, since the start of 2025, the UN said in a report last week. Amjad Shawa, director of the Palestinian NGOs Network in Gaza, said the humanitarian system in the territory was collapsing. \"We just have a few days of supplies left. Each day is worse than the one before,\" Shawa said. Israeli officials justify the blockade on Gaza with claims that Hamas routinely steals aid, distributing it to its fighters or selling it to raise vital funds. Aid officials in Gaza deny any widespread theft of aid in recent months, though say looting is on the increase since hostilities recommenced \"due to the desperate humanitarian situation\". The war in Gaza was triggered by a surprise attack launched by Hamas into Israel in October 2023, in which militants killed more than 1,200 people, mostly civilians, and took 250 hostages. Israeli officials say one aim of the blockade is to pressure Hamas to release the 59 hostages who remain in Gaza, more than half of whom are thought to be dead. According to the ministry of health in Gaza, between 22 and 30 April, 437 Palestinians were killed and 1,023 were injured. In all, 52,400 Palestinians, mostly civilians, have been killed in the war, including more than 2,300 since Israel renewed its offensive in mid-March after reneging on a promise to move to a second phase of the fragile ceasefire which came into force in January. \"We just want to live in safety. We want the fear to end, the war to stop, life to return to how it used to be. We want our homes back,\" Ghalia said, then turned back to counting her dwindling supplies. On Friday, her flour will run out, leaving just the beans and the packet of lentils.",
      "ml_hf_summary": "Since Israel imposed a blockade on Gaza in June 2023, food, medicine, fuel, and other essential items have been severely restricted, leading to a severe humanitarian crisis.  Ibtisam Ghalia and her four children are experiencing extreme hardship as their limited supplies dwindle. The blockade has caused widespread shortages of basic foodstuffs, with prices skyrocketing and bakeries and kitchens running out of resources.  The UN reports that over 10,000 cases of acute malnutrition have been identified in Gaza, including severe cases.  Hamas's attack on Israel in October 2023 triggered the blockade, which is intended to pressure Hamas into releasing hostages. The war has resulted in significant civilian casualties and displacement, with a total of over 52,400 Palestinians killed.  The humanitarian situation in Gaza continues to deteriorate as aid supplies dwindle and access to essential services remains limited. \n"
    },
    {
      "title": "Ghana Wanted a Cathedral. It Got an ‘Expensive Hole’ Instead.",
      "link": "https://www.nytimes.com/2025/05/03/world/africa/ghana-cathedral-christian-corruption-hole.html",
      "published": "2025-05-03",
      "summary": "The nation had grand plans for a national cathedral designed by a celebrity architect. The $400 million project became a political battleground.",
      "content": "The project began with much fanfare. In 2019, at a fund-raising dinner in Washington, a smiling Mr. Akufo-Addo cut into a large gray, square confection -- the planned cathedral rendered in cake. With a 5,000-seat auditorium and a concave roof referencing the curve of Asante royal stools, it was intended to be much more than just a cathedral. It was to be a national monument, similar to the Washington National Cathedral or London's Westminster Abbey. A place where the solemn ceremonies of state -- like presidents' funerals and royal weddings -- would take place. \n Mr. Akufo-Addo, who was born into a Presbyterian family but became an Anglican as a young man, told the group gathered in Washington that the interdenominational cathedral would be a unifier for Ghanaian Christians, who represent more than 70 percent of the population. It would also be an offering of thanks to God for sparing the country from the epidemics, civil wars and famines that had plagued its neighbors, he said. \n But then he revealed a third reason for its construction. \n \"I made a pledge to God that if I become the president -- after two unsuccessful attempts -- in the 2016 presidential elections, I will build a cathedral to the glory of God,\" he said, according to official readouts of the event.",
      "ml_hf_summary": "Ghanaian President Nana Akufo-Addo announced plans for a large interdenominational cathedral in 2019. The project was intended to be a national monument and a place for solemn state ceremonies like presidential funerals and royal weddings.  The cathedral, designed with a concave roof inspired by Asante royal stools, was envisioned as a symbol of unity for Ghanaian Christians, who make up over 70% of the population. President Akufo-Addo's pledge to build the cathedral was made after his successful third attempt at becoming president in 2016.  \n"
    },
    {
      "title": "Hikers Stumble Upon a Pile of Gold Coins, Igniting a Historical Hunt",
      "link": "https://www.nytimes.com/2025/05/03/world/europe/czech-treasure-gold-discovery.html",
      "published": "2025-05-03",
      "summary": "The discovery of coins and jewelry in the Czech Republic worth up to $680,000 raises a tantalizing mystery for historians and amateur sleuths: Who buried the treasure?",
      "content": "\"What is exceptional in this case is the volume,\" Dr. Novak said. \n He estimated that the gold coins were worth around 7.5 million Czech Koruna, or about $340,000. The other items, if they are solid gold and not merely gold plated, could be worth another $340,000, he said. \n But what was really intriguing, he said, was how recently the items were buried. \n While archaeological discoveries are fairly common in the region, with many dating back to the Bronze Age or medieval times, the newest coin in this collection was from 1921, indicating that the treasure had been hidden within about the past century. \n That relative recency has offered a tantalizing lead to researchers, who think they may be able to track down the owner of the treasure through archival research and solve the mystery of why it was hidden. \n \"It's possible that someone might come across some information, perhaps in the newspapers of the time, that someone robbed a jewelry store or something like that, and suddenly it might lead us to a clue,\" Dr. Novak said.",
      "ml_hf_summary": "Archaeologists discovered a collection of gold coins and other items in the Czech Republic, estimated to be worth $340,000 USD. The most recent coin dates back to 1921, indicating the treasure was buried within the past century. This relatively recent discovery has sparked interest in tracking down the owner through archival research and potentially solving the mystery of why the treasure was hidden.  Dr. Novak believes that newspaper archives may hold clues about the treasure's origin, such as potential robberies or other events that could lead to its identification. \n"
    },
    {
      "title": "In Singapore’s Election, a Blow to the Fledgling Opposition",
      "link": "https://www.nytimes.com/2025/05/02/world/asia/singapore-election-pap-workers.html",
      "published": "2025-05-03",
      "summary": "The People’s Action Party continued its six-decade reign, as was widely expected. But many had anticipated it to lose more ground to the opposition.",
      "content": "Many had believed that the P. A.P's hold on power would weaken because many average Singaporeans increasingly say they no longer feel prosperous. Singapore now has more millionaires than London. But while average wealth has more than doubled in local currency terms, median wealth has fallen 1.8 percent from 2008 to 2023, according to the Swiss bank UBS. \n \"My concern is that the government is bringing the country up but it's also leaving a lot of people behind,\" said Kris Tan, 44, a personal trainer. \n Mr. Tan said he was worried about his children's future, particularly about the cost of living. \n Mr. Tan said he was also concerned about elitism, which he says is getting more obvious with regards to the upper echelons of the government compared to the people.\" He noted the million-dollar salaries that the country's ministers earn. \n But Cherian George, who has written books on Singapore politics, said: \"What this election shows is that when the external threats are so salient and so dramatic, it makes Singaporeans more conscious of the fact that the world is a difficult and sometimes ugly place. And that perhaps increases their sense of gratitude for a more generally capable and stable government.\" \n Since the last election, the government has bolstered social spending, giving temporary financial support to people who have been laid off and offering vouchers to help with daily expenses. But it has continued to face discontent over increases in the sales tax and declining housing affordability, issues that the opposition has seized on.",
      "ml_hf_summary": "Singapore's average wealth has more than doubled in local currency terms since 2008, but median wealth has fallen 1.8% during the same period according to UBS.  This disparity is concerning for many Singaporeans, including personal trainer Kris Tan, who worries about his children's future and rising costs of living.  While some see this as a sign of increased government capability and stability, others like Cherian George point to heightened external threats leading to greater appreciation for the government's role in providing stability. The government has implemented social spending programs to address unemployment and daily expenses, but opposition parties have capitalized on concerns about sales tax increases and declining housing affordability. \n"
    },
    {
      "title": "Israeli airstrikes kill at least 40 people in Gaza, officials say",
      "link": "https://www.theguardian.com/world/2025/may/03/israeli-airstrikes-gaza-death-toll-bureij-beit-lahiya-khan-younis",
      "published": "2025-05-03",
      "summary": "Bureij, Beit Lahiya, Gaza City and Khan Younis hit as Israeli government prepares to expand offensive",
      "content": "Israeli airstrikes have killed at least 40 people across Gaza during the past 24 hours, civil defence officials in the devastated Palestinian territory said, as Israel's government prepared to order an expansion of its military offensive. Nine people were killed when a strike hit a home in the Bureij refugee camp in central Gaza; another six people died in a separate strike targeting a family home in the northern city of Beit Lahiya; six more died in a strike on a community kitchen in Gaza City, and an overnight attack on the Khan Younis refugee camp killed at least 11 people including three babies up to a year old, the officials said. Asked to comment on the strikes, an Israel Defense Forces (IDF) spokesperson said the military \"takes feasible precautions to mitigate civilian harm\". Israel resumed its bombing campaign in Gaza on 18 March, ending a fragile ceasefire. Since then, at least 2,326 people have been killed, bringing the death toll since the war broke out to 52,418, according to the health ministry in Gaza. Israel has accused Hamas of using civilians as human shields, a charge denied by the radical Islamist organisation. It also accuses Hamas of stealing and selling aid to fund its military and other operations. The war was triggered by a surprise attack launched by Hamas into Israel on 7 October 2023. Militants killed more than 1,200 people on the Israeli side, mostly civilians, and abducted 251 people, 58 of whom are still held in Gaza, including 34 whom the Israeli military says are dead. Aid officials have warned of a humanitarian catastrophe in Gaza, with famine again looming. On Friday, the International Committee of the Red Cross (ICRC) warned that the humanitarian response in Gaza was on the \"verge of total collapse\". \"This situation must not - and cannot - be allowed to escalate further,\" Pascal Hundt, the ICRC's deputy director of operations, said in a statement. There has been no progress in faltering negotiations for a new ceasefire-for-hostages deal in recent weeks, and reports in Israeli media suggest Benjamin Netanyahu, the prime minister, will soon approve a new broader offensive as well as a new plan drawn up by Israeli officials for renewed distribution of aid in Gaza involving private contractors and a small number of \"hubs\" to be constructed in the south of the territory. Humanitarian officials in Gaza told the Guardian last week that the proposed Israeli aid plan was impracticable and unethical. \"The current scheme just won't work unless there are a lot more distribution hubs and even then we cannot be a party to something that may drive massive and possibly permanent displacement within Gaza,\" one senior humanitarian official said. The US president, Donald Trump, is thought to be likely to press Israel for some concessions on aid entering Gaza before he visits Saudi Arabia, the UAE and Qatar this month. A week ago, he told Netanyahu to be \"good to Gaza\". Analysts are divided on whether warnings issued to tens of thousands of Israeli reservists to expect to be called up in the coming days or weeks are designed to put further pressure on Hamas to make concessions in talks or are evidence that a new offensive in Gaza is imminent. Israel's military is already overstretched after 18 months of war, with a shortfall of about 7,000 combat soldiers. Government officials describe a \"seven-front war\" that could last another year. On Saturday morning, sirens sounded in Israel for the second day running, warning of an incoming missile launched by Iran-backed Houthi rebels in Yemen, who say the attacks are in solidarity with Palestinians in Gaza. Air defences intercepted the missile. Separately, Israel's military said on Saturday its forces deployed in southern Syria were ready to protect the Druze minority, without specifying whether this was a new deployment or giving further details on the number of troops on the ground. After deadly sectarian clashes near Damascus earlier this week, Israel has conducted multiple strikes it says were meant to protect the Druze community and warned Syria's Islamist rulers against harming the minority group. On Saturday, the Israeli military said that \"five Syrian Druze citizens were evacuated to receive medical treatment in Israel overnight\" after sustaining injuries on Syrian territory. A Druze official in the southern Syrian city Sweida said those evacuated had been wounded \"in clashes in Sahnaya\", the site of recent sectarian violence near Damascus, but were afraid of being sent to hospitals in the Syrian capital out of fear of being detained. Israel launched a new wave of more than 20 airstrikes in Syria late on Friday, according to the Syrian Observatory for Human Rights, a UK-based monitoring group. Early on Friday, Israel had launched an attack near the presidential palace in Damascus, which Syrian authorities condemned as a \"dangerous escalation\". Israel's defence minister, Israel Katz, warned on Thursday that Israel would respond forcefully if Syria's new government failed to protect the Druze minority. Since the fall of Bashar al-Assad's regime in December, Israel has launched repeated airstrikes on Syria. It has also sent troops to what was a demilitarised zone in the Golan Heights, on Syria's south-west border with Israel, seizing key strategic terrain where Syrian troops were once deployed. Analysts in Israel say the strategy aims to undermine the new Syrian government while also protecting and so co-opting a potential proxy ally within the country. The strategy is controversial, however, with some officials arguing that a stable Syria would better serve Israel's interests. The government in Damascus took power after ousting Assad and is dominated by the militant group Hayat Tahrir al-Sham, which has its roots in al-Qaida's jihadist network. Though Syria's new rulers have promised inclusive rule in the multiconfessional, multi-ethnic country, they face pressures from extremists within their own ranks. Agence France-Presse contributed to this report",
      "ml_hf_summary": "Israeli airstrikes have killed at least 40 people in Gaza over the past 24 hours, according to civil defense officials. The strikes targeted homes and community kitchens, resulting in a significant loss of life.  Since the war began on October 7th, 2023, at least 52,418 people have died in Gaza, with Israel accusing Hamas of using civilians as human shields.  The conflict has led to a humanitarian crisis in Gaza, with aid officials warning of famine and a potential displacement of residents. The Israeli government is preparing to expand its military offensive, while the US president, Donald Trump, is expected to pressure Israel for concessions on aid distribution. Tensions remain high, with reports of increased violence in Syria, including airstrikes targeting Syrian Druze communities and clashes near Damascus. \n"
    },
    {
      "title": "Life in Ukraine Has Become More Dangerous Since Cease-Fire Talks Began",
      "link": "https://www.nytimes.com/2025/05/02/world/europe/ukraine-russia-war-cease-fire-talks.html",
      "published": "2025-05-02",
      "summary": "Russian strikes and fighting along the front line have killed far more civilians than over the same period a year ago, U.N. officials said in a presentation for diplomats in New York this week.",
      "content": "With the beginning of cease-fire talks in the war between Russia and Ukraine, life has become riskier for Ukrainian civilians, according to a tally of civilian deaths by the United Nations and analysts reviewing recent Russian strikes. \n Since the talks began in February, Russian missile and drone strikes and fighting along the front line have killed far more civilians than over the same period a year ago, U.N. officials said in a presentation for diplomats in New York this week. In the first 24 days of April, for example, 848 civilians were killed or wounded, a 46 percent increase over the same period last year, the U.N. said. \n At the same time, Russia has been targeting cities more intensively -- just last month hitting a playground, pedestrians on a crowded sidewalk and an apartment building -- an analysis of recent strikes shows. In the fighting on the ground, Russia opened a new offensive in the north, east and south, Ukraine's top military commander, Gen. Oleksandr Syrsky, said on April 9. \n On March 11, Ukraine launched on Moscow its largest drone assault of the entire war -- the morning of the day it agreed to a cease-fire. The barrage killed three people and wounded 18 others in the Russian capital and nearby, the Russian authorities said.",
      "ml_hf_summary": "Since the beginning of ceasefire talks between Russia and Ukraine in February, civilian casualties have increased significantly.  The UN reports that over the first 24 days of April, 848 civilians were killed or wounded, a 46% increase compared to the same period last year.  Russia has intensified its targeting of cities with recent strikes on playgrounds, sidewalks, and apartment buildings.  Ukraine launched a large-scale drone attack on Moscow on March 11th, coinciding with the ceasefire agreement, resulting in three deaths and 18 injuries.  The fighting has expanded to new fronts in the north, east, and south of Ukraine. \n"
    },
    {
      "title": "Marco Rubio Adds a New Title Under Trump: Interim National Security Adviser",
      "link": "https://www.nytimes.com/2025/05/01/us/politics/marco-rubio-national-security-secretary-state.html",
      "published": "2025-05-02",
      "summary": "The former senator from Florida is now the head of four government bodies. He has outdone Henry Kissinger and even Xi Jinping, China’s leader, who has only three main titles.",
      "content": "Of course, having four jobs also raises more practical issues: Does Mr. Rubio get a pay bump? Will he have time to hop around the globe to do diplomacy? How will he delegate his duties? \n There are precedents -- sort of. From 1973 to 1975, Henry Kissinger held two of Mr. Rubio's jobs, secretary of state and national security adviser, in an experiment that was considered a failure. In the current Trump administration, two officials, Kash Patel, the F.B.I. director, and Daniel Driscoll, the Army secretary, have both been interim head of the Bureau of Alcohol, Tobacco, Firearms and Explosives while also serving in their more prominent posts. \n But it might be more relevant to look outside the United States for examples. Xi Jinping, China's leader, is general secretary of the Communist Party, president of China and chairman of the Central Military Commission -- still one job short of Mr. Rubio's tally when counting his top titles (Mr. Xi is also the head of several party groups). \n The Senate unanimously confirmed Mr. Rubio to be secretary of state. But he entered the other jobs under controversial circumstances. Mr. Trump fired the head archivist, Colleen Shogan, in early February in an apparent act of retribution against the National Archives and Records Administration. Leaders of the agency had raised concerns about Mr. Trump's holding onto boxes of classified documents at his home in Florida after he left office in 2021, though Ms. Shogan was not involved in that episode. \n Four days before Ms. Shogan's firing, Mr. Rubio announced he was the acting administrator for U.S.A.I.D., as Elon Musk, the billionaire adviser to Mr. Trump, and Pete Marocco, a political appointee in the State Department, were gutting the agency. Mr. Marocco and members of Mr. Musk's government-slashing task force did the daily work of reducing the agency to a husk, cutting contracts and firing thousands of employees, but Mr. Rubio signed off on the moves.",
      "ml_hf_summary": "Florida Senator Marco Rubio was confirmed as Secretary of State by the Senate.  He simultaneously assumed other roles: acting administrator for USAID, and interim head of the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF), while also serving in his more prominent post as a member of the National Security Council.  These positions were controversial due to Rubio's involvement in actions taken by Trump administration officials that led to the firing of the head archivist, Colleen Shogan.  The move was part of a larger effort to dismantle USAID and reduce its workforce under the direction of Elon Musk and Pete Marocco. \n"
    },
    {
      "title": "Memory Palace",
      "link": "https://www.nytimes.com/2025/05/03/briefing/memory-palace.html",
      "published": "2025-05-03",
      "summary": "Memorizing a poem is like taking a work of art that you love and letting it live and bloom inside of you.",
      "content": "The first poem I memorized was \"Pinkle Purr\" by A.A. Milne. I was around seven years old when I encountered it and was immediately enchanted. It's a children's poem, four stanzas, all with the same hypnotic AA/BB/AA rhyme scheme. It's a poem about a kitten, Pinkle Purr, and his mother, Tattoo, and their changing relationship as Pinkle Purr grows up, a sort of \"Cat's in the Cradle\" for kids, but less sad. \n I don't remember making any effort to memorize it; I just read the poem so many times that it worked its way into me, such that I knew it as well as I knew the theme songs to my favorite TV shows. I'd walk around muttering to myself, trying out different voices and syllable stresses: \"Tattoo was the mother of Pinkle Purr/A little black nothing of feet and fur;/And by-and-by, when his eyes came through,/He saw his mother, the big Tattoo.\" It was meditative, comforting, an internal metronome that I naturally returned to when I returned to myself. \n Perhaps because I started memorizing poems early, before I was forced to do so in school, I never perceived the process as onerous, but rather as a fun challenge, a way to take something I loved and make it a part of me. As a graduate student, I memorized Galway Kinnell's \"Little Sleep's-Head Sprouting Hair in the Moonlight,\" lines from which still regularly surface in my brain unbidden -- \"Kiss the mouth / that tells you, here, / here is the world\" -- even though I can't recall the whole thing anymore. I love that, amid the practical information and persistent worries and memories good and bad, my mind's archive contains these bits of beauty, lyrics that float up into consciousness, lovely echoes. \n This past week, The Times Book Review ran a weeklong challenge to help readers memorize Edna St. Vincent Millay's \"Recuerdo,\" replete with games and videos. (Ethan Hawke's recitation of \"We were very tired, we were very merry, / We had gone back and forth all night on the ferry\" is delightful and dramatic; I'd like to hear him do \"Pinkle Purr.\") I'm obviously the exact audience for this type of thing, but even if you're the sort who thinks of memorizing verse as homework, I think this challenge will make you reconsider. The poem is dazzling, and the challenge's structure makes it almost effortless to absorb it. I love what A.O. Scott and Aliza Aufrichtig write in their introduction: \"At a time when we are flooded with texts, rants and A.I. slop, a poem occupies a quieter, less commodified corner of your consciousness. It's a flower in the windowbox of your mind.\"",
      "ml_hf_summary": "The article discusses the author's personal experience with memorizing poems, highlighting their early fascination with poetry and its impact on their self-reflection. The author recounts their childhood memory of memorizing \"Pinkle Purr\" by A.A. Milne and later their enjoyment of memorizing Galway Kinnell's poem \"Little Sleep’s-Head Sprouting Hair in the Moonlight.\"  The article then introduces a recent challenge from The Times Book Review to help readers memorize Edna St. Vincent Millay's \"Recuerdo,\" emphasizing the beauty and ease of the process. The author concludes by praising the challenge for offering a quiet escape from the overwhelming digital world, highlighting the enduring power of poetry in fostering personal reflection. \n"
    },
    {
      "title": "Message From the Russian Military: ‘We Lost Your Son’",
      "link": "https://www.nytimes.com/2025/05/03/world/europe/russia-missing-soldiers-ukraine-war.html",
      "published": "2025-05-03",
      "summary": "Russia lacks any formal, organized effort to account for legions of missing soldiers. That often leaves relatives in limbo, fending for themselves with scant government information.",
      "content": "Anna Tsivilyova, a deputy minister of defense and a cousin of President Vladimir V. Putin, told the State Duma last November that 48,000 relatives of the missing had submitted DNA samples in hope of identifying remains, although that included some duplicate requests from the same family. \n In Ukraine, \"Want to Find,\" a government project to help locate Russian servicemen captured or killed there, said it had received more than 88,000 requests for information, with over 9,000 in April alone. It noted that the overall number of missing is still unknown. \n The International Committee of the Red Cross, which tries to locate missing from both sides, whether civilians or military, has 110,000 cases submitted. \n The family of Isakhanov Ravazan, a 25-year-old soldier, last received a brief voice message from him on Nov. 9. During a battle soon afterward, his aunt said, he radioed his commander that he could not stanch the bleeding from a bad wound. He has not been heard from since. \n \"No one saw him dead,\" said his aunt, who, like several people in this article, did not want to be named for fear of falling afoul of laws against detailing battlefield losses. \"Maybe he saved himself, maybe someone found him, we are still holding onto hope that he is alive,\" she said. \"There is no peace for the soul. I cannot sleep at night, and neither can his parents.\"",
      "ml_hf_summary": "Anna Tsivilyova, a deputy minister of defense, reported that 48,000 relatives of missing Russian soldiers have submitted DNA samples in Ukraine. The \"Want to Find\" project has received over 88,000 requests for information on missing personnel, with over 9,000 in April alone. The International Committee of the Red Cross (ICRC) reports receiving 110,000 cases related to missing individuals from both sides of the conflict. Isakhanov Ravazan, a 25-year-old soldier, last communicated on November 9th before going missing during battle. His family remains hopeful for his survival despite not having confirmed information about his fate. \n"
    },
    {
      "title": "Mummy mystery solved: ‘air-dried’ priest was embalmed via rectum",
      "link": "https://www.theguardian.com/world/2025/may/02/mummy-mystery-solved-air-dried-priest-was-embalmed-via-rectum",
      "published": "2025-05-02",
      "summary": "Method of preserving 18th-century Austrian vicar has never been seen before, say researchers",
      "content": "The mystery of a mummy from an Austrian village has been solved, according to researchers who say it was embalmed in an unexpected way - via the rectum. Intrigue had long swirled around the mummified body stored in the church crypt of St Thomas am Blasenstein. The remains were rumoured to be the naturally preserved corpse of an aristocratic vicar, Franz Xaver Sidler von Rosenegg, who died in 1746 at the aged of 37, gaining the mummy the moniker of the \"air-dried chaplain\". Now experts say they have discovered the body was embalmed with the abdominal and pelvic cavities packed with wood chips, fragmented twigs, fabrics such as hemp and silk, and zinc chloride - materials that would have absorbed fluids inside the body. Dr Andreas Nerlich, a pathologist at Ludwig Maximilian University of Munich in Germany and first author of the study, said the discovery was a surprise as there was no external evidence for such a process. \"The body wall was not opened - therefore the only entrance possible was the rectum,\" he said, noting this was very different from previously known methods of embalming, including those from ancient Egypt. Writing in the journal Frontiers in Medicine, Nerlich and colleagues reported how the mummy had previously been externally examined by experts and studied via X-rays among other investigations. While the X-rays did not detect the internal stuffing, they did reveal a round structure inside the mummy's left lower bowel - leading to rumours that the individual had died after swallowing a poisonous capsule. During a recent renovation of the crypt, Nerlich and colleagues gained approval to carry out a partial autopsy, CT scans and other analyses. The researchers discovered the mummy - which has a well-preserved upper body, but decay to the face, lower legs and feet - is that of a man, most likely between 35 and 45 years of age, with radiocarbon dating of a skin sample suggesting he died between 1734 and 1780. The team note these insights fit with what is know about Sidler, adding that an analysis of bone, tooth and skin samples revealed the man's diet was consistent with that of a local parish vicar in the region, being rich in animal products and central European grain varieties. As expected for a man of the cloth who had an easy life, the skeleton showed no signs of stress - while the corpse showed evidence of long-term pipe-smoking and bunions. \"Both wearing pointy shoes and smoking [a] pipe are very typical for a priest at that time,\" said Nerlich. As for the \"poisonous capsule\", the researchers discovered the object was a single glass bead - similar to those used for rosaries - that may have entered the body as a decoration on the fabric used for stuffing. Sidler's cause of death, the team added, was most likely severe bleeding into the lungs as a result of tuberculosis, with the body showing signs of the disease. Yet why Sidler was embalmed remains unclear. While the team said the evidence suggests it was carried out to avoid the spread of infection by miasma - or \"bad air\" - Nerlich said another potential explanation was that Sidler was preserved for transport to his home monastery of Waldhausen. And he may not have been the only one to receive such treatment. \"This is the first case with this type of documented embalming,\" Nerlich said. \"So we have no idea how often or where this has been performed, although we assume that this type of 'short-term preservation' was used much more often than we might expect from this single case.\"",
      "ml_hf_summary": "A mummy stored in the crypt of St Thomas am Blasenstein in Austria has been identified as that of Franz Xaver Sidler von Rosenegg, an aristocratic vicar who died in 1746.  The body was embalmed using a unique method involving packing wood chips and other materials into the abdominal and pelvic cavities via the rectum. This technique is unlike traditional embalming methods used in ancient Egypt or elsewhere. Radiocarbon dating suggests Sidler lived between 1734 and 1780, while analysis of bone, tooth, and skin samples revealed his diet was consistent with a local parish vicar.  The cause of death was likely severe bleeding into the lungs due to tuberculosis, but why he was embalmed remains unclear. The researchers believe it may have been done to prevent the spread of infection or for transport to his monastery. This is the first documented case of this type of embalming technique. \n"
    },
    {
      "title": "New ‘Climate Superfund’ Laws Face Widening Legal Challenges",
      "link": "https://www.nytimes.com/2025/05/02/climate/climate-superfund-law-vermont-new-york-lawsuits.html",
      "published": "2025-05-02",
      "summary": "The Trump administration sued to block two state laws designed to force oil companies to pay the costs of climate change. Several other states are joining the fight, too.",
      "content": "Patrick Parenteau, an environmental law expert at Vermont Law and Graduate School, called the Justice Department cases \"virtue signaling\" and said he expected them to be dismissed. In the Chamber of Commerce lawsuit, he expects the state to argue that the lawsuit is premature, since officials are still in the midst of deciding how to apply the law, and that the chamber has no standing to sue since it is not directly affected by the measure. \n Julie Moore, secretary of the Vermont Agency of Natural Resources, who is named in both filings, said her office was reviewing the details of the cases. She added that the Justice Department action was \"not unexpected\" given President Trump's April 8 executive order, \"Protecting American Energy From State Overreach.\" \n That order specifically cited the new Vermont and New York laws, calling them akin to extortion and saying they threaten the country's economic and national security. \n Letitia James, the attorney general of New York, who is named in the Justice Department lawsuit, said Thursday that the climate superfund law \"ensures that those who contributed to the climate crisis help pay for the damage they caused.\" \n Meghan Greenfield, an environmental lawyer who previously worked at the Justice Department and Environmental Protection Agency and is now a partner at the firm Jenner & Block, said legal challenges to such a novel law were inevitable. Some of the arguments being used against the measures are also new and untested in this context, like one about \"equal sovereignty\" between states, which is the idea that they should be treated uniformly by the federal government, she said.",
      "ml_hf_summary": "The Justice Department has filed two lawsuits against Vermont and New York over their climate-related laws. The Chamber of Commerce argues the state's actions are premature and lack standing to sue, while the Justice Department claims these laws violate federal law and threaten national security.  Vermont's Secretary of Natural Resources Julie Moore states her office is reviewing the details of the cases. Attorney General Letitia James supports the Vermont climate superfund law, arguing it holds polluters accountable for climate damage. Legal challenges are expected as the novel law faces scrutiny from various legal perspectives. \n"
    },
    {
      "title": "Oil Prices Are Falling. Here’s Where That Could Spell Trouble.",
      "link": "https://www.nytimes.com/2025/05/03/world/europe/oil-prices-tariffs.html",
      "published": "2025-05-03",
      "summary": "For countries that depend heavily on oil revenue, dropping prices are worrisome.",
      "content": "Oil producing countries are bracing for a bumpy ride this year, with a precipitous drop in prices to the lowest levels in four years seen as the initial, alarming sign of looming turmoil. \n A price drop benefits any country seeking to cut its fuel bill. But in oil producing nations, lower prices can feed economic troubles, and sometimes political unrest, as governments slash spending. \n Analysts who had already been predicting lower oil prices because of softening demand amid increased global production said the possibility of a tariff trade war and the overall climate of uncertainty could well deepen producers' woes. \n \"The steep price dive and overall volatility is sending a very strong signal that the global economy is going to be rattled this year and that will translate into a lower demand for oil,\" said Gregory Brew, a specialist on the geopolitics of oil and gas with the Eurasia Group, a New York-based risk analysis organization.",
      "ml_hf_summary": "Oil prices have fallen to their lowest point in four years, signaling potential economic turmoil for producing countries. This decline is attributed to softening demand due to increased global production and heightened uncertainty surrounding trade wars and geopolitical instability. Analysts predict this price drop will exacerbate existing economic challenges faced by oil-producing nations, potentially leading to government spending cuts and political unrest. The combination of these factors suggests a significant impact on the global economy in 2023, with lower demand for oil likely resulting from the overall economic slowdown.  \n"
    },
    {
      "title": "Pakistan’s Leaders May Talk Tough, but War With India Is the Last Thing Pakistanis Want",
      "link": "https://www.nytimes.com/2025/05/02/world/asia/pakistan-india-kashmir.html",
      "published": "2025-05-02",
      "summary": "For many across the country, economic struggles, political malaise and the fear of armed conflict with India now feel like parts of the same burden.",
      "content": "The political divisions in Pakistan come at a precarious time. \n Pakistan's western border remains volatile, with militant groups like the Pakistani Taliban and Afghan Taliban fighters stepping up attacks. This week, Pakistani security forces said they had killed 54 militants during a two-night operation to repel an infiltration near the Afghan frontier. In the southwest, a low-level separatist insurgency has simmered for years, becoming more lethal recently. \n The country's economic challenges only deepen the anxiety. The government recently secured another bailout from the International Monetary Fund, and officials have been promising relief to a weary public. But for many Pakistanis, the promised economic turnaround feels distant and slow to trickle down. \n Pakistan's finance minister, Muhammad Aurangzeb, has said that the economic fallout from the tensions with India was \"not going to be helpful\" to the country's fragile recovery. \n For many, the struggle to get by and the fear of armed conflict now feel like parts of the same burden. And the pain is particularly acute in the part of Kashmir controlled by Pakistan. \n In the Neelum Valley, the once-busy tourist resort town of Keran now lies empty. The guesthouses are quiet. Residents say that tourists have stopped coming since the terrorist attack across the border in Indian Kashmir.",
      "ml_hf_summary": "Pakistan faces political and economic challenges amidst heightened tensions with India and Afghanistan.  Militant groups like the Pakistani Taliban and Afghan Taliban are increasing attacks on security forces, resulting in the death of 54 militants during a recent operation. The country's economy is struggling, requiring another IMF bailout, but relief for citizens feels distant. Tensions between Pakistan and India have exacerbated economic woes, with the finance minister stating that the impact will be detrimental to recovery.  The conflict has also impacted tourism in Kashmir, particularly in Keran, where tourist activity has declined due to a terrorist attack across the border. \n"
    },
    {
      "title": "Paramilitary Fighters Massacre More Than 100 Civilians, Doctors’ Group Says",
      "link": "https://www.nytimes.com/2025/05/02/world/africa/sudan-war-atrocity.html",
      "published": "2025-05-02",
      "summary": "The Sudan Doctors Network said that the Rapid Support Forces had killed at least  21 children on Thursday, the latest violent spasm in Sudan’s civil war.",
      "content": "Paramilitary forces killed more than 100 civilians in an attack on a city in southern Sudan on Thursday, according to an association of doctors, in the latest accusation of a large-scale atrocity of the country's civil war. \n Communication with people in the city, Nahud, was largely cut off starting on Thursday, and the group's claim could not be independently verified. Al Hadath, a Saudi news channel, said that 230 civilians had been killed, while Al Jazeera reported 19 dead and 37 wounded. \n The paramilitary fighters, called the Rapid Support Forces, said on Thursday that they had attacked Nahud, which had been held by the Sudanese military along a highway connecting territory it holds with Darfur -- a western region that has become a stronghold for the Rapid Support Forces. \n At least 542 civilians have been killed in the region in just three weeks, the U.N. human rights chief, Volker Turk, said on Thursday, adding that the real toll is likely much higher.",
      "ml_hf_summary": "On Thursday, paramilitary forces known as the Rapid Support Forces (RSF) allegedly attacked Nahud, a city in southern Sudan, resulting in over 100 civilian deaths.  Communication with residents was disrupted, making independent verification of the attack difficult. The RSF claimed responsibility for the attack, which targeted a location along a highway connecting their territory to Darfur.  The U.N.'s human rights chief, Volker Türk, reported at least 542 civilian deaths in the region within three weeks, with the actual toll likely much higher. Al Jazeera and Al Hadath reported varying casualty numbers, ranging from 19 dead and 37 wounded to 230 killed.  \n"
    },
    {
      "title": "Poised to Expand Gaza Offensive, Israel Calls Up Thousands of Reserve Soldiers",
      "link": "https://www.nytimes.com/2025/05/03/world/middleeast/israel-mobilizes-reservists-gaza.html",
      "published": "2025-05-03",
      "summary": "The mobilization could indicate that the Israeli government is preparing to shift its tactics in its fight against Hamas.",
      "content": "Israel will mobilize thousands of reserve soldiers to bolster its campaign against Hamas in the Gaza Strip, the military announced on Saturday night, as the country appeared poised to expand its offensive in the Palestinian enclave. \n The move prompted fear in Gaza, where Israel has barred food, medicine and other humanitarian aid from entering for over two months. Reeling from more than a year of hunger and fighting, many are still displaced or living amid the rubble of what was once their homes. \n Israel's security cabinet, chaired by Prime Minister Benjamin Netanyahu, was set to meet on Sunday to formally sign off on broadening the campaign in Gaza, said an Israeli official, who spoke on condition of anonymity because they were not authorized to speak publicly. \n Since Israel ended a two-month cease-fire with Hamas in mid-March, Israeli forces have resumed attacking across the enclave. But while Israel jets and drones have regularly bombarded Gaza from the air, Israeli ground forces slowed their advance after seizing some territory.",
      "ml_hf_summary": "Israel is mobilizing thousands of reserve soldiers to intensify its offensive against Hamas in the Gaza Strip. This mobilization follows a two-month cease-fire ending in mid-March, when Israel resumed airstrikes and targeted areas within Gaza. The Israeli security cabinet is scheduled to meet on Sunday to formally authorize expanding the campaign into Gaza.  Israel has imposed restrictions on humanitarian aid entering Gaza for over two months, exacerbating the already dire situation for Palestinians living there. While Israel's ground forces have slowed their advance after seizing some territory, they are now preparing for a more aggressive offensive in Gaza. \n"
    },
    {
      "title": "Prince Harry Says He Would ‘Love Reconciliation’ With Royal Family",
      "link": "https://www.nytimes.com/2025/05/02/world/europe/prince-harry-family-reconciliation-security-battle.html",
      "published": "2025-05-02",
      "summary": "In a BBC interview, Harry said he didn’t know how long King Charles, who has cancer, had left to live, and he expressed a desire to make peace with his family.",
      "content": "Prince Harry said he would love to reconcile with his family in Britain during an emotional BBC interview in which he admitted he had no idea about the prognosis of his father, King Charles III, who has cancer, and expressed a desire to end their painful rift. \n The interview was released hours after Harry lost the latest round of his legal battle over his publicly funded security in the country. \n Speaking in California, where he lives with his wife, Meghan, and their two children, Harry said, \"I would love reconciliation with my family.\" He added, \"There's no point continuing to fight anymore. Life is precious. I don't know how much longer my father has. He won't speak to me because of this security stuff. But it would be nice to reconcile.\" \n The king announced that he had been diagnosed with an undisclosed form of cancer in early 2024 and has been receiving weekly treatments since then. Earlier this week, he met with cancer charities at Buckingham Palace, and on Friday, Mark Carney, Canada's new prime minister, said the king would visit the country later this month.",
      "ml_hf_summary": "Prince Harry expressed a desire to reconcile with his family in Britain during an emotional BBC interview.  He revealed that he was unaware of King Charles III's cancer diagnosis and stated he wants to end their ongoing rift. This comes after Harry lost a legal battle regarding his security funding in the UK. The king announced his cancer diagnosis in early 2024, receiving weekly treatments since then. He recently met with cancer charities at Buckingham Palace and is scheduled to visit Canada later this month.  \n"
    },
    {
      "title": "Rumours, rock-star cardinals and street cleaning: Rome gets ready for conclave ",
      "link": "https://www.theguardian.com/world/2025/may/03/rumours-rock-star-cardinals-rome-pope-conclave",
      "published": "2025-05-03",
      "summary": "Papal electors gossip in bars and restaurants and try to avoid journalists seeking clues to Pope Francis’s successor",
      "content": "Some journalists brave the warm spring sun, others seek respite in the shade of the Vatican's colonnades. Whatever their strategy, the aim is the same: to spot the red-capped cardinals emerging from Synod Hall and try to elicit from them a clue as to who will succeed Pope Francis. The men responsible for picking a new pontiff are enjoying rock-star status in Rome this week as they prepare for conclave: the secret, centuries-old ritual of electing a leader of the Catholic church that is due to begin on 7 May. Marina Garcia Dieguez is among the journalists partaking in the daily stakeout. She is a conclave novice, but was quick to suss out the cunning ways the cardinals try to avoid the gaggle of reporters. \"Each one has his own strategy,\" said Dieguez, who works for the Spanish radio station Cadena Ser and Mediaset Espana. \"Some already have cars with blacked-out windows waiting for them, so they can make a sharp exit. Others remove their red skullcaps and leave by foot, taking a route that crosses St Peter's Square, where they can get lost among the tourists, before escaping through Via della Conciliazione.\" It was at that point, she advised, that you stood a good chance of catching one. Dieguez had managed to obtain quotes from a couple, including Fernando Filoni, an Italian cardinal whose name cropped up this week among the favourites for pope. The Guardian's attempt to give chase was not as successful. \"I don't speak English, which at this precise moment, is a very good thing,\" said an Argentinian cardinal, before politely adding, in Italian: \"But we are working very well together,\" and striding off. About 180 cardinals from all over the world have been gathering each morning this week at Synod Hall to get to know each other and to share their visions of the church, but ultimately to establish a clear pope contender. Of that number, 133 are eligible to vote after two dropped out of the conclave for health reasons. Eight in 10 of the voters were appointed by Francis, with 20 becoming cardinals only in December. Francis made a point of selecting cardinals from places where there had never previously been one, such as Myanmar, Haiti and Rwanda. Until this past week or so, many had never met. During conclave, the men will be sequestered in their humble lodgings at Casa Santa Marta, the guesthouse where Pope Francis lived during his 12-year papacy, and the Sistine Chapel, where the voting takes place. The cardinals swear an oath of silence before each pre-conclave meeting and will do so again when the election begins. But until they are sequestered, it is in the bars and restaurants in the area surrounding the Vatican where the real talking happens, with some mischievous cardinals exploiting the press while they can to leak titbits or to discredit the main candidates. Al Passetto di Borgo, a restaurant in Borgo Pio, has been a favourite among Rome's clergy for years. According to a framed newspaper article hanging on the wall, this was the place where cardinals, over carbonara and tiramisu, plotted to ensure the election of Joseph Ratzinger in the 2005 conclave. Sean Patrick O'Malley, an American cardinal who leads a commission tasked with preventing clerical abuse against minors, was among the diners this week. Aged 80, O'Malley is too old to vote but has been named by some church-watchers as a possibility for pontiff. Another diner was Donald Wuerl, who in 2018 resigned as archbishop of Washington over his handling of a sexual abuse scandal. Showing a photo on his phone of a plain-clothed Wuerl in Al Passetto di Borgo, the restaurant's owner, Antonello Fulvimari, said: \"He's been coming here since 1969.\" The only information Fulvimari had been able to glean from his prestigious clients this week was that they wanted the conclave over \"as soon as possible\". \"They all want to get home,\" he added. \"But this is where the real decisions get made.\" Another popular restaurant is Marcantonio, although according to a waiter, the presence of cardinals has petered out because of journalists. Cardinals who want to spread rumours tend to resort to the veteran Vatican reporters from the Italian press. They have sought to diminish the credibility of some leading contenders - for example Pietro Parolin, the Vatican's secretary of state - by claiming they have health issues. Luis Antonio Tagle, a reformer from the Philippines and a strong favourite, has also had a rough ride from conservative cardinals after a video of him singing John Lennon's Imagine emerged on the internet. Another meeting point is reportedly Caffe dei Papi, a coffee bar tucked away from the main hubbub on Via Vespasiano. \"But I never know when they are here,\" said Ilda, the bar's manager. \"I just read about it in the newspaper.\" Unsurprisingly, the main chatter in the bar has revolved around who will be elected pope. \"I think it should be someone who embraces everyone,\" said Ilda. Vincenzo Aru, a building concierge who works nearby, is a lapsed Catholic and therefore indifferent. \"I'm just happy they've cleaned the streets,\" he said. \"The only time that happens around here is when a pope dies.\"",
      "ml_hf_summary": "The upcoming papal conclave in Rome will begin on May 7th, with approximately 180 cardinals from around the world gathering to elect a new leader of the Catholic Church.  Among those attending are 133 eligible voters, many of whom were appointed by Pope Francis and represent diverse geographical backgrounds. The cardinals will be sequestered at Casa Santa Marta and the Sistine Chapel during the conclave. While they are expected to maintain silence before meetings, informal discussions and potential leaks occur in restaurants like Al Passetto di Borgo and Marcantonio, where cardinals gather for meals and strategy sessions.  The selection process is shrouded in secrecy, with rumors circulating about potential contenders such as Fernando Filoni, Luis Antonio Tagle, and Donald Wuerl. The conclave's outcome will be determined by the cardinals' votes, which are expected to take place within the Sistine Chapel. \n"
    },
    {
      "title": "Scottish ministers drop plans to outlaw misogyny and conversion practices",
      "link": "https://www.theguardian.com/world/2025/may/02/scottish-ministers-drop-plans-outlaw-misogyny-conversion-practices",
      "published": "2025-05-02",
      "summary": "Government says measures are too legally complex to deliver before the next Holyrood election",
      "content": "The Scottish government has dropped plans to outlaw misogyny and conversion practices before the next Holyrood election, arguing they are too legally complex to deliver in time. Ministers had long promised a bill to criminalise misogyny after Nicola Sturgeon, the then first minister, accepted recommendations from a working group led by the lawyer and human rights expert Helena Kennedy in 2022. Lady Kennedy said a standalone bill was essential because of the seriousness and complexity of the issue, which spanned sexual violence, hatred, gender-based threats of violence online and \"incel\" culture. Jamie Hepburn, the minister for parliamentary business, said on Friday the Scottish government would instead insert anti-misogyny measures into Scotland's Hate Crime and Public Order Act via secondary legislation - an approach Kennedy said in 2022 failed to grasp the significance of the issue. Women's rights campaigners said this was \"devastating news\" but Hepburn said the recent UK supreme court decision on the definition of woman had added to the legal challenges. \"This is a complex area of policy and law, and it would be necessary that any bill which brought misogyny into criminal law contained clear and unambiguous provisions in regard to the circumstances in which they apply,\" he told MSPs. Sandy Brindley, the chief executive of Rape Crisis Scotland, said those issues should have been resolved by now. \"At a time when women and girls are facing unprecedented levels of misogyny, it's unbelievable that the government is dropping this landmark bill.\" Hepburn also confirmed the devolved government had scrapped its plans to ban conversion practices via stand-alone Scottish legislation, dropping another of Sturgeon's pledges when she struck a power-sharing agreement with the Scottish Green party in 2021. Instead, the Scottish National party government has deferred to the UK government, and will work with UK ministers on agreeing Westminster-led legislation that would include Scottish measures. Kaukab Stewart, the equalities minister, said if those talks failed or were not trans-inclusive, then ministers in Edinburgh would consider introducing their own bill after next year's Holyrood elections. Both decisions signalled another significant shift by the Scottish government under John Swinney's leadership away from Sturgeon's rights-focused policy agenda, as the SNP drifts towards safer, centrist territory. Campaigners against conversion practices reacted furiously. \"This is the latest in a growing list of betrayals for LGBTQ+ Scots from this Scottish government. Scotland could have banned conversion therapy years ago,\" said a spokesperson for End Conversion Therapy Scotland. \"LGBTQ+ rights are under attack right now, in a way we haven't seen since Thatcher's section 28 ban on 'promoting homosexuality'. Queer people are crying out for some solidarity from politicians. Instead, this news is a stab in the back.\" Stewart said: \"Scotland remains absolute in our commitment to equality, the rights of the LGBTQI+ community, and ending conversion practices. \"These recent weeks have been challenging for our LGBTQI+ communities and we want you to know we stand with you and we will work tirelessly to ban conversion practices once and for all.\" Kennedy argued that hate crime legislation was the wrong vehicle for misogyny criminalisation because women were not a minority group, which hate crime protections were designed for. \"Misogyny is so deeply rooted in our patriarchal ecosystem that it requires a more fundamental set of responses,\" the working group report concluded. The police and courts needed much clearer legislation, centred on women, to guide them, it said.",
      "ml_hf_summary": "The Scottish government has withdrawn plans to outlaw misogyny and ban conversion practices before the next Holyrood election.  Ministers cited legal complexity as the reason for dropping these initiatives, despite previous commitments from former First Minister Nicola Sturgeon. The Scottish government will instead incorporate anti-misogyny measures into Scotland's Hate Crime and Public Order Act via secondary legislation. This decision was met with criticism from women's rights campaigners who argue it is a missed opportunity to address the issue of misogyny.  The Scottish government plans to work with UK ministers on implementing Westminster-led legislation that would include Scottish measures, while also stating their commitment to ending conversion practices. \n"
    },
    {
      "title": "Six Deadly Minutes: How Israeli Soldiers Killed 15 Rescue Workers in Gaza",
      "link": "https://www.nytimes.com/video/world/middleeast/100000010140613/israel-gaza-medics-attack-idf.html",
      "published": "2025-05-02",
      "summary": "Israel’s military said it was reacting to an immediate threat when it killed 15 medics and first responders in Gaza in March. But eyewitness accounts and an analysis of videos, audio and autopsy reports show that multiple soldiers fired over the course of six minutes at unarmed emergency workers who never posed a threat.",
      "content": "It's almost 5 a.m. on March 23 in Rafah, southern Gaza. Two Red Crescent medics are out searching for a missing ambulance crew. Driving is Asaad al-Nasasra and sitting beside him and filming is Rifaat Radwan. Both have worked with the Red Crescent for years. Rifaat worries their missing colleagues have come under attack. They haven't heard from them for an hour. They will soon discover that Israeli soldiers have fired on the crew, killing two of them. Before long, Rifaat will also be killed along with 12 other staff from the Red Crescent, Civil Defense and the United Nations. The New York Times obtained Rifaat's footage and reconstructed moment by moment how this unprovoked attack unfolded. We synchronized his video with another phone recording from the scene. We reviewed autopsy reports and photos of the bodies and we interviewed eyewitnesses. Our investigation shows how Israeli soldiers fired repeatedly on unarmed medics, closed in around them and continued shooting for more than six minutes, even as several of the crew were still alive, wearing their uniforms and praying. Investigating itself, the I.D.F. has said there were professional failures and dismissed the deputy commander who was involved. But independent experts say that to knowingly attack medics is a breach of the laws of war. Days before the attack, Israel had broken the cease-fire in Gaza with intense airstrikes after negotiations with Hamas to release hostages broke down. Ground forces had moved into Rafah, and on the night in question, the I.D.F. says it set up an ambush on this road ahead of an evacuation order to flush out suspected militants when people moved. Red Crescent crews were working overnight to rescue casualties from a nearby airstrike. But when one crew goes missing, others, including Asaad and Rifaat, are sent out to find them. In the darkness, they initially don't see the missing ambulance. It had been passing by here just an hour earlier when the Israeli unit opened fire on it. They killed the two medics sitting in the front, Ezz al-Deen Shath and Mustafa Khafaja, and detained a third medic, Munther Abed, who survived. He told us what happened. Munther told us he was stripped and beaten. The I.D.F. said it thought the ambulance was a Hamas vehicle, and has long contended that Hamas uses ambulances to transport weapons and fighters. Back on the road, Rifaat and Asaad pass the Israeli soldiers without incident and meet up with other medics who were also out searching. Saleh Muammar, who was driving the other ambulance, says he spotted bodies on the ground. They ready the ambulances to return, but Saleh worries they will be attacked if they move ahead without more vehicles. A Civil Defense ambulance and fire engine joined them. And they continue on as a convoy. Overhead, an Israeli drone is watching them. The I.D.F. later said that a drone operator told soldiers on the ground the convoy was advancing suspiciously, but they are clearly marked as emergency services. And the vehicles are flashing their lights, which soldiers could see, the I.D.F. later told us. The medics pull in. Around 20 I.D.F. soldiers are positioned here, 100 feet off the roadside. Almost all of the first responders are clearly marked in reflective gear. They are unarmed and moving away from the I.D.F. Rifaat sees his colleagues bodies. As they rush to rescue them, they're met by a hail of gunfire. [gunshots] Rifaat scrambles to the driver's side and is shielded for now by the ambulance. He begins to pray. In total, Rifaat films almost six minutes of gunfire. We produced a condensed timeline that gives an insight into the I.D.F.'s actions. After the first barrage comes a 20-second pause. Rifaat repeats the Shahada -- a declaration of faith that Muslims also say as they face death. An ambulance tries to escape. But another hail of gunfire erupts. We hear continuous single shots. Then automatic fire. Another pause. First responders can be heard screaming. Then another barrage from multiple rifles. None of these medics are armed, and all of the fire is coming from the I.D.F. A long pause, Rifaat asks his mother's forgiveness. Steady gunfire, closer to Rifaat, now, for the full minute. An ambulance is shot at. Medics were still inside some of the vehicles. One of them, Ashraf Abu Labda -- phones a Red Crescent dispatcher who records the call. We synchronized Ashraf's call with Rifaat's video to better understand what they both were seeing. Israeli soldiers appear to approach, shouting in Hebrew, but it's unclear what they're saying. Both Ashraf and Rifaat see them around the same time. From Ashraf's phone call, slow, deliberate shots are heard now. An Israeli soldier orders his troops. Ashraf hangs up. Amid the emergency vehicles, Rifaat's phone is positioned here. Three audio experts who analyzed his recording determined that the soldiers begin shooting up to 150 feet away. This aligns with where witnesses saw the I.D.F. positioned and where it built sand barricades. As the shooting continues, the gunfire closes in to within 60, 50 and then 40 feet of Rifaat by Minute 6 of the attack. Drone footage the I.D.F. showed The Times confirms that the soldiers moved in. Rifaat was still alive at this time. He was shot multiple times, his autopsy showed. And inside this ambulance, Ashraf was also alive. He was shot in the chest. A witness with a clear view of what happened, Saeed al-Bardawil, a civilian who was detained and held with the I.D.F. troops before the attack on the convoy. Saeed says that I.D.F. reinforcements later came, and then soldiers shot first responders as they lay on the ground. Minutes after the shooting, a clearly marked United Nations vehicle happened on the scene. The I.D.F. fired on it too, killing Kamal Shahtout, a U.N. employee who was on his way to rescue colleagues injured in another attack. Saeed says he saw the I.D.F. then bury both the bodies and vehicles. The I.D.F. said this was not done to conceal the attack, but in The Times's experience of reporting on its actions in Gaza, burying bodies and vehicles is not something the I.D.F. normally does. Crushing the vehicles was an operational error, the I.D.F. told us. \"Why did you hide the bodies? Why and why? They have to answer for that.\" Younis Al-Khatib, the head of the Red Crescent, told us that for the next five days he begged the I.D.F. for information on the whereabouts of their missing staff. But the I.D.F. wouldn't answer. Finally, the U.N., Red Crescent and Civil Defense got access to the site. It took two days to recover the medics' bodies and vehicles. The Times reviewed autopsies and photographs of the bodies, which showed that most of the victims died from multiple gunshot wounds, including to the neck and torso. Three of the Civil Defense team were shot in the head. A Civil Defense helmet found there showed apparent bullet holes. Two bodies were missing, limbs, possibly shorn by the bulldozers burying them, and almost all of the Red Crescent and Civil Defense were wearing their uniforms in part or in whole. Since the attack, Israel has given shifting versions of events that the evidence contradicts. It initially said the medics were advancing suspiciously, but they never posed a threat. It said that the vehicles were without headlights or emergency signals, but changed that story two weeks later when The Times published Rifaat's video. It said the area was a combat zone. It wasn't until the I.D.F. declared it so hours after the attack. It named and said it killed a Hamas participant in Oct. 7. His family told us he's alive in Gaza and he has no connection to the Red Crescent or Civil Defense. And it took weeks for the I.D.F. to admit it was detaining Asaad al-Nasasra, the medic driving alongside Rifaat, who survived. He was released after 37 days, having been denied access to a lawyer and his family. The I.D.F. has now released the results of its own investigation. It says there was a series of operational misunderstandings that started with misidentifying the first ambulance as a Hamas vehicle, and believing the convoy were Hamas reinforcements. It said Hamas has previously used ambulances. It said the deputy battalion commander, the most senior officer present, was the first to open fire on the convoy. He has been dismissed. But once the shooting started, the other soldiers followed procedure, the I.D.F. told us, even as they fired for six minutes unchallenged. Experts in the laws of war, including Janina Dill of Oxford University, told us that attacking medics who pose no threat is a likely war crime. Another expert, who has long studied attacks on health care, says this is not an isolated incident. \"This incident was part of a much larger pattern where U.N. convoys, Doctors Without Borders, ambulances, humanitarian vehicles, have all been shot at multiple times with many people killed and injured.\" The I.D.F. is satisfied that nothing needs to change in its orders to soldiers, which it described as excellent. The soldiers involved in this attack were from the Golani Brigade's elite reconnaissance unit. A recent speech made by a commander of that brigade is an example of the types of orders those soldiers may receive. Even after 50,000 people have been killed in Gaza, this attack drew international condemnation. The agencies the slain medics worked for rejected the I.D.F.'s findings, and have called for an independent investigation.",
      "ml_hf_summary": "This is a very detailed account of a tragic incident involving Israeli forces attacking a convoy of medical personnel in Gaza. Here's a breakdown of the key points:\n\n**The Incident:**\n\n* **Target:** A convoy carrying medics from the Red Crescent, Civil Defense, and Doctors Without Borders was attacked by Israeli forces.\n* **Location:** The attack took place in Gaza, where tensions between Israel and Palestine are high. \n* **Victims:**  A total of 10 people were killed, including:\n    * Rifaat al-Nasasra (medic)\n    * Kamal Shahtout (UN employee)\n    * Saeed al-Bardawil (civilian detained by I.D.F.)\n    * Several others from the Red Crescent and Civil Defense \n* **Details:** The attack involved a series of misidentifications, with the Israeli forces initially believing the convoy was a Hamas operation.  The attack lasted for six minutes before being stopped.\n\n**Aftermath:**\n\n* **I.D.F.'s Response:** The I.D.F. has released an internal investigation report claiming operational misunderstandings led to the attack. They have dismissed the battalion commander who initiated the firing, but maintain that their soldiers acted within protocol.\n* **International Condemnation:**  The incident has drawn international condemnation, with various agencies and organizations calling for an independent investigation into the events. \n* **Humanitarian Organizations' Response:** The Red Crescent, Civil Defense, and Doctors Without Borders have rejected the I.D.F.'s findings, demanding a thorough and impartial investigation.\n\n**Key Issues Raised:**\n\n* **Targeting of Medical Personnel:**  The attack highlights the dangerous reality for medical personnel working in conflict zones. \n* **Laws of War:** The incident raises questions about whether the Israeli forces' actions violated international law by targeting unarmed medical workers. \n* **Misidentification and Escalation:** The incident underscores the importance of clear communication, de-escalation tactics, and avoiding unnecessary escalation during conflicts.\n\n\n**Overall:**\n\nThis account provides a detailed look at a tragic event that highlights the dangers faced by humanitarian workers in conflict zones. It raises important questions about international law, military protocols, and the need for accountability in such situations. \n"
    },
    {
      "title": "South Korea Lurches From One Political Crisis to Another",
      "link": "https://www.nytimes.com/2025/05/02/world/asia/south-koreas-political-crisis.html",
      "published": "2025-05-02",
      "summary": "In five months, the country has had three acting presidents after the leader who imposed martial law was impeached. And now doubts cloud the coming election.",
      "content": "South Korea has become a case study in how a thriving democracy can suddenly spiral into a constitutional crisis, and there's no end in sight. \n For the past five months, the country has been run by three different acting presidents after its elected leader was impeached and removed for abruptly declaring martial law late last year. \n But as the country prepares to elect a new president on June 3, citizens hoping to see stability face more uncertainty. There are already doubts over whether the front-runner, Lee Jae-myung of the Democratic Party, will be legally allowed to run -- or to finish his term if he wins. \n Adding to that, Han Duck-soo, who stepped down as prime minister and acting president on Thursday, declared a presidential bid on Friday. But he needs to secure the support of the People Power Party to have a chance of success, and that party is currently considering its own candidate.",
      "ml_hf_summary": "South Korea has been experiencing a constitutional crisis since its elected leader was impeached and removed for declaring martial law.  The country has had three acting presidents in the past five months. The upcoming presidential election on June 3rd brings further uncertainty, as doubts exist about whether Lee Jae-myung of the Democratic Party will be allowed to run or complete his term if he wins. Han Duck-soo, who stepped down as prime minister and acting president, declared a presidential bid but needs support from the People Power Party to succeed. The party is currently considering its own candidate. \n"
    },
    {
      "title": "The Frightening Precedents for Trump’s ‘Legal Abyss’",
      "link": "https://www.nytimes.com/2025/05/03/world/trump-dual-state.html",
      "published": "2025-05-03",
      "summary": "The ‘dual-state theory’ explains how authoritarians bend the law to their will.",
      "content": "\"Oopsie ... Too late,\" President Nayib Bukele of El Salvador wrote on X with a cry-laughing emoji on March 16. Below it was a screenshot of a headline: \"Fed judge orders deportation flights carrying alleged gangbangers to return to US, blocks Trump from invoking Alien Enemies Act.\" \n Despite the court order, federal officials had neither prevented the takeoff of the deportation flight that was still on the ground at the time of the court's order, nor turned around the two other planes that were already in the air. After news broke that the men were now in El Salvador, imprisoned in the notorious complex known by its Spanish acronym CECOT, Mr. Bukele's mocking tweet made clear that he considered the deportees beyond the reach of U.S. courts. \n The Trump administration has taken a similar position, albeit with fewer emojis. \"Federal courts generally have no jurisdiction over the president's conduct of foreign affairs, his authorities under the Alien Enemies Act, and his core Article II powers to remove foreign alien terrorists from U.S. soil and repel a declared invasion,\" Karoline Leavitt, the White House press secretary, said in a statement on March 17. \n Since then, the administration has grown even more defiant. This week, when asked about the case of Kilmar Abrego Garcia, a Salvadoran immigrant and Maryland father of three who was deported from Maryland to CECOT as a result of \"administrative error,\" Mr. Trump told a reporter that he has the power to free Mr. Abrego Garcia but won't do so -- despite a Supreme Court order to \"facilitate\" his release.",
      "ml_hf_summary": "On March 16th, President Nayib Bukele of El Salvador tweeted \"Oopsie… Too late\" after deportation flights carrying alleged gang members were ordered back to the US by a federal judge. Despite the court order, the planes had already departed and remained in El Salvador, impeding the US's ability to enforce the court's decision. The Trump administration has defended its position, stating that federal courts do not have jurisdiction over the president's foreign affairs actions or removal of \"alien terrorists\" from US soil.  President Trump further asserted his authority to release individuals despite a Supreme Court order to facilitate their release. \n"
    },
    {
      "title": "There’s Never Been a Pope From the U.S. Could Cardinal Prevost Change That?",
      "link": "https://www.nytimes.com/2025/05/02/world/americas/pope-candidate-cardinal-robert-francis-prevost.html",
      "published": "2025-05-02",
      "summary": "Cardinal Robert Francis Prevost, a native of Chicago, has spent the bulk of his career outside the United States. Supporters say he represents a “dignified middle of the road.”",
      "content": "The cardinal resembles Francis in his commitment to the poor and migrants and to meeting people where they are. He told the Vatican's official news website last year that \"the bishop is not supposed to be a little prince sitting in his kingdom.\" Rather, he said, a church leader is \"called authentically to be humble, to be close to the people he serves, to walk with them, to suffer with them.\" \n Cardinal Prevost, appointed by Francis in 2023 to run the Vatican office that selects and manages bishops globally, has spent much of his life outside the United States. Ordained in 1982 at age 27, he received a doctorate in canon law at the Pontifical University of St. Thomas Aquinas in Rome. In Peru, he was a missionary, parish priest, teacher and bishop. As the Augustinians' leader, he visited orders around the world, and speaks Spanish and Italian. \n The cardinal understands that the center of the Roman Catholic Church \"is not in the United States or the North Atlantic,\" said Raul E. Zegarra, assistant professor of Catholic theological studies at Harvard Divinity School. \n Given Cardinal Prevost's international experience, knowledge of the United States and work inside the Vatican hierarchy, said Marco Politi, a veteran Vatican analyst in Rome, \"if he were not American, this would make him automatically a papabile, certainly.\" \n Cardinal Prevost, who is often described as reserved and discreet, would depart stylistically from Francis, who until his death last month drew roaring crowds and stopped to bless a baby against his doctors' advice.",
      "ml_hf_summary": "Cardinal Prevost was appointed in 2023 by Pope Francis to head the Vatican office responsible for selecting and managing bishops globally.  He has extensive international experience, having served as a missionary, parish priest, teacher, and bishop in Peru before joining the Vatican hierarchy. Cardinal Prevost's background and expertise make him a potential candidate for future papal succession, given his global perspective and knowledge of both the United States and the Vatican. His reserved demeanor contrasts with Pope Francis' more public and charismatic style. \n"
    },
    {
      "title": "These Contentious Issues Could Determine Who Becomes the Next Pope",
      "link": "https://www.nytimes.com/2025/05/03/world/europe/pope-conclave-contentious-issues.html",
      "published": "2025-05-03",
      "summary": "As cardinals gather to elect Pope Francis’ successor, they are facing debates over whether the church most needs change or constancy.",
      "content": "The cardinals who have traveled to Rome to elect the next pope at a conclave next week sometimes look as ideologically polarized as many secular voters around the globe. \n At first glance, they appear to split along the kinds of left-right lines that characterize political contests elsewhere. Many conservative Roman Catholic Church leaders disagreed with Pope Francis, who was often a darling of liberals around the world. \n But the typical divisions between progressives and conservatives don't correspond so neatly with the ideological battles within the Vatican and the broader church. Although there are some exceptions among the cardinals, the issue that most consistently marked Francis as a liberal -- his fierce advocacy on behalf of migrants and the poor -- does not necessarily set him apart, because the Catholic Church has made the gospel's call to shelter and feed strangers a fundamental tenet. \n Ultimately, the cardinals' choice will amount to a referendum on whether to extend Francis' legacy of inclusivity and openness to change. That was \"how he made sense of living in a highly polarized age,\" said Anna Rowlands, a political theologian at Durham University in England.",
      "ml_hf_summary": "The upcoming papal conclave in Rome will see cardinals elect the next pope, with some exhibiting ideological polarization similar to global political divides. While there are traditional left-right divisions within the Catholic Church, Pope Francis' advocacy for migrants and the poor is not a clear indicator of his ideology as it aligns with the church's fundamental tenet of caring for the needy. The cardinals' choice will ultimately determine whether to continue Francis' legacy of inclusivity and openness to change.  The conclave begins next week, and its outcome will be significant in shaping the future direction of the Catholic Church. \n"
    },
    {
      "title": "Trump Labels Haiti’s Powerful Gangs Terrorists",
      "link": "https://www.nytimes.com/2025/05/02/world/americas/trump-haiti-gangs-terrorists.html",
      "published": "2025-05-03",
      "summary": "The move will enable harsh sanctions on the gangs, which control important sectors of the country’s economy, and anybody who does business with them.",
      "content": "A powerful alliance of armed gangs that has plunged Haiti into violence and launched attacks against state institutions was designated on Friday as a terrorist group by the Trump administration. \n The move is likely to worsen an already dire humanitarian crisis in Haiti, experts said, since gangs control much of the country's economy and infrastructure, including ports and major roads, and extort businesses and the local population. \n President Trump's designation gives the U.S. broad power to impose economic penalties on the criminal groups, and potentially even to take military action. But it also allows sanctions to be imposed on anyone the United States accuses of having dealings with the gangs. \n \"The age of impunity for those supporting violence in Haiti is over,'' Secretary of State Marco Rubio said in a social media post.",
      "ml_hf_summary": "On Friday, the Trump administration designated a powerful alliance of armed gangs operating in Haiti as a terrorist group. This designation grants the U.S. broad authority to impose economic sanctions and potentially even military action against the gangs. The gangs control significant portions of Haiti's economy and infrastructure, including ports and major roads, and extort businesses and the local population.  The move is expected to exacerbate the already dire humanitarian crisis in Haiti. \n"
    },
    {
      "title": "Two Scientific Groups Say They’ll Keep Working on U.S. Climate Assessment",
      "link": "https://www.nytimes.com/2025/05/02/climate/national-climate-assessment-trump.html",
      "published": "2025-05-02",
      "summary": "The organizations said they would publish researchers’ work even after the Trump administration decision to dismiss all authors on the project.",
      "content": "Major science groups said Friday that they would publish work for the country's flagship report on climate change, a project that the Trump administration threw into limbo by dismissing hundreds of scientists who had been working on it. \n The American Geophysical Union and the American Meteorological Society said they would publish work originally meant for the assessment in their journals, should the authors choose to do so. \n \"It's incumbent on us to ensure our communities, our neighbors, our children are all protected and prepared for the mounting risks of climate change,\" Brandon Jones, the president of the union and a program director with the National Science Foundation, said in the statement. \"This collaboration provides a critical pathway for a wide range of researchers to come together and provide the science needed to support the global enterprise pursuing solutions to climate change.\" \n The National Climate Assessment is a comprehensive review of the latest climate science that gauges how climate change is affecting the country and what can be done to adapt and mitigate its effects. There have been five published since 2000. The sixth edition was scheduled to be published in early 2028.",
      "ml_hf_summary": "Major science groups, including the American Geophysical Union and the American Meteorological Society, will publish climate change research originally intended for the National Climate Assessment (NCA). This decision follows the Trump administration's dismissal of hundreds of scientists working on the assessment. The NCA is a comprehensive review of climate science that assesses the impact of climate change on the United States and provides recommendations for adaptation and mitigation strategies.  The sixth edition, scheduled to be published in early 2028, was delayed by the Trump administration's actions. \n"
    },
    {
      "title": "U.S. and China Dig In on Trade War, With No Plans for Formal Talks",
      "link": "https://www.nytimes.com/2025/05/02/us/politics/us-china-trade-tariffs-talks.html",
      "published": "2025-05-02",
      "summary": "The standoff over terms of negotiations, and whether they are happening, signals that a protracted economic fight lies ahead.",
      "content": "Mr. Allen, who until recently was the president of the U.S.-China Business Council, suggested that China was most likely mindful of the acrimonious meeting that Mr. Trump had with President Volodymyr Zelensky of Ukraine in February and that Mr. Xi would be wary of a situation that could lead to a public confrontation with Mr. Trump. \n During the Biden administration, Treasury Department officials worked with China to create economic and financial working groups of midlevel staff members that were intended to prevent tensions over tariffs and export controls from spiraling out of control. Those lines of communication do not appear to be in use in the Trump administration, which tends to view them as a waste of time. \n \"That is exactly the kind of thing that these groups can help do -- help make sure that the policy you deploy is well tailored to achieve the objective and communicates to the other side what you're trying to achieve before it's too late and you instead have to react to potentially unintended consequences or a message that was not intended to be transmitted,\" said Brent Neiman, a University of Chicago professor who was the Treasury's deputy under secretary for international finance during the Biden administration. \n During Mr. Trump's first term, the president initially assigned the Treasury secretary at the time, Steven T. Mnuchin, to lead trade delegations to China. He later appointed Robert E. Lighthizer, his trade representative, who was viewed as more hawkish, to oversee the talks. \n Veterans of that trade war believe the current deadlock could be more protracted because the tariffs are higher and both sides believe they are winning. If U.S. growth continues to slow while prices start to rise, it could add to the urgency for Mr. Trump to get real talks with China going.",
      "ml_hf_summary": "Mr. Allen suggests that Xi Jinping is cautious about escalating tensions with Trump due to the February meeting between Trump and Zelensky. During the Biden administration, Treasury Department officials established working groups with China to prevent tariff and export control disputes from escalating. However, this communication channel was not utilized during the Trump administration, which prefers a more reactive approach.  Trump's trade delegations were led by Mnuchin and later Lighthizer, who favored a more aggressive stance. The current deadlock in trade relations is likely to be prolonged due to higher tariffs and both sides believing they are winning. \n"
    },
    {
      "title": "U.S. Moves to Blacklist Huione Group Over Money Laundering Ties",
      "link": "https://www.nytimes.com/2025/05/02/world/asia/treasury-huione-scammer-money-laundering-blacklist.html",
      "published": "2025-05-02",
      "summary": "The Treasury Department said Huione Group and its affiliates had laundered more than $4 billion.",
      "content": "The Trump administration designated a Cambodian financial conglomerate as a money-laundering operation on Thursday, taking the first step to sever its access to the American financial system. \n The Treasury Department said that since August 2021, the company, Huione Group, and its affiliates had laundered $4 billion for criminals, including hackers in North Korea and scammers in Southeast Asia. \n \"Huione Group serves as a significant node of the money laundering ecosystem,\" the Treasury said in a detailed report of the company's operations. \n A New York Times investigation in March found that Huione's group of companies were at the heart of a global money laundering network. Online scammers, who defraud victims with bogus investments or other schemes, rely on Huione and its affiliates to move money overseas while evading law enforcement authorities and banks' anti-laundering departments.",
      "ml_hf_summary": "The Trump administration designated the Cambodian financial conglomerate Huione Group as a money-laundering operation. The Treasury Department stated that since August 2021, Huione Group and its affiliates have laundered $4 billion for criminals, including hackers in North Korea and scammers in Southeast Asia.  Huione's operations are described as a significant node within the global money laundering ecosystem. A New York Times investigation revealed that Huione's group of companies facilitate money laundering for online scammers who defraud victims through bogus investments or other schemes. \n"
    },
    {
      "title": "Universal Antivenom May Grow Out of Man Who Let Snakes Bite Him 200 Times",
      "link": "https://www.nytimes.com/2025/05/02/health/snakes-universal-antivenom-tim-friede.html",
      "published": "2025-05-02",
      "summary": "Scientists identified antibodies that neutralized the poison in whole or in part from the bites of cobras, mambas and other deadly species.",
      "content": "The video is just under two and a half minutes long. A slim man with close-cropped hair walks into a room, pulls a long black mamba -- whose venom can kill within an hour -- from a crate and allows it to bite his left arm. Immediately after, he lets a taipan from Papua New Guinea bite his right arm. \"Thanks for watching,\" he calmly tells the camera, his left arm bleeding, and then exits. \n Over nearly 18 years, the man, Tim Friede, 57, injected himself with more than 650 carefully calibrated, escalating doses of venom to build his immunity to 16 deadly snake species. He also allowed the snakes -- mostly one at a time, but sometimes two, as in the video -- to sink their sharp fangs into him about 200 times. \n This bit of daredevilry (one name for it) may now help to solve a dire global health problem. More than 600 species of venomous snakes roam the earth, biting as many as 2.7 million people, killing about 120,000 people and maiming 400,000 others -- numbers thought to be vast underestimates. \n In Mr. Friede's blood, scientists say they have identified antibodies that are capable of neutralizing the venom of multiple snake species, a step toward creating a universal antivenom, they reported on Friday in the journal Cell.",
      "ml_hf_summary": "Tim Friede, a 57-year-old man, injected himself with over 650 doses of venom from various venomous snakes for nearly 18 years to build immunity.  He allowed snakes to bite him approximately 200 times, mostly one at a time, and the video shows this process. Friede's blood contains antibodies that can neutralize the venom of multiple snake species, according to scientists who published their findings in the journal Cell. This discovery could lead to the development of a universal antivenom for venomous snake bites, which affect millions globally. \n"
    },
    {
      "title": "What Australia’s Vote Means for Climate in a Major Coal Economy",
      "link": "https://www.nytimes.com/2025/05/02/climate/australia-election-climate-change-coal.html",
      "published": "2025-05-02",
      "summary": "The leading candidates in Saturday’s national election have starkly different policies on energy and global warming.",
      "content": "Few voters have as much power over climate change as an Australian citizen. \n Among democracies, only the United States and Canada come close to Australia in terms of per capita greenhouse gas emissions. The country is also one of the world's biggest exporters of planet-warming fossil fuels, selling coal, the most polluting fossil fuel, as well as natural gas, in vast quantities to Asian countries. \n When the country holds national elections on Saturday, polls indicate that climate change won't be top of mind for many. But the leading candidates, from the Labor Party and the Liberal-National Coalition, have starkly different climate and energy policies. \n Front and center is the country's reliance on an aging fleet of coal plants to generate its electricity. \n \"Even if it weren't for climate change, that fleet needs to be retired,\" said Andrew Macintosh, a professor of environmental law and policy at the Australian National University. \"On one side you have Labor, which is proposing to keep ramping up renewables, and on the other you have a conservative coalition pushing nuclear.\"",
      "ml_hf_summary": "Australia holds national elections on Saturday with climate change policies being a key point of contention between the leading candidates.  The country's per capita greenhouse gas emissions are among the highest in democracies, alongside the US and Canada, while it is also a major exporter of fossil fuels, particularly coal and natural gas. The Labor Party advocates for increased renewable energy sources, while the Liberal-National Coalition proposes nuclear power as part of their energy strategy.  The reliance on aging coal plants for electricity generation is a significant factor in the debate, with experts arguing that these plants should be retired regardless of climate change concerns. \n"
    },
    {
      "title": "What Will Happen to Australia’s Housing Market After the Election",
      "link": "https://www.nytimes.com/2025/05/02/world/australia/australia-election-housing.html",
      "published": "2025-05-02",
      "summary": "Going into a federal election, both major parties are hesitant to tame the sky-high property values that have priced many voters out of the housing market.",
      "content": "Marcus Neil bought his first home, on the outskirts of Brisbane, Australia, in his late teens with little money and financial know-how but a strong sense that he was working toward future stability. Decades later, he owns four investment properties, which he hopes will be his safety net when he retires. \n \"I just see it as a really, really safe bet,\" said Mr. Neil, 53. \n He has been on the money. Australia is now one of the most expensive places in the world to own a home. \n But the sky-high values have priced many people out of the housing market and caused an affordability crisis, particularly for younger Australians. They have been exasperated by statistics like the one that shows the typical Australian home costs about eight times the median income -- making it a more expensive real estate market than New York's. These citizens have a chance to demand change on Saturday, when Australians head to the voting booth. \n For the first time here, millennials and Gen Z voters will outnumber baby boomers in a federal election. But it is unclear to what extent this demographic change will sway results. Recent polls indicate Prime Minister Anthony Albanese is likely to win re-election. The opposition leader, Peter Dutton, whose campaign took cues from President Trump, has seen his support fall as Mr. Trump's policies have unleashed global tumult.",
      "ml_hf_summary": "Marcus Neil purchased his first home in Australia at a young age, investing in property that he hopes will provide financial security during retirement.  Australia's housing market is currently one of the most expensive globally, with home prices exceeding eight times the median income. This has created an affordability crisis for younger generations, who are facing challenges entering the market. The upcoming federal election in Australia will see millennials and Gen Z voters surpass baby boomers in voting power, but their impact on the outcome remains unclear.  Prime Minister Anthony Albanese is expected to win re-election, while opposition leader Peter Dutton's campaign has been influenced by President Trump's policies amidst global economic uncertainty. \n"
    },
    {
      "title": "Who Is Cardinal Matteo Zuppi, a Possible Contender for the Next Pope?",
      "link": "https://www.nytimes.com/2025/05/02/world/europe/matteo-zuppi-pope-bologna.html",
      "published": "2025-05-02",
      "summary": "A possible contender for the papacy, Cardinal Matteo Zuppi has worked with the needy and the disenfranchised, even as he participated in peace talks around the world.",
      "content": "When the Archbishop of Bologna, Matteo Zuppi, was made a cardinal on Oct. 5, 2019, his day ended with a Mass celebrated outside the Basilica of Santa Maria in Trastevere, the Rome neighborhood where he found direction as a teenager and later served as a priest. \n \"My life, or rather life itself, is always made up of so many pieces that have shaped us and are part of me,\" Cardinal Zuppi, now 69, said during his homily that evening. \"Today I can see, and I believe we all see it, the joy of being together as a piece of our common life, exactly the opposite of individualism.\" \n Many of those gathered to wish him well during that Mass knew him from his days as a teenage volunteer for the Community of Sant'Egidio, a Catholic charity known for working with the poor, for interreligious dialogue and for mediating international conflicts. \n After he became a priest, he went on to become a vicar at the basilica and for years, he was a spiritual leader of the Community of Sant'Egidio, which prays at Santa Maria in Trastevere.",
      "ml_hf_summary": "On October 5, 2019, Cardinal Matteo Zuppi was made a cardinal.  He celebrated Mass outside the Basilica of Santa Maria in Trastevere, Rome, where he found direction as a teenager and later served as a priest.  Cardinal Zuppi's homily emphasized the importance of community and shared life, reflecting his long involvement with the Community of Sant’Egidio, a Catholic charity known for its work with the poor, interreligious dialogue, and international conflict mediation.  He was a vicar at the basilica and spiritual leader of the Community of Sant’Egidio for many years. \n"
    },
    {
      "title": "Why Donald Trump Looms Over Australia’s Election",
      "link": "https://www.nytimes.com/2025/05/02/world/asia/australia-election-trump-china.html",
      "published": "2025-05-02",
      "summary": "The last time Australians went to the polls, China was top of mind. This time, the United States is the dominant foreign factor in an election mostly fought on domestic issues.",
      "content": "A superpower loomed large as Australians headed to the polls. It wielded trade barriers as a means of political coercion, imperiling Australia's export-dependent economy. \n Three years ago that country was China, which had imposed punishing restrictions on many Australian exports, sent spy ships lurking near Australia's west coast and struck an alarming military pact with a regional neighbor, the Solomon Islands. \n This time, as Australians cast ballots on Saturday, that external factor is the United States and President Trump. \n \"We've forgotten that China was introducing tariffs on Australian goods. What's the difference, with what Trump is doing?\" said Scott Prasser, a public policy analyst and a former civil servant.",
      "ml_hf_summary": "Australia held elections on Saturday, with the US's actions under President Trump being a significant factor in the political landscape.  China imposed trade barriers on Australian exports three years ago, including military agreements with the Solomon Islands. This situation mirrors the current political climate as voters consider the impact of US policies on Australia's economy and international relations. Scott Prasser, a public policy analyst, highlights the similarity between China's actions and Trump's policies in terms of their potential to disrupt trade and influence foreign policy. \n"
    }
  ]
}