{
  "news": [
    {
      "title": "Who Is Attending Pope Francis’ Funeral? Guests Include Trump, Prince William and More",
      "link": "https://www.nytimes.com/2025/04/22/world/europe/pope-francis-funeral-guests.html",
      "published": "2025-04-23",
      "summary": "Pope Francis’ funeral on Saturday will bring together leaders who sometimes clashed with the pope on issues such as global migration.",
      "content": "Presidents, prime ministers and royalty are preparing to travel to Rome for Pope Francis' funeral, which will be the most prominent gathering of world leaders since President Trump's inauguration in January. \n The funeral on Saturday will cap almost a week of mourning for Francis, whose advocacy for migrants, the poor, the marginalized and those suffering under war often put him directly at odds with some of the powerful people who will pay their respects to him inside St. Peter's Basilica. \n Francis had openly criticized some world leaders, like Mr. Trump, and faced stinging criticism from others, like President Javier Milei of Argentina, who once dismissed his countryman, the first pope from Latin America, as a \"filthy leftist.\" \n Francis' funeral will be Mr. Trump's first foreign trip in his second term, and his first time seeing many of his global peers since he began to shake the world order with steep tariffs, erratic policy swings and dramatic deportations. \n Mr. Milei's office said on Tuesday that he would attend the funeral of Francis, a proud Argentine seen by many as a national hero. A far-right libertarian, Mr. Milei and the pope appeared to smooth over some issues last year. \n Here are some other leaders who plan to attend: \n Britain \n Keir Starmer, the prime minister, and Prince William, the heir to the throne \n Prince William will attend on behalf of his father, King Charles III, Kensington Palace said in a statement on Tuesday. King Charles and Queen Camilla had met with Francis this month. Mr. Starmer, the head of the British government, described Francis' leadership as \"courageous\" and noted his concern for \"the poor, the downtrodden and the forgotten\" in a post on X. \n Italy \n Prime Minister Giorgia Meloni \n Ms. Meloni led tributes to Francis on Monday, praising him as \"a great man and a great pastor.\" She also visited him while he was in the hospital. \"I had the privilege of enjoying his friendship, his advice and his teachings, which never failed even in moments of trial and suffering,\" she said. \n Ukraine \n President Volodymyr Zelensky \n A top aide to Mr. Zelensky told a Ukrainian news agency that the president planned to attend the funeral, potentially setting up his first interaction with President Trump since their tense Oval Office meeting in March. \"He knew how to give hope, ease suffering through prayer, and foster unity,\" Mr. Zelensky wrote on X in tribute to Francis. \"He prayed for peace in Ukraine and for Ukrainians.\" \n France \n President Emmanuel Macron \n Mr. Macron praised Francis for standing alongside \"the most vulnerable and the most fragile,\" and cut short a trip to the Indian Ocean region after the pope's death. \n Brazil \n President Luiz Inacio Lula da Silva \n Brazil, the world's largest Catholic country, is holding seven days of mourning for Francis. Mr. Lula remembered the pope for his smile and his faith in a brighter future in a post on X. \n Poland \n President Andrzej Duda \n The president's international affairs adviser confirmed that Mr. Duda and his wife would attend. \"Throughout his pastoral ministry, he was guided by humility and simplicity,\" Mr. Duda, who is Catholic and leads a deeply Catholic country, wrote in a tribute to Francis on X. \n Other leaders \n Austria: President Alexander Van der Bellen and Chancellor Christian Stocker \n Belgium: King Philippe, Queen Mathilde and Prime Minister Bart De Wever \n European Commission: Ursula von der Leyen \n Estonia: President Alar Karis \n Germany: President Frank-Walter Steinmeier and Chancellor Olaf Scholz \n Ireland: President Michael D. Higgins and Taoiseach Micheal Martin \n Latvia: President Edgars Rinkevics \n Lithuania: President Gitanas Nauseda \n Moldova: President Maia Sandu \n Romania: Interim President Ilie Bolojan and Prime Minister Marcel Ciolacu \n Slovakia: President Peter Pellegrini \n Slovenia: President Natasa Pirc Musar \n Spain: King Felipe VI and Queen Letizia \n United Nations: Secretary General Antonio Guterres \n Diego Ribadeneira and Mark Landler contributed reporting.",
      "ml_hf_summary": "Pope Francis' funeral will be held in Rome on Saturday, attracting a significant gathering of world leaders.  The event follows a week of mourning for the Pope, who was known for his advocacy for migrants, the poor, and marginalized groups.  Key attendees include President Trump, whose attendance marks his first foreign trip since taking office; Argentine President Javier Milei, who attended the funeral despite past criticism from the Pope; and Ukrainian President Volodymyr Zelensky, potentially setting up a meeting with President Trump after their tense Oval Office encounter in March. Leaders from various countries including Britain, Italy, France, Brazil, Poland, Austria, Belgium, Germany, Ireland, Latvia, Lithuania, Moldova, Romania, Slovakia, Slovenia, Spain, and the United Nations are also expected to attend. \n"
    },
    {
      "title": "A Simpler Funeral for Pope Francis, Who Shunned Many Papal Trappings",
      "link": "https://www.nytimes.com/2025/04/22/world/europe/pope-francis-funeral.html",
      "published": "2025-04-23",
      "summary": "A funeral will be held on Saturday for the pope, who changed the rules to make such ceremonies simpler than those traditionally observed.",
      "content": "Pope Francis' funeral will be held on Saturday in front of St. Peter's Basilica in Vatican City, with simpler rituals than in the past, followed by a burial in a relatively unadorned tomb, in keeping with his desire to draw the Roman Catholic Church closer to the people, the Vatican said on Tuesday. \n The ceremony, though undeniably grand in scale, will follow rules the Vatican issued last year, under Francis' direction, that reflect the humbler, down-to-earth style that became a hallmark of a pontiff who avoided many of the trappings of his predecessors and worked to refocus the church on the poor, the marginalized and the health of the planet. \n Political and religious leaders, and thousands of ordinary worshipers from around the world, are expected to attend the funeral, presided over by Cardinal Giovanni Battista Re, dean of the College of Cardinals.",
      "ml_hf_summary": "Pope Francis' funeral will be held on Saturday at St. Peter's Basilica in Vatican City. The ceremony will follow simplified rituals and a relatively unadorned burial, reflecting Pope Francis' desire to connect the Roman Catholic Church with ordinary people.  The event is expected to draw political and religious leaders, as well as thousands of attendees from around the world. Cardinal Giovanni Battista Re will preside over the funeral. \n"
    },
    {
      "title": "Wednesday Briefing: A Downgrade in Global Growth",
      "link": "https://www.nytimes.com/2025/04/23/briefing/global-economy-pope-francis-ukraine-rubio.html",
      "published": "2025-04-23",
      "summary": "Plus, the next big thing from Japan.",
      "content": "The latest global economic forecast: storms ahead \n President Trump's trade war is expected to slow economic growth across the globe this year, the International Monetary Fund said yesterday in a major report. \n The gloomier outlook stems in large part from the impact of tariffs on the U.S. economy, which is expected to see slower growth and higher inflation. Growth forecasts for China and Europe were also lowered. \n The I.M.F. forecasts that global output will slow to 2.8 percent this year from 3.3 percent in 2024. It also expects output to be slower next year. \n Quotable: \"The global economic system that has operated for the past 80 years is being reset,\" the I.M.F.'s chief economist said. The surge in uncertainty related to trade policy but also more broadly is a major driver of the economic outlook, he said.",
      "ml_hf_summary": "The International Monetary Fund (IMF) released a report predicting global economic growth will slow to 2.8% this year, down from 3.3% in 2024. This slowdown is attributed to President Trump's trade war and its impact on the U.S. economy, which is expected to experience slower growth and higher inflation.  The IMF also lowered growth forecasts for China and Europe. Global output is projected to slow further next year. The report highlights a significant shift in the global economic system due to increased uncertainty related to trade policy. \n"
    },
    {
      "title": "IMF Expects Trump’s Tariffs Will Slow Global Economic Growth",
      "link": "https://www.nytimes.com/2025/04/22/us/politics/imf-world-economic-outlook.html",
      "published": "2025-04-22",
      "summary": "The International Monetary Fund expects slower growth and higher inflation in the U.S. as a result of President Trump’s trade policies.",
      "content": "The World Economic Outlook report projects that global output will slow to 2.8 percent this year from 3.3 percent in 2024. In January, the fund forecast that growth would hold steady in 2025. \n The I.M.F. also expects output to be slower next year than it previously predicted. \n Much of the downgrade for this year can be attributed to the impact of the tariffs on the U.S. economy, which was already poised to lose momentum this year. The I.M.F. expects U.S. output to slow to 1.8 percent in 2025, down from 2.8 percent last year. That is nearly a full percentage point slower than the 2.7 percent growth that the I.M.F. forecast for the United States in January, when it was the strongest economy in the world. \n \"The global economic system that has operated for the past 80 years is being reset,\" Pierre-Olivier Gourinchas, the I.M.F.'s chief economist, said in a briefing with reporters this week. \"The U.S. effective tariff rate has now surged past levels reached at the turn of the 20th century. Beyond the tariffs themselves, the surge in policy uncertainty -- related to trade policy but also more broadly -- is a major driver of the economic outlook.\" \n The I.M.F. forecasts also make clear that the tariffs could complicate the efforts to keep inflation contained. The fund has raised its inflation forecast for the United States to 3 percent from 2 percent this year. \n Mr. Gourinchas said on Tuesday that the increase in price pressures from the tariffs would most likely be temporary in the U.S. but that the reduction in productivity and output would be permanent. Although the I.M.F. is not projecting a recession in the United States, the risk of such a downturn has increased to 40 percent from 25 percent in October.",
      "ml_hf_summary": "The International Monetary Fund (IMF) revised its global economic growth forecast downward to 2.8% for 2023, down from 3.3% previously projected. This downgrade is largely attributed to the impact of US tariffs on the U.S. economy, which is expected to slow to 1.8% in 2025. The IMF also raised its inflation forecast for the United States to 3% this year due to the tariffs' effect on price pressures. While not predicting a recession in the U.S., the risk of one has increased to 40%.  The IMF emphasizes that the economic system is undergoing a significant shift, with the US effective tariff rate surpassing levels seen at the turn of the 20th century. \n"
    },
    {
      "title": "Wednesday Briefing: A Downgrade in Global Growth",
      "link": "https://www.nytimes.com/2025/04/22/briefing/global-growth-pope-funeral-russia-ukraine-talks.html",
      "published": "2025-04-22",
      "summary": "Plus, the next big thing from Japan.",
      "content": "The latest global economic forecast: storms ahead \n President Trump's trade war is expected to slow economic growth across the globe this year, the International Monetary Fund said yesterday in a major report. \n The gloomier outlook stems in large part from the impact of tariffs on the U.S. economy, which is expected to see slower growth and higher inflation. Growth forecasts for China and Europe were also lowered. \n The I.M.F. forecasts that global output will slow to 2.8 percent this year from 3.3 percent in 2024. It also expects output to be slower next year. \n Quotable: \"The global economic system that has operated for the past 80 years is being reset,\" the I.M.F.'s chief economist said. The surge in uncertainty related to trade policy but also more broadly is a major driver of the economic outlook, he said.",
      "ml_hf_summary": "The International Monetary Fund (IMF) released a report predicting global economic growth will slow to 2.8% this year, down from 3.3% in 2024. This slowdown is attributed to President Trump's trade war and its impact on the U.S. economy, which is expected to experience slower growth and higher inflation.  The IMF also lowered growth forecasts for China and Europe. Global output is projected to slow further next year. The report highlights a significant shift in the global economic system due to increased uncertainty related to trade policy. \n"
    },
    {
      "title": "In Caracas, remembering a pastor ‘who walked with his flock until his final day.’",
      "link": "https://www.nytimes.com/live/2025/04/21/world/pope-francis-death-news/in-caracas-remembering-a-pastor-who-walked-with-his-flock-until-his-final-day",
      "published": "2025-04-22",
      "summary": "Though t",
      "content": "This photo of Pope Francis' remains in the Chapel of Santa Marta in the Vatican on Monday and those below were released by the Vatican. \n Before mourners in their thousands gather in St. Peter's Square to grieve, before leaders from around the world arrive to pay their respects, and long before cardinals cloister themselves to consider the future, the Vatican holds a small ceremony when a pope dies. \n It did so again around 8 p.m. Monday when, just over 12 hours after he died, Pope Francis was transferred from the rooms of his simple residence, a guesthouse in Vatican City, down to a chapel on the ground floor. \n There, Cardinal Kevin Farrell, the cardinal chamberlain -- known as the camerlengo -- performed a ceremony verifying that the pope was dead, with the declaration of death read aloud. The body was placed in its coffin, with only a small number of Vatican officials and members of the pope's family present. \n These photographs, which were distributed by the Vatican, capture some of the legacy of simplicity that Francis tried to create. There is the spare setting, one unlike the ornate palace rooms where other popes lived and died. And there is the less elaborate single coffin, in line with the rules Francis instituted and his insistence on leading the Roman Catholic Church through an example of humility. \n At the same time, the photos make clear that however much Francis tried to shake up the status quo, he did so cautiously. And so a look at the images reveals objects and figures that embody long-held traditions of the church. \n The coffin \n Last year, Francis simplified the procedures for a papal funeral, specifying that only one coffin, a wooden one lined in zinc, should be used. Past popes were interred in three nesting coffins: one of wood, a second of lead and a third of wood. \n Francis asked to be buried at the Papal Basilica of Santa Maria Maggiore in Rome, where seven other popes are interred -- and not within St. Peter's Basilica or the Vatican Grottoes, where around 90 popes are buried. He requested a simple, undecorated tomb with only the inscription \"Franciscus,\" according to the Vatican. Francis visited Santa Maria Maggiore at the beginning and end of every apostolic trip he took during his 12-year papacy, and went there on his first day as pope in 2013. \n In his will, Francis also specified that \"the tomb must be in the earth; simple, without particular decoration.\" \n A miter and pallium \n Francis's body is dressed in red robes, like those of deceased popes before him. The white papal miter, the traditional headdress worn by bishops, is on his head, signifying his status as the bishop of Rome. Over his chest lies a pallium, a strip of white wool decorated with crosses that is worn like a collar. It denotes the pope's status as an archbishop. \n Image Francis ordered the funeral rites for popes to be simplified. Credit... The Vatican \n The Swiss Guard \n Two members of the Pontifical Swiss Guard flank Francis's coffin, holding halberds and representing in part the pope's role as the leader of a sovereign state. Over the five centuries since it was formed, the guard has dwindled to what is sometimes called the world's smallest army, but it is still responsible for guarding Vatican territory and accompanying the pope on trips. (There is a separate Vatican City police force responsible for security there.) \n The colors on their uniforms reflect their Renaissance origins, according to the Guard -- blue, red and yellow are the traditional colors of the Medicis, the powerful Italian family that produced four popes. The halberds, too, reflect the Guard's origins: The weapons were used by the Swiss mercenaries who were the order's earliest members. \n The ring \n A rosary was draped over the pope's hands, as one was over the hands of his predecessor, Benedict XVI, when he died in 2023. \n On one of Francis's fingers is a ring -- the one he wore as a bishop, and not the one he used as pope, called the fisherman's ring after St. Peter, the disciple who began as a fisherman and became known as the first pope. That signet ring, which was kissed by pilgrims and used by Francis to seal documents, is destroyed immediately after a pope's death by the camerlengo in order to prevent forgeries. \n A new one will be forged when the next pope is elected. \n Image A rosary was wrapped around the pope's hands. Credit... The Vatican \n Francis will also be buried with a bag containing coins minted by the Vatican during his papacy and a canister with a deed known as a rogito that briefly lists details of his life and papacy. The rogito is read aloud before the coffin is closed. \n Since the 13th century, the embalmed bodies of popes have gone on public view on a raised pedestal. \n Francis, instead, ordered a public viewing with his body in a coffin that will not be on a raised pedestal.",
      "ml_hf_summary": "Pope Francis died on June 30, 2023.  A small ceremony was held at the Chapel of Santa Marta in the Vatican to verify his death and transfer his remains to a simple wooden coffin lined with zinc. The coffin was placed in a single, undecorated tomb at the Papal Basilica of Santa Maria Maggiore in Rome.  Francis's body was dressed in red robes, including a miter and pallium, signifying his status as the bishop of Rome. Two members of the Pontifical Swiss Guard flanked the coffin, holding halberds. Francis's remains will be buried with coins minted during his papacy, a rogito detailing his life and papacy, and a bag containing personal items.  Francis simplified funeral procedures for popes, opting for a single coffin and a simple tomb. \n"
    },
    {
      "title": "In Mexico, Francis Addressed the Immigration Debate",
      "link": "https://www.nytimes.com/live/2025/04/21/world/pope-francis-death-news/during-a-trip-to-mexico-francis-addressed-the-immigration-debate",
      "published": "2025-04-22",
      "summary": "",
      "content": "This photo of Pope Francis' remains in the Chapel of Santa Marta in the Vatican on Monday and those below were released by the Vatican. \n Before mourners in their thousands gather in St. Peter's Square to grieve, before leaders from around the world arrive to pay their respects, and long before cardinals cloister themselves to consider the future, the Vatican holds a small ceremony when a pope dies. \n It did so again around 8 p.m. Monday when, just over 12 hours after he died, Pope Francis was transferred from the rooms of his simple residence, a guesthouse in Vatican City, down to a chapel on the ground floor. \n There, Cardinal Kevin Farrell, the cardinal chamberlain -- known as the camerlengo -- performed a ceremony verifying that the pope was dead, with the declaration of death read aloud. The body was placed in its coffin, with only a small number of Vatican officials and members of the pope's family present. \n These photographs, which were distributed by the Vatican, capture some of the legacy of simplicity that Francis tried to create. There is the spare setting, one unlike the ornate palace rooms where other popes lived and died. And there is the less elaborate single coffin, in line with the rules Francis instituted and his insistence on leading the Roman Catholic Church through an example of humility. \n At the same time, the photos make clear that however much Francis tried to shake up the status quo, he did so cautiously. And so a look at the images reveals objects and figures that embody long-held traditions of the church. \n The coffin \n Last year, Francis simplified the procedures for a papal funeral, specifying that only one coffin, a wooden one lined in zinc, should be used. Past popes were interred in three nesting coffins: one of wood, a second of lead and a third of wood. \n Francis asked to be buried at the Papal Basilica of Santa Maria Maggiore in Rome, where seven other popes are interred -- and not within St. Peter's Basilica or the Vatican Grottoes, where around 90 popes are buried. He requested a simple, undecorated tomb with only the inscription \"Franciscus,\" according to the Vatican. Francis visited Santa Maria Maggiore at the beginning and end of every apostolic trip he took during his 12-year papacy, and went there on his first day as pope in 2013. \n In his will, Francis also specified that \"the tomb must be in the earth; simple, without particular decoration.\" \n A miter and pallium \n Francis's body is dressed in red robes, like those of deceased popes before him. The white papal miter, the traditional headdress worn by bishops, is on his head, signifying his status as the bishop of Rome. Over his chest lies a pallium, a strip of white wool decorated with crosses that is worn like a collar. It denotes the pope's status as an archbishop. \n Image Francis ordered the funeral rites for popes to be simplified. Credit... The Vatican \n The Swiss Guard \n Two members of the Pontifical Swiss Guard flank Francis's coffin, holding halberds and representing in part the pope's role as the leader of a sovereign state. Over the five centuries since it was formed, the guard has dwindled to what is sometimes called the world's smallest army, but it is still responsible for guarding Vatican territory and accompanying the pope on trips. (There is a separate Vatican City police force responsible for security there.) \n The colors on their uniforms reflect their Renaissance origins, according to the Guard -- blue, red and yellow are the traditional colors of the Medicis, the powerful Italian family that produced four popes. The halberds, too, reflect the Guard's origins: The weapons were used by the Swiss mercenaries who were the order's earliest members. \n The ring \n A rosary was draped over the pope's hands, as one was over the hands of his predecessor, Benedict XVI, when he died in 2023. \n On one of Francis's fingers is a ring -- the one he wore as a bishop, and not the one he used as pope, called the fisherman's ring after St. Peter, the disciple who began as a fisherman and became known as the first pope. That signet ring, which was kissed by pilgrims and used by Francis to seal documents, is destroyed immediately after a pope's death by the camerlengo in order to prevent forgeries. \n A new one will be forged when the next pope is elected. \n Image A rosary was wrapped around the pope's hands. Credit... The Vatican \n Francis will also be buried with a bag containing coins minted by the Vatican during his papacy and a canister with a deed known as a rogito that briefly lists details of his life and papacy. The rogito is read aloud before the coffin is closed. \n Since the 13th century, the embalmed bodies of popes have gone on public view on a raised pedestal. \n Francis, instead, ordered a public viewing with his body in a coffin that will not be on a raised pedestal.",
      "ml_hf_summary": "Pope Francis died on June 30, 2023.  A small ceremony was held at the Chapel of Santa Marta in the Vatican to verify his death and transfer his remains to a simple wooden coffin lined with zinc. The coffin will be buried in a plain tomb at the Papal Basilica of Santa Maria Maggiore in Rome.  Francis's body was dressed in red robes, including a miter and pallium, signifying his status as the bishop of Rome. Two members of the Pontifical Swiss Guard flanked the coffin, while a rosary was draped over his hands. A ring he wore as a bishop will be destroyed after his death. Francis also requested to be buried with coins minted during his papacy and a rogito detailing his life and papacy.  The Vatican has opted for a less elaborate viewing process compared to previous popes, where bodies were displayed on pedestals. \n"
    },
    {
      "title": "Another way Francis broke with tradition: by choosing an unusually humble residence.",
      "link": "https://www.nytimes.com/live/2025/04/21/world/pope-francis-death-news/casa-santa-marta-francis-seal",
      "published": "2025-04-22",
      "summary": "Po",
      "content": "This photo of Pope Francis' remains in the Chapel of Santa Marta in the Vatican on Monday and those below were released by the Vatican. \n Before mourners in their thousands gather in St. Peter's Square to grieve, before leaders from around the world arrive to pay their respects, and long before cardinals cloister themselves to consider the future, the Vatican holds a small ceremony when a pope dies. \n It did so again around 8 p.m. Monday when, just over 12 hours after he died, Pope Francis was transferred from the rooms of his simple residence, a guesthouse in Vatican City, down to a chapel on the ground floor. \n There, Cardinal Kevin Farrell, the cardinal chamberlain -- known as the camerlengo -- performed a ceremony verifying that the pope was dead, with the declaration of death read aloud. The body was placed in its coffin, with only a small number of Vatican officials and members of the pope's family present. \n These photographs, which were distributed by the Vatican, capture some of the legacy of simplicity that Francis tried to create. There is the spare setting, one unlike the ornate palace rooms where other popes lived and died. And there is the less elaborate single coffin, in line with the rules Francis instituted and his insistence on leading the Roman Catholic Church through an example of humility. \n At the same time, the photos make clear that however much Francis tried to shake up the status quo, he did so cautiously. And so a look at the images reveals objects and figures that embody long-held traditions of the church. \n The coffin \n Last year, Francis simplified the procedures for a papal funeral, specifying that only one coffin, a wooden one lined in zinc, should be used. Past popes were interred in three nesting coffins: one of wood, a second of lead and a third of wood. \n Francis asked to be buried at the Papal Basilica of Santa Maria Maggiore in Rome, where seven other popes are interred -- and not within St. Peter's Basilica or the Vatican Grottoes, where around 90 popes are buried. He requested a simple, undecorated tomb with only the inscription \"Franciscus,\" according to the Vatican. Francis visited Santa Maria Maggiore at the beginning and end of every apostolic trip he took during his 12-year papacy, and went there on his first day as pope in 2013. \n In his will, Francis also specified that \"the tomb must be in the earth; simple, without particular decoration.\" \n A miter and pallium \n Francis's body is dressed in red robes, like those of deceased popes before him. The white papal miter, the traditional headdress worn by bishops, is on his head, signifying his status as the bishop of Rome. Over his chest lies a pallium, a strip of white wool decorated with crosses that is worn like a collar. It denotes the pope's status as an archbishop. \n Image Francis ordered the funeral rites for popes to be simplified. Credit... The Vatican \n The Swiss Guard \n Two members of the Pontifical Swiss Guard flank Francis's coffin, holding halberds and representing in part the pope's role as the leader of a sovereign state. Over the five centuries since it was formed, the guard has dwindled to what is sometimes called the world's smallest army, but it is still responsible for guarding Vatican territory and accompanying the pope on trips. (There is a separate Vatican City police force responsible for security there.) \n The colors on their uniforms reflect their Renaissance origins, according to the Guard -- blue, red and yellow are the traditional colors of the Medicis, the powerful Italian family that produced four popes. The halberds, too, reflect the Guard's origins: The weapons were used by the Swiss mercenaries who were the order's earliest members. \n The ring \n A rosary was draped over the pope's hands, as one was over the hands of his predecessor, Benedict XVI, when he died in 2023. \n On one of Francis's fingers is a ring -- the one he wore as a bishop, and not the one he used as pope, called the fisherman's ring after St. Peter, the disciple who began as a fisherman and became known as the first pope. That signet ring, which was kissed by pilgrims and used by Francis to seal documents, is destroyed immediately after a pope's death by the camerlengo in order to prevent forgeries. \n A new one will be forged when the next pope is elected. \n Image A rosary was wrapped around the pope's hands. Credit... The Vatican \n Francis will also be buried with a bag containing coins minted by the Vatican during his papacy and a canister with a deed known as a rogito that briefly lists details of his life and papacy. The rogito is read aloud before the coffin is closed. \n Since the 13th century, the embalmed bodies of popes have gone on public view on a raised pedestal. \n Francis, instead, ordered a public viewing with his body in a coffin that will not be on a raised pedestal.",
      "ml_hf_summary": "Pope Francis died on June 30, 2023.  A small ceremony was held at the Chapel of Santa Marta in the Vatican to verify his death and transfer his remains to a simple wooden coffin lined with zinc. The coffin will be buried in a plain tomb at the Papal Basilica of Santa Maria Maggiore in Rome.  Francis's body was dressed in red robes, including a miter and pallium, signifying his status as the bishop of Rome. Two members of the Pontifical Swiss Guard flanked the coffin, while a rosary was draped over his hands. A ring he wore as a bishop will be destroyed after his death. Francis also requested to be buried with coins minted during his papacy and a rogito detailing his life and papacy.  The Vatican has opted for a less elaborate viewing process compared to previous popes, where bodies were displayed on pedestals. \n"
    },
    {
      "title": "What to Know About Pope Francis’ Funeral Arrangements",
      "link": "https://www.nytimes.com/article/pope-francis-death-health-problems.html",
      "published": "2025-04-23",
      "summary": "The funeral will take place on Saturday. The process to choose his successor will come next.",
      "content": "Contrary to his doctors' orders to stay essentially isolated in his Vatican residence to recover, the pope resumed a limited schedule after his release from the hospital. A day before his death, he met with Vice President JD Vance and blessed the faithful gathered in St. Peter's Square for Easter Mass. \n He had made several public appearances over the past week. But his weak, raspy voice was a reminder of his frailty. \n What happens when a pope dies? \n Time-honored rituals have been drafted and refined over the centuries to ensure secrecy and an orderly transition. The carefully choreographed pageantry provides order to a church in its most dramatic moment of flux. \n The Vatican said in a statement that Francis had died at 7:35 a.m. on Monday. \n A pope's death is confirmed by the head of the Vatican's health department and the cardinal chamberlain of the Holy Roman Church, who becomes the Vatican's de facto administrator. The pope's body is dressed in a white cassock and brought to the pope's private chapel. \n The cardinal chamberlain, camerlengo in Italian, is a position now held by Cardinal Kevin Joseph Farrell, a 77-year-old American of Irish origin. He and other officials, along with members of the pope's family, congregated in the chapel for a ceremony. The body was placed in a coffin made of wood and lined with zinc. The pope was dressed in red, his miter and pallium placed next to him.",
      "ml_hf_summary": "Pope Francis died on Monday at 7:35 am.  He had been released from the hospital after recovering from an illness and resumed limited public appearances before his death.  The Vatican confirmed his passing and stated that Cardinal Kevin Joseph Farrell, the current cardinal chamberlain, will assume administrative duties. The Pope's body was dressed in a white cassock and brought to the pope's private chapel for a ceremony where he was placed in a coffin made of wood lined with zinc.  A traditional process of mourning and transition has been established for the Vatican, ensuring secrecy and order during this significant moment. \n"
    },
    {
      "title": "Francis Was the Pope Who Canonized the Most Saints",
      "link": "https://www.nytimes.com/live/2025/04/21/world/pope-francis-death-news/saints-mother-teresa",
      "published": "2025-04-22",
      "summary": "",
      "content": "This photo of Pope Francis' remains in the Chapel of Santa Marta in the Vatican on Monday and those below were released by the Vatican. \n Before mourners in their thousands gather in St. Peter's Square to grieve, before leaders from around the world arrive to pay their respects, and long before cardinals cloister themselves to consider the future, the Vatican holds a small ceremony when a pope dies. \n It did so again around 8 p.m. Monday when, just over 12 hours after he died, Pope Francis was transferred from the rooms of his simple residence, a guesthouse in Vatican City, down to a chapel on the ground floor. \n There, Cardinal Kevin Farrell, the cardinal chamberlain -- known as the camerlengo -- performed a ceremony verifying that the pope was dead, with the declaration of death read aloud. The body was placed in its coffin, with only a small number of Vatican officials and members of the pope's family present. \n These photographs, which were distributed by the Vatican, capture some of the legacy of simplicity that Francis tried to create. There is the spare setting, one unlike the ornate palace rooms where other popes lived and died. And there is the less elaborate single coffin, in line with the rules Francis instituted and his insistence on leading the Roman Catholic Church through an example of humility. \n At the same time, the photos make clear that however much Francis tried to shake up the status quo, he did so cautiously. And so a look at the images reveals objects and figures that embody long-held traditions of the church. \n The coffin \n Last year, Francis simplified the procedures for a papal funeral, specifying that only one coffin, a wooden one lined in zinc, should be used. Past popes were interred in three nesting coffins: one of wood, a second of lead and a third of wood. \n Francis asked to be buried at the Papal Basilica of Santa Maria Maggiore in Rome, where seven other popes are interred -- and not within St. Peter's Basilica or the Vatican Grottoes, where around 90 popes are buried. He requested a simple, undecorated tomb with only the inscription \"Franciscus,\" according to the Vatican. Francis visited Santa Maria Maggiore at the beginning and end of every apostolic trip he took during his 12-year papacy, and went there on his first day as pope in 2013. \n In his will, Francis also specified that \"the tomb must be in the earth; simple, without particular decoration.\" \n A miter and pallium \n Francis's body is dressed in red robes, like those of deceased popes before him. The white papal miter, the traditional headdress worn by bishops, is on his head, signifying his status as the bishop of Rome. Over his chest lies a pallium, a strip of white wool decorated with crosses that is worn like a collar. It denotes the pope's status as an archbishop. \n Image Francis ordered the funeral rites for popes to be simplified. Credit... The Vatican \n The Swiss Guard \n Two members of the Pontifical Swiss Guard flank Francis's coffin, holding halberds and representing in part the pope's role as the leader of a sovereign state. Over the five centuries since it was formed, the guard has dwindled to what is sometimes called the world's smallest army, but it is still responsible for guarding Vatican territory and accompanying the pope on trips. (There is a separate Vatican City police force responsible for security there.) \n The colors on their uniforms reflect their Renaissance origins, according to the Guard -- blue, red and yellow are the traditional colors of the Medicis, the powerful Italian family that produced four popes. The halberds, too, reflect the Guard's origins: The weapons were used by the Swiss mercenaries who were the order's earliest members. \n The ring \n A rosary was draped over the pope's hands, as one was over the hands of his predecessor, Benedict XVI, when he died in 2023. \n On one of Francis's fingers is a ring -- the one he wore as a bishop, and not the one he used as pope, called the fisherman's ring after St. Peter, the disciple who began as a fisherman and became known as the first pope. That signet ring, which was kissed by pilgrims and used by Francis to seal documents, is destroyed immediately after a pope's death by the camerlengo in order to prevent forgeries. \n A new one will be forged when the next pope is elected. \n Image A rosary was wrapped around the pope's hands. Credit... The Vatican \n Francis will also be buried with a bag containing coins minted by the Vatican during his papacy and a canister with a deed known as a rogito that briefly lists details of his life and papacy. The rogito is read aloud before the coffin is closed. \n Since the 13th century, the embalmed bodies of popes have gone on public view on a raised pedestal. \n Francis, instead, ordered a public viewing with his body in a coffin that will not be on a raised pedestal.",
      "ml_hf_summary": "Pope Francis died on June 30, 2023.  A small ceremony was held at the Chapel of Santa Marta in the Vatican to verify his death and transfer his remains to a simple wooden coffin lined with zinc. The coffin will be buried in a plain tomb at the Papal Basilica of Santa Maria Maggiore in Rome.  Francis's body was dressed in red robes, including a miter and pallium, signifying his status as the bishop of Rome. Two members of the Pontifical Swiss Guard flanked the coffin, while a rosary was draped over his hands. A ring he wore as a bishop will be destroyed after his death. Francis also requested to be buried with coins minted during his papacy and a rogito detailing his life and papacy.  The Vatican has opted for a less elaborate viewing process compared to previous popes, where bodies were displayed on pedestals. \n"
    },
    {
      "title": "Before his hospitalization, the pope gave his reflections on old age.",
      "link": "https://www.nytimes.com/live/2025/04/21/world/pope-francis-death-news/before-his-hospitalization-the-pope-gave-his-reflections-on-old-age",
      "published": "2025-04-22",
      "summary": "",
      "content": "This photo of Pope Francis' remains in the Chapel of Santa Marta in the Vatican on Monday and those below were released by the Vatican. \n Before mourners in their thousands gather in St. Peter's Square to grieve, before leaders from around the world arrive to pay their respects, and long before cardinals cloister themselves to consider the future, the Vatican holds a small ceremony when a pope dies. \n It did so again around 8 p.m. Monday when, just over 12 hours after he died, Pope Francis was transferred from the rooms of his simple residence, a guesthouse in Vatican City, down to a chapel on the ground floor. \n There, Cardinal Kevin Farrell, the cardinal chamberlain -- known as the camerlengo -- performed a ceremony verifying that the pope was dead, with the declaration of death read aloud. The body was placed in its coffin, with only a small number of Vatican officials and members of the pope's family present. \n These photographs, which were distributed by the Vatican, capture some of the legacy of simplicity that Francis tried to create. There is the spare setting, one unlike the ornate palace rooms where other popes lived and died. And there is the less elaborate single coffin, in line with the rules Francis instituted and his insistence on leading the Roman Catholic Church through an example of humility. \n At the same time, the photos make clear that however much Francis tried to shake up the status quo, he did so cautiously. And so a look at the images reveals objects and figures that embody long-held traditions of the church. \n The coffin \n Last year, Francis simplified the procedures for a papal funeral, specifying that only one coffin, a wooden one lined in zinc, should be used. Past popes were interred in three nesting coffins: one of wood, a second of lead and a third of wood. \n Francis asked to be buried at the Papal Basilica of Santa Maria Maggiore in Rome, where seven other popes are interred -- and not within St. Peter's Basilica or the Vatican Grottoes, where around 90 popes are buried. He requested a simple, undecorated tomb with only the inscription \"Franciscus,\" according to the Vatican. Francis visited Santa Maria Maggiore at the beginning and end of every apostolic trip he took during his 12-year papacy, and went there on his first day as pope in 2013. \n In his will, Francis also specified that \"the tomb must be in the earth; simple, without particular decoration.\" \n A miter and pallium \n Francis's body is dressed in red robes, like those of deceased popes before him. The white papal miter, the traditional headdress worn by bishops, is on his head, signifying his status as the bishop of Rome. Over his chest lies a pallium, a strip of white wool decorated with crosses that is worn like a collar. It denotes the pope's status as an archbishop. \n Image Francis ordered the funeral rites for popes to be simplified. Credit... The Vatican \n The Swiss Guard \n Two members of the Pontifical Swiss Guard flank Francis's coffin, holding halberds and representing in part the pope's role as the leader of a sovereign state. Over the five centuries since it was formed, the guard has dwindled to what is sometimes called the world's smallest army, but it is still responsible for guarding Vatican territory and accompanying the pope on trips. (There is a separate Vatican City police force responsible for security there.) \n The colors on their uniforms reflect their Renaissance origins, according to the Guard -- blue, red and yellow are the traditional colors of the Medicis, the powerful Italian family that produced four popes. The halberds, too, reflect the Guard's origins: The weapons were used by the Swiss mercenaries who were the order's earliest members. \n The ring \n A rosary was draped over the pope's hands, as one was over the hands of his predecessor, Benedict XVI, when he died in 2023. \n On one of Francis's fingers is a ring -- the one he wore as a bishop, and not the one he used as pope, called the fisherman's ring after St. Peter, the disciple who began as a fisherman and became known as the first pope. That signet ring, which was kissed by pilgrims and used by Francis to seal documents, is destroyed immediately after a pope's death by the camerlengo in order to prevent forgeries. \n A new one will be forged when the next pope is elected. \n Image A rosary was wrapped around the pope's hands. Credit... The Vatican \n Francis will also be buried with a bag containing coins minted by the Vatican during his papacy and a canister with a deed known as a rogito that briefly lists details of his life and papacy. The rogito is read aloud before the coffin is closed. \n Since the 13th century, the embalmed bodies of popes have gone on public view on a raised pedestal. \n Francis, instead, ordered a public viewing with his body in a coffin that will not be on a raised pedestal.",
      "ml_hf_summary": "Pope Francis died on June 30, 2023.  A small ceremony was held at the Chapel of Santa Marta in the Vatican to verify his death and transfer his remains to a simple wooden coffin lined with zinc. The coffin will be buried in a plain tomb at the Papal Basilica of Santa Maria Maggiore in Rome.  Francis's body was dressed in red robes, including a miter and pallium, signifying his status as the bishop of Rome. Two members of the Pontifical Swiss Guard flanked the coffin, while a rosary was draped over his hands. A ring he wore as a bishop will be destroyed after his death. Francis also requested to be buried with coins minted during his papacy and a rogito detailing his life and papacy.  The Vatican has opted for a less elaborate viewing process compared to previous popes, where bodies were displayed on pedestals. \n"
    },
    {
      "title": "China says it is willing to keep improving ties with the Vatican.",
      "link": "https://www.nytimes.com/live/2025/04/21/world/pope-francis-death-news/china-says-it-is-willing-to-keep-improving-ties-with-the-vatican",
      "published": "2025-04-22",
      "summary": "",
      "content": "This photo of Pope Francis' remains in the Chapel of Santa Marta in the Vatican on Monday and those below were released by the Vatican. \n Before mourners in their thousands gather in St. Peter's Square to grieve, before leaders from around the world arrive to pay their respects, and long before cardinals cloister themselves to consider the future, the Vatican holds a small ceremony when a pope dies. \n It did so again around 8 p.m. Monday when, just over 12 hours after he died, Pope Francis was transferred from the rooms of his simple residence, a guesthouse in Vatican City, down to a chapel on the ground floor. \n There, Cardinal Kevin Farrell, the cardinal chamberlain -- known as the camerlengo -- performed a ceremony verifying that the pope was dead, with the declaration of death read aloud. The body was placed in its coffin, with only a small number of Vatican officials and members of the pope's family present. \n These photographs, which were distributed by the Vatican, capture some of the legacy of simplicity that Francis tried to create. There is the spare setting, one unlike the ornate palace rooms where other popes lived and died. And there is the less elaborate single coffin, in line with the rules Francis instituted and his insistence on leading the Roman Catholic Church through an example of humility. \n At the same time, the photos make clear that however much Francis tried to shake up the status quo, he did so cautiously. And so a look at the images reveals objects and figures that embody long-held traditions of the church. \n The coffin \n Last year, Francis simplified the procedures for a papal funeral, specifying that only one coffin, a wooden one lined in zinc, should be used. Past popes were interred in three nesting coffins: one of wood, a second of lead and a third of wood. \n Francis asked to be buried at the Papal Basilica of Santa Maria Maggiore in Rome, where seven other popes are interred -- and not within St. Peter's Basilica or the Vatican Grottoes, where around 90 popes are buried. He requested a simple, undecorated tomb with only the inscription \"Franciscus,\" according to the Vatican. Francis visited Santa Maria Maggiore at the beginning and end of every apostolic trip he took during his 12-year papacy, and went there on his first day as pope in 2013. \n In his will, Francis also specified that \"the tomb must be in the earth; simple, without particular decoration.\" \n A miter and pallium \n Francis's body is dressed in red robes, like those of deceased popes before him. The white papal miter, the traditional headdress worn by bishops, is on his head, signifying his status as the bishop of Rome. Over his chest lies a pallium, a strip of white wool decorated with crosses that is worn like a collar. It denotes the pope's status as an archbishop. \n Image Francis ordered the funeral rites for popes to be simplified. Credit... The Vatican \n The Swiss Guard \n Two members of the Pontifical Swiss Guard flank Francis's coffin, holding halberds and representing in part the pope's role as the leader of a sovereign state. Over the five centuries since it was formed, the guard has dwindled to what is sometimes called the world's smallest army, but it is still responsible for guarding Vatican territory and accompanying the pope on trips. (There is a separate Vatican City police force responsible for security there.) \n The colors on their uniforms reflect their Renaissance origins, according to the Guard -- blue, red and yellow are the traditional colors of the Medicis, the powerful Italian family that produced four popes. The halberds, too, reflect the Guard's origins: The weapons were used by the Swiss mercenaries who were the order's earliest members. \n The ring \n A rosary was draped over the pope's hands, as one was over the hands of his predecessor, Benedict XVI, when he died in 2023. \n On one of Francis's fingers is a ring -- the one he wore as a bishop, and not the one he used as pope, called the fisherman's ring after St. Peter, the disciple who began as a fisherman and became known as the first pope. That signet ring, which was kissed by pilgrims and used by Francis to seal documents, is destroyed immediately after a pope's death by the camerlengo in order to prevent forgeries. \n A new one will be forged when the next pope is elected. \n Image A rosary was wrapped around the pope's hands. Credit... The Vatican \n Francis will also be buried with a bag containing coins minted by the Vatican during his papacy and a canister with a deed known as a rogito that briefly lists details of his life and papacy. The rogito is read aloud before the coffin is closed. \n Since the 13th century, the embalmed bodies of popes have gone on public view on a raised pedestal. \n Francis, instead, ordered a public viewing with his body in a coffin that will not be on a raised pedestal.",
      "ml_hf_summary": "Pope Francis died on June 30, 2023.  A small ceremony was held at the Chapel of Santa Marta in the Vatican to verify his death and transfer his remains to a simple wooden coffin lined with zinc. The coffin was placed in a single, undecorated tomb at the Papal Basilica of Santa Maria Maggiore in Rome.  Francis's body was dressed in red robes, including a miter and pallium, signifying his status as the bishop of Rome. Two members of the Pontifical Swiss Guard flanked the coffin, holding halberds. Francis's remains will be buried with coins minted during his papacy, a rogito detailing his life and papacy, and a bag containing personal items.  Francis simplified funeral procedures for popes, opting for a single coffin and a simple tomb. \n"
    },
    {
      "title": "Nations have begun official periods of mourning.",
      "link": "https://www.nytimes.com/live/2025/04/21/world/pope-francis-death-news/nations-have-begun-official-periods-of-mourning",
      "published": "2025-04-22",
      "summary": "",
      "content": "This photo of Pope Francis' remains in the Chapel of Santa Marta in the Vatican on Monday and those below were released by the Vatican. \n Before mourners in their thousands gather in St. Peter's Square to grieve, before leaders from around the world arrive to pay their respects, and long before cardinals cloister themselves to consider the future, the Vatican holds a small ceremony when a pope dies. \n It did so again around 8 p.m. Monday when, just over 12 hours after he died, Pope Francis was transferred from the rooms of his simple residence, a guesthouse in Vatican City, down to a chapel on the ground floor. \n There, Cardinal Kevin Farrell, the cardinal chamberlain -- known as the camerlengo -- performed a ceremony verifying that the pope was dead, with the declaration of death read aloud. The body was placed in its coffin, with only a small number of Vatican officials and members of the pope's family present. \n These photographs, which were distributed by the Vatican, capture some of the legacy of simplicity that Francis tried to create. There is the spare setting, one unlike the ornate palace rooms where other popes lived and died. And there is the less elaborate single coffin, in line with the rules Francis instituted and his insistence on leading the Roman Catholic Church through an example of humility. \n At the same time, the photos make clear that however much Francis tried to shake up the status quo, he did so cautiously. And so a look at the images reveals objects and figures that embody long-held traditions of the church. \n The coffin \n Last year, Francis simplified the procedures for a papal funeral, specifying that only one coffin, a wooden one lined in zinc, should be used. Past popes were interred in three nesting coffins: one of wood, a second of lead and a third of wood. \n Francis asked to be buried at the Papal Basilica of Santa Maria Maggiore in Rome, where seven other popes are interred -- and not within St. Peter's Basilica or the Vatican Grottoes, where around 90 popes are buried. He requested a simple, undecorated tomb with only the inscription \"Franciscus,\" according to the Vatican. Francis visited Santa Maria Maggiore at the beginning and end of every apostolic trip he took during his 12-year papacy, and went there on his first day as pope in 2013. \n In his will, Francis also specified that \"the tomb must be in the earth; simple, without particular decoration.\" \n A miter and pallium \n Francis's body is dressed in red robes, like those of deceased popes before him. The white papal miter, the traditional headdress worn by bishops, is on his head, signifying his status as the bishop of Rome. Over his chest lies a pallium, a strip of white wool decorated with crosses that is worn like a collar. It denotes the pope's status as an archbishop. \n Image Francis ordered the funeral rites for popes to be simplified. Credit... The Vatican \n The Swiss Guard \n Two members of the Pontifical Swiss Guard flank Francis's coffin, holding halberds and representing in part the pope's role as the leader of a sovereign state. Over the five centuries since it was formed, the guard has dwindled to what is sometimes called the world's smallest army, but it is still responsible for guarding Vatican territory and accompanying the pope on trips. (There is a separate Vatican City police force responsible for security there.) \n The colors on their uniforms reflect their Renaissance origins, according to the Guard -- blue, red and yellow are the traditional colors of the Medicis, the powerful Italian family that produced four popes. The halberds, too, reflect the Guard's origins: The weapons were used by the Swiss mercenaries who were the order's earliest members. \n The ring \n A rosary was draped over the pope's hands, as one was over the hands of his predecessor, Benedict XVI, when he died in 2023. \n On one of Francis's fingers is a ring -- the one he wore as a bishop, and not the one he used as pope, called the fisherman's ring after St. Peter, the disciple who began as a fisherman and became known as the first pope. That signet ring, which was kissed by pilgrims and used by Francis to seal documents, is destroyed immediately after a pope's death by the camerlengo in order to prevent forgeries. \n A new one will be forged when the next pope is elected. \n Image A rosary was wrapped around the pope's hands. Credit... The Vatican \n Francis will also be buried with a bag containing coins minted by the Vatican during his papacy and a canister with a deed known as a rogito that briefly lists details of his life and papacy. The rogito is read aloud before the coffin is closed. \n Since the 13th century, the embalmed bodies of popes have gone on public view on a raised pedestal. \n Francis, instead, ordered a public viewing with his body in a coffin that will not be on a raised pedestal.",
      "ml_hf_summary": "Pope Francis died on June 30, 2023.  A small ceremony was held at the Chapel of Santa Marta in the Vatican to verify his death and transfer his remains to a simple wooden coffin lined with zinc. The coffin was placed in a single, undecorated tomb at the Papal Basilica of Santa Maria Maggiore in Rome.  Francis's body was dressed in red robes, including a miter and pallium, signifying his status as the bishop of Rome. Two members of the Pontifical Swiss Guard flanked the coffin, holding halberds. Francis's remains will be buried with coins minted during his papacy, a rogito detailing his life and papacy, and a bag containing personal items.  Francis simplified funeral procedures for popes, opting for a single coffin and a simple tomb. \n"
    },
    {
      "title": "Easter Monday, the Day Francis Died, Holds Special Significance",
      "link": "https://www.nytimes.com/live/2025/04/21/world/pope-francis-death-news/easter-monday-the-day-of-francis-death-has-particular-significance-for-catholics",
      "published": "2025-04-22",
      "summary": "",
      "content": "This photo of Pope Francis' remains in the Chapel of Santa Marta in the Vatican on Monday and those below were released by the Vatican. \n Before mourners in their thousands gather in St. Peter's Square to grieve, before leaders from around the world arrive to pay their respects, and long before cardinals cloister themselves to consider the future, the Vatican holds a small ceremony when a pope dies. \n It did so again around 8 p.m. Monday when, just over 12 hours after he died, Pope Francis was transferred from the rooms of his simple residence, a guesthouse in Vatican City, down to a chapel on the ground floor. \n There, Cardinal Kevin Farrell, the cardinal chamberlain -- known as the camerlengo -- performed a ceremony verifying that the pope was dead, with the declaration of death read aloud. The body was placed in its coffin, with only a small number of Vatican officials and members of the pope's family present. \n These photographs, which were distributed by the Vatican, capture some of the legacy of simplicity that Francis tried to create. There is the spare setting, one unlike the ornate palace rooms where other popes lived and died. And there is the less elaborate single coffin, in line with the rules Francis instituted and his insistence on leading the Roman Catholic Church through an example of humility. \n At the same time, the photos make clear that however much Francis tried to shake up the status quo, he did so cautiously. And so a look at the images reveals objects and figures that embody long-held traditions of the church. \n The coffin \n Last year, Francis simplified the procedures for a papal funeral, specifying that only one coffin, a wooden one lined in zinc, should be used. Past popes were interred in three nesting coffins: one of wood, a second of lead and a third of wood. \n Francis asked to be buried at the Papal Basilica of Santa Maria Maggiore in Rome, where seven other popes are interred -- and not within St. Peter's Basilica or the Vatican Grottoes, where around 90 popes are buried. He requested a simple, undecorated tomb with only the inscription \"Franciscus,\" according to the Vatican. Francis visited Santa Maria Maggiore at the beginning and end of every apostolic trip he took during his 12-year papacy, and went there on his first day as pope in 2013. \n In his will, Francis also specified that \"the tomb must be in the earth; simple, without particular decoration.\" \n A miter and pallium \n Francis's body is dressed in red robes, like those of deceased popes before him. The white papal miter, the traditional headdress worn by bishops, is on his head, signifying his status as the bishop of Rome. Over his chest lies a pallium, a strip of white wool decorated with crosses that is worn like a collar. It denotes the pope's status as an archbishop. \n Image Francis ordered the funeral rites for popes to be simplified. Credit... The Vatican \n The Swiss Guard \n Two members of the Pontifical Swiss Guard flank Francis's coffin, holding halberds and representing in part the pope's role as the leader of a sovereign state. Over the five centuries since it was formed, the guard has dwindled to what is sometimes called the world's smallest army, but it is still responsible for guarding Vatican territory and accompanying the pope on trips. (There is a separate Vatican City police force responsible for security there.) \n The colors on their uniforms reflect their Renaissance origins, according to the Guard -- blue, red and yellow are the traditional colors of the Medicis, the powerful Italian family that produced four popes. The halberds, too, reflect the Guard's origins: The weapons were used by the Swiss mercenaries who were the order's earliest members. \n The ring \n A rosary was draped over the pope's hands, as one was over the hands of his predecessor, Benedict XVI, when he died in 2023. \n On one of Francis's fingers is a ring -- the one he wore as a bishop, and not the one he used as pope, called the fisherman's ring after St. Peter, the disciple who began as a fisherman and became known as the first pope. That signet ring, which was kissed by pilgrims and used by Francis to seal documents, is destroyed immediately after a pope's death by the camerlengo in order to prevent forgeries. \n A new one will be forged when the next pope is elected. \n Image A rosary was wrapped around the pope's hands. Credit... The Vatican \n Francis will also be buried with a bag containing coins minted by the Vatican during his papacy and a canister with a deed known as a rogito that briefly lists details of his life and papacy. The rogito is read aloud before the coffin is closed. \n Since the 13th century, the embalmed bodies of popes have gone on public view on a raised pedestal. \n Francis, instead, ordered a public viewing with his body in a coffin that will not be on a raised pedestal.",
      "ml_hf_summary": "Pope Francis died on June 30, 2023.  A small ceremony was held at the Chapel of Santa Marta in the Vatican to verify his death and transfer his remains to a simple wooden coffin lined with zinc. The coffin will be buried in a plain tomb at the Papal Basilica of Santa Maria Maggiore in Rome.  Francis's body was dressed in red robes, including a miter and pallium, signifying his status as the bishop of Rome. Two members of the Pontifical Swiss Guard flanked the coffin, while a rosary was draped over his hands. A ring he wore as a bishop will be destroyed after his death. Francis also requested to be buried with coins minted during his papacy and a rogito detailing his life and papacy.  The Vatican has opted for a less elaborate viewing process compared to previous popes, where bodies were displayed on pedestals. \n"
    },
    {
      "title": "Vatican Releases Photos of Pope Francis in His Casket",
      "link": "https://www.nytimes.com/2025/04/22/world/europe/pope-francis-death-casket-photos.html",
      "published": "2025-04-23",
      "summary": "In a small ceremony, Vatican officials followed the path long taken when a pope dies.",
      "content": "Before mourners in their thousands gather in St. Peter's Square to grieve, before leaders from around the world arrive to pay their respects, and long before cardinals cloister themselves to consider the future, the Vatican holds a small ceremony when a pope dies. \n It did so again around 8 p.m. Monday when, just over 12 hours after he died, Pope Francis was transferred from the rooms of his simple residence, a guesthouse in Vatican City, down to a chapel on the ground floor. \n There, Cardinal Kevin Farrell, the cardinal chamberlain -- known as the camerlengo -- performed a ceremony verifying that the pope was dead, with the declaration of death read aloud. The body was placed in its coffin, with only a small number of Vatican officials and members of the pope's family present. \n These photographs, which were distributed by the Vatican, capture some of the legacy of simplicity that Francis tried to create. There is the spare setting, one unlike the ornate palace rooms where other popes lived and died. And there is the less elaborate single coffin, in line with the rules Francis instituted and his insistence on leading the Roman Catholic Church through an example of humility. \n At the same time, the photos make clear that however much Francis tried to shake up the status quo, he did so cautiously. And so a look at the images reveals objects and figures that embody long-held traditions of the church. \n The coffin \n Last year, Francis simplified the procedures for a papal funeral, specifying that only one coffin, a wooden one lined in zinc, should be used. Past popes were interred in three nesting coffins: one of wood, a second of lead and a third of wood. \n Francis asked to be buried at the Papal Basilica of Santa Maria Maggiore in Rome, where seven other popes are interred -- and not within St. Peter's Basilica or the Vatican Grottoes, where around 90 popes are buried. He requested a simple, undecorated tomb with only the inscription \"Franciscus,\" according to the Vatican. Francis visited Santa Maria Maggiore at the beginning and end of every apostolic trip he took during his 12-year papacy, and went there on his first day as pope in 2013. \n In his will, Francis also specified that \"the tomb must be in the earth; simple, without particular decoration.\" \n A miter and pallium \n Francis's body is dressed in red robes, like those of deceased popes before him. The white papal miter, the traditional headdress worn by bishops, is on his head, signifying his status as the bishop of Rome. Over his chest lies a pallium, a strip of white wool decorated with crosses that is worn like a collar. It denotes the pope's status as an archbishop.",
      "ml_hf_summary": "Pope Francis died on Monday and was transferred to a chapel in Vatican City for a ceremony verifying his death. Cardinal Kevin Farrell performed the ceremony, reading the declaration of death and placing the body in a simple wooden coffin. The coffin is in line with Pope Francis's simplification of papal funeral procedures, which included using only one coffin instead of three nesting coffins.  He requested burial at Santa Maria Maggiore Basilica in Rome, where seven other popes are interred, and a simple, undecorated tomb inscribed \"Franciscus.\" His body was dressed in red robes, with the white papal miter and pallium signifying his status as the bishop of Rome. \n"
    },
    {
      "title": "At the pope’s hospital, Francis was a calming and mischievous presence.",
      "link": "https://www.nytimes.com/live/2025/04/21/world/pope-francis-death-news/at-the-popes-hospital-francis-was-a-calming-and-mischievous-presence",
      "published": "2025-04-22",
      "summary": "The Vatican-run Bambino Gesu mourns a pontiff who would show up last minute, and left lasting memories.",
      "content": "This photo of Pope Francis' remains in the Chapel of Santa Marta in the Vatican on Monday and those below were released by the Vatican. \n Before mourners in their thousands gather in St. Peter's Square to grieve, before leaders from around the world arrive to pay their respects, and long before cardinals cloister themselves to consider the future, the Vatican holds a small ceremony when a pope dies. \n It did so again around 8 p.m. Monday when, just over 12 hours after he died, Pope Francis was transferred from the rooms of his simple residence, a guesthouse in Vatican City, down to a chapel on the ground floor. \n There, Cardinal Kevin Farrell, the cardinal chamberlain -- known as the camerlengo -- performed a ceremony verifying that the pope was dead, with the declaration of death read aloud. The body was placed in its coffin, with only a small number of Vatican officials and members of the pope's family present. \n These photographs, which were distributed by the Vatican, capture some of the legacy of simplicity that Francis tried to create. There is the spare setting, one unlike the ornate palace rooms where other popes lived and died. And there is the less elaborate single coffin, in line with the rules Francis instituted and his insistence on leading the Roman Catholic Church through an example of humility. \n At the same time, the photos make clear that however much Francis tried to shake up the status quo, he did so cautiously. And so a look at the images reveals objects and figures that embody long-held traditions of the church. \n The coffin \n Last year, Francis simplified the procedures for a papal funeral, specifying that only one coffin, a wooden one lined in zinc, should be used. Past popes were interred in three nesting coffins: one of wood, a second of lead and a third of wood. \n Francis asked to be buried at the Papal Basilica of Santa Maria Maggiore in Rome, where seven other popes are interred -- and not within St. Peter's Basilica or the Vatican Grottoes, where around 90 popes are buried. He requested a simple, undecorated tomb with only the inscription \"Franciscus,\" according to the Vatican. Francis visited Santa Maria Maggiore at the beginning and end of every apostolic trip he took during his 12-year papacy, and went there on his first day as pope in 2013. \n In his will, Francis also specified that \"the tomb must be in the earth; simple, without particular decoration.\" \n A miter and pallium \n Francis's body is dressed in red robes, like those of deceased popes before him. The white papal miter, the traditional headdress worn by bishops, is on his head, signifying his status as the bishop of Rome. Over his chest lies a pallium, a strip of white wool decorated with crosses that is worn like a collar. It denotes the pope's status as an archbishop. \n Image Francis ordered the funeral rites for popes to be simplified. Credit... The Vatican \n The Swiss Guard \n Two members of the Pontifical Swiss Guard flank Francis's coffin, holding halberds and representing in part the pope's role as the leader of a sovereign state. Over the five centuries since it was formed, the guard has dwindled to what is sometimes called the world's smallest army, but it is still responsible for guarding Vatican territory and accompanying the pope on trips. (There is a separate Vatican City police force responsible for security there.) \n The colors on their uniforms reflect their Renaissance origins, according to the Guard -- blue, red and yellow are the traditional colors of the Medicis, the powerful Italian family that produced four popes. The halberds, too, reflect the Guard's origins: The weapons were used by the Swiss mercenaries who were the order's earliest members. \n The ring \n A rosary was draped over the pope's hands, as one was over the hands of his predecessor, Benedict XVI, when he died in 2023. \n On one of Francis's fingers is a ring -- the one he wore as a bishop, and not the one he used as pope, called the fisherman's ring after St. Peter, the disciple who began as a fisherman and became known as the first pope. That signet ring, which was kissed by pilgrims and used by Francis to seal documents, is destroyed immediately after a pope's death by the camerlengo in order to prevent forgeries. \n A new one will be forged when the next pope is elected. \n Image A rosary was wrapped around the pope's hands. Credit... The Vatican \n Francis will also be buried with a bag containing coins minted by the Vatican during his papacy and a canister with a deed known as a rogito that briefly lists details of his life and papacy. The rogito is read aloud before the coffin is closed. \n Since the 13th century, the embalmed bodies of popes have gone on public view on a raised pedestal. \n Francis, instead, ordered a public viewing with his body in a coffin that will not be on a raised pedestal.",
      "ml_hf_summary": "Pope Francis died on June 30, 2023.  A small ceremony was held at the Chapel of Santa Marta in the Vatican to verify his death and transfer his remains to a simple wooden coffin lined with zinc. The coffin will be buried in a plain tomb at the Papal Basilica of Santa Maria Maggiore in Rome.  Francis's body was dressed in red robes, including a miter and pallium, signifying his status as the bishop of Rome. Two members of the Pontifical Swiss Guard flanked the coffin, while a rosary was draped over his hands. A ring he wore as a bishop will be destroyed after his death. Francis also requested to be buried with coins minted during his papacy and a rogito detailing his life and papacy.  The Vatican has opted for a less elaborate viewing process compared to previous popes, where bodies were displayed on pedestals. \n"
    },
    {
      "title": "Vatican Has a Vacancy, but It Doesn’t Stop Between Popes",
      "link": "https://www.nytimes.com/live/2025/04/21/world/pope-francis-death-news/vatican-business",
      "published": "2025-04-22",
      "summary": "",
      "content": "This photo of Pope Francis' remains in the Chapel of Santa Marta in the Vatican on Monday and those below were released by the Vatican. \n Before mourners in their thousands gather in St. Peter's Square to grieve, before leaders from around the world arrive to pay their respects, and long before cardinals cloister themselves to consider the future, the Vatican holds a small ceremony when a pope dies. \n It did so again around 8 p.m. Monday when, just over 12 hours after he died, Pope Francis was transferred from the rooms of his simple residence, a guesthouse in Vatican City, down to a chapel on the ground floor. \n There, Cardinal Kevin Farrell, the cardinal chamberlain -- known as the camerlengo -- performed a ceremony verifying that the pope was dead, with the declaration of death read aloud. The body was placed in its coffin, with only a small number of Vatican officials and members of the pope's family present. \n These photographs, which were distributed by the Vatican, capture some of the legacy of simplicity that Francis tried to create. There is the spare setting, one unlike the ornate palace rooms where other popes lived and died. And there is the less elaborate single coffin, in line with the rules Francis instituted and his insistence on leading the Roman Catholic Church through an example of humility. \n At the same time, the photos make clear that however much Francis tried to shake up the status quo, he did so cautiously. And so a look at the images reveals objects and figures that embody long-held traditions of the church. \n The coffin \n Last year, Francis simplified the procedures for a papal funeral, specifying that only one coffin, a wooden one lined in zinc, should be used. Past popes were interred in three nesting coffins: one of wood, a second of lead and a third of wood. \n Francis asked to be buried at the Papal Basilica of Santa Maria Maggiore in Rome, where seven other popes are interred -- and not within St. Peter's Basilica or the Vatican Grottoes, where around 90 popes are buried. He requested a simple, undecorated tomb with only the inscription \"Franciscus,\" according to the Vatican. Francis visited Santa Maria Maggiore at the beginning and end of every apostolic trip he took during his 12-year papacy, and went there on his first day as pope in 2013. \n In his will, Francis also specified that \"the tomb must be in the earth; simple, without particular decoration.\" \n A miter and pallium \n Francis's body is dressed in red robes, like those of deceased popes before him. The white papal miter, the traditional headdress worn by bishops, is on his head, signifying his status as the bishop of Rome. Over his chest lies a pallium, a strip of white wool decorated with crosses that is worn like a collar. It denotes the pope's status as an archbishop. \n Image Francis ordered the funeral rites for popes to be simplified. Credit... The Vatican \n The Swiss Guard \n Two members of the Pontifical Swiss Guard flank Francis's coffin, holding halberds and representing in part the pope's role as the leader of a sovereign state. Over the five centuries since it was formed, the guard has dwindled to what is sometimes called the world's smallest army, but it is still responsible for guarding Vatican territory and accompanying the pope on trips. (There is a separate Vatican City police force responsible for security there.) \n The colors on their uniforms reflect their Renaissance origins, according to the Guard -- blue, red and yellow are the traditional colors of the Medicis, the powerful Italian family that produced four popes. The halberds, too, reflect the Guard's origins: The weapons were used by the Swiss mercenaries who were the order's earliest members. \n The ring \n A rosary was draped over the pope's hands, as one was over the hands of his predecessor, Benedict XVI, when he died in 2023. \n On one of Francis's fingers is a ring -- the one he wore as a bishop, and not the one he used as pope, called the fisherman's ring after St. Peter, the disciple who began as a fisherman and became known as the first pope. That signet ring, which was kissed by pilgrims and used by Francis to seal documents, is destroyed immediately after a pope's death by the camerlengo in order to prevent forgeries. \n A new one will be forged when the next pope is elected. \n Image A rosary was wrapped around the pope's hands. Credit... The Vatican \n Francis will also be buried with a bag containing coins minted by the Vatican during his papacy and a canister with a deed known as a rogito that briefly lists details of his life and papacy. The rogito is read aloud before the coffin is closed. \n Since the 13th century, the embalmed bodies of popes have gone on public view on a raised pedestal. \n Francis, instead, ordered a public viewing with his body in a coffin that will not be on a raised pedestal.",
      "ml_hf_summary": "Pope Francis died on June 30, 2023.  A small ceremony was held at the Chapel of Santa Marta in the Vatican to verify his death and transfer his remains to a simple wooden coffin lined with zinc. The coffin was placed in a single, undecorated tomb at the Papal Basilica of Santa Maria Maggiore in Rome.  Francis's body was dressed in red robes, including a miter and pallium, signifying his status as the bishop of Rome. Two members of the Pontifical Swiss Guard flanked the coffin, holding halberds. Francis's remains will be buried with coins minted during his papacy, a rogito detailing his life and papacy, and a bag containing personal items.  Francis simplified funeral procedures for popes, opting for a single coffin and a simple tomb. \n"
    },
    {
      "title": "Who is the dean of the College of Cardinals? (It’s not Ralph Fiennes.)",
      "link": "https://www.nytimes.com/live/2025/04/21/world/pope-francis-death-news/who-is-the-dean-of-the-college-of-cardinals-its-not-ralph-fiennes",
      "published": "2025-04-22",
      "summary": "",
      "content": "This photo of Pope Francis' remains in the Chapel of Santa Marta in the Vatican on Monday and those below were released by the Vatican. \n Before mourners in their thousands gather in St. Peter's Square to grieve, before leaders from around the world arrive to pay their respects, and long before cardinals cloister themselves to consider the future, the Vatican holds a small ceremony when a pope dies. \n It did so again around 8 p.m. Monday when, just over 12 hours after he died, Pope Francis was transferred from the rooms of his simple residence, a guesthouse in Vatican City, down to a chapel on the ground floor. \n There, Cardinal Kevin Farrell, the cardinal chamberlain -- known as the camerlengo -- performed a ceremony verifying that the pope was dead, with the declaration of death read aloud. The body was placed in its coffin, with only a small number of Vatican officials and members of the pope's family present. \n These photographs, which were distributed by the Vatican, capture some of the legacy of simplicity that Francis tried to create. There is the spare setting, one unlike the ornate palace rooms where other popes lived and died. And there is the less elaborate single coffin, in line with the rules Francis instituted and his insistence on leading the Roman Catholic Church through an example of humility. \n At the same time, the photos make clear that however much Francis tried to shake up the status quo, he did so cautiously. And so a look at the images reveals objects and figures that embody long-held traditions of the church. \n The coffin \n Last year, Francis simplified the procedures for a papal funeral, specifying that only one coffin, a wooden one lined in zinc, should be used. Past popes were interred in three nesting coffins: one of wood, a second of lead and a third of wood. \n Francis asked to be buried at the Papal Basilica of Santa Maria Maggiore in Rome, where seven other popes are interred -- and not within St. Peter's Basilica or the Vatican Grottoes, where around 90 popes are buried. He requested a simple, undecorated tomb with only the inscription \"Franciscus,\" according to the Vatican. Francis visited Santa Maria Maggiore at the beginning and end of every apostolic trip he took during his 12-year papacy, and went there on his first day as pope in 2013. \n In his will, Francis also specified that \"the tomb must be in the earth; simple, without particular decoration.\" \n A miter and pallium \n Francis's body is dressed in red robes, like those of deceased popes before him. The white papal miter, the traditional headdress worn by bishops, is on his head, signifying his status as the bishop of Rome. Over his chest lies a pallium, a strip of white wool decorated with crosses that is worn like a collar. It denotes the pope's status as an archbishop. \n Image Francis ordered the funeral rites for popes to be simplified. Credit... The Vatican \n The Swiss Guard \n Two members of the Pontifical Swiss Guard flank Francis's coffin, holding halberds and representing in part the pope's role as the leader of a sovereign state. Over the five centuries since it was formed, the guard has dwindled to what is sometimes called the world's smallest army, but it is still responsible for guarding Vatican territory and accompanying the pope on trips. (There is a separate Vatican City police force responsible for security there.) \n The colors on their uniforms reflect their Renaissance origins, according to the Guard -- blue, red and yellow are the traditional colors of the Medicis, the powerful Italian family that produced four popes. The halberds, too, reflect the Guard's origins: The weapons were used by the Swiss mercenaries who were the order's earliest members. \n The ring \n A rosary was draped over the pope's hands, as one was over the hands of his predecessor, Benedict XVI, when he died in 2023. \n On one of Francis's fingers is a ring -- the one he wore as a bishop, and not the one he used as pope, called the fisherman's ring after St. Peter, the disciple who began as a fisherman and became known as the first pope. That signet ring, which was kissed by pilgrims and used by Francis to seal documents, is destroyed immediately after a pope's death by the camerlengo in order to prevent forgeries. \n A new one will be forged when the next pope is elected. \n Image A rosary was wrapped around the pope's hands. Credit... The Vatican \n Francis will also be buried with a bag containing coins minted by the Vatican during his papacy and a canister with a deed known as a rogito that briefly lists details of his life and papacy. The rogito is read aloud before the coffin is closed. \n Since the 13th century, the embalmed bodies of popes have gone on public view on a raised pedestal. \n Francis, instead, ordered a public viewing with his body in a coffin that will not be on a raised pedestal.",
      "ml_hf_summary": "Pope Francis died on June 30, 2023.  A small ceremony was held at the Chapel of Santa Marta in the Vatican to verify his death and transfer his remains to a simple wooden coffin lined with zinc. The coffin will be buried in a plain tomb at the Papal Basilica of Santa Maria Maggiore in Rome.  Francis's body was dressed in red robes, including a miter and pallium, signifying his status as the bishop of Rome. Two members of the Pontifical Swiss Guard flanked the coffin, while a rosary was draped over his hands. A ring he wore as a bishop will be destroyed after his death. Francis also requested to be buried with coins minted during his papacy and a rogito detailing his life and papacy.  The Vatican has opted for a less elaborate viewing process compared to previous popes, where bodies were displayed on pedestals. \n"
    },
    {
      "title": "3 Takeaways From The New York Times’ Interview With Syria’s New President",
      "link": "https://www.nytimes.com/2025/04/23/world/middleeast/syria-president-nyt-interview-takeaways.html",
      "published": "2025-04-23",
      "summary": "Ahmed al-Shara said his government was discussing military support with Russia and Turkey, appealed for a lifting of sanctions and suggested foreign fighters could earn Syrian citizenship.",
      "content": "All of this involves navigating a far more complex geopolitical situation than he had as a rebel leader governing a tiny slice of Syrian territory. It also comes at a precarious moment of upheaval in the Middle East. \n Mr. al-Shara sat down for an interview this month at the presidential palace in the capital, Damascus, to discuss the challenges his new government faces and his vision for Syria. \n Here are some key takeaways: \n Courting Russia and Turkey \n For decades, the main regional players -- Israel, Iran and Turkey -- and global powers like the United States and Russia have fought for influence in Syria. The country occupies a key geographical crossroads for the entire Middle East. \n Mr. al-Shara said his government was currently negotiating with Turkey and Russia over their military presence in Syria and alluded to the possibility that both could provide military support to his government. \n For Turkey, a longtime political ally of Mr. al-Shara's rebel group, a military agreement with Syria's new authorities could help extend its influence closer to Israel's border, curtail the power of Kurdish armed groups in the north and keep Iran at bay.",
      "ml_hf_summary": "Former Syrian rebel leader, Bashar al-Shara, has formed a new government and is currently negotiating with Russia and Turkey regarding their military presence in Syria.  Al-Shara's government aims to navigate the complex geopolitical landscape of the Middle East, where major powers like Israel, Iran, and Turkey compete for influence. These negotiations could involve Turkey providing support to al-Shara's government, potentially extending its influence near Israel's border, curbing Kurdish groups in the north, and limiting Iranian power.  The situation is particularly complex given Syria's strategic location as a crossroads for the Middle East. \n"
    },
    {
      "title": "Syria’s Jihadist-Turned-President Seeks New Allies",
      "link": "https://www.nytimes.com/2025/04/23/world/middleeast/syria-president-al-shara-interview.html",
      "published": "2025-04-23",
      "summary": "In an interview with The New York Times, President Ahmed al-Shara urged the United States to lift sanctions and alluded to the possibility of future military support from Russia and Turkey.",
      "content": "When Syrian President Ahmed al-Shara sat at the helm of a small, rebel-held enclave in the country's northwest, his alliances were simpler. Turkey was a supporter, while the Assad regime and Iran were his main enemies. Political support from other countries was welcome, but their financial aid was not essential to survive. \n Since his rebel coalition toppled President Bashar al-Assad in December, Mr. al-Shara, who spoke to The New York Times this month, has been navigating more complex geopolitical waters. And that foreign support is not just welcome, it is critical to his government's survival. \n To bring Syria's economy back from the brink, he must persuade U.S. and other Western officials wary of his jihadist past to lift sanctions. To keep the country from plunging back into civil war, he needs military assistance to build a new army. And to keep the government functioning and the country from spinning into total disarray, he needs foreign financing to pay public workers.",
      "ml_hf_summary": "Syrian President Ahmed al-Shara, who led a rebel coalition that ousted President Bashar al-Assad in December, now faces complex geopolitical challenges.  His government relies on foreign support for survival, particularly financial aid from Western countries. Al-Shara's goal is to revive Syria's economy and prevent civil war by securing sanctions relief from the U.S. and other nations. He also requires military assistance to build a new army and funding to pay public workers.  These demands highlight the critical role of international support in maintaining stability and preventing further conflict within Syria. \n"
    },
    {
      "title": "What to Know About the Tensions Over Kashmir",
      "link": "https://www.nytimes.com/2025/04/23/world/asia/kashmir-terrorist-attack-explainer.html",
      "published": "2025-04-23",
      "summary": "A terrorist attack in the disputed territory in 2019 brought India and Pakistan to the verge of war. There are fears Tuesday’s violence could do the same.",
      "content": "Militants in Kashmir killed at least 26 tourists and injured many others on Tuesday in the worst assault on civilians in the Indian-administered territory in years, which India has called a terrorist attack. \n No group has immediately claimed responsibility for the shooting, which took place near the town of Pahalgam in the picturesque Baisaran Valley. But in the past, India blamed Pakistan for similar attacks. One such violent episode in 2019 brought the two nations to the brink of war. \n Here is what to know about the tensions between India and Pakistan over Kashmir. \n Kashmir is a disputed territory. \n Kashmir, a scenic and ethnically diverse valley in the Himalayan mountains, has been racked by violence for generations. \n Its fate was left undecided in 1947, when the British divided India, its former colony, into two countries. One was Pakistan, which has a Muslim majority. The other, made up mostly of Hindus, retained the name India.",
      "ml_hf_summary": "On Tuesday, militants in Kashmir killed at least 26 tourists and injured many others in an attack near Pahalgam, marking one of the deadliest civilian attacks in years within the Indian-administered territory.  The attack has been labeled a terrorist act by India, but no group has claimed responsibility yet. This incident follows a pattern of violence in Kashmir, with past incidents leading to tensions between India and Pakistan. The disputed territory of Kashmir was divided in 1947 after British rule, resulting in two nations: one predominantly Muslim (Pakistan) and the other mostly Hindu (India).  \n"
    },
    {
      "title": "At Least 24 Tourists Gunned Down by Militants in Kashmir",
      "link": "https://www.nytimes.com/2025/04/22/world/asia/kashmir-terrorist-attack.html",
      "published": "2025-04-22",
      "summary": "Prime Minister Narendra Modi of India called the shooting, the worst against civilians in the region for years, a “terror attack” and vowed to bring the perpetrators to justice.",
      "content": "The tourists had come from several Indian states, though not all of their identities have been released. \n Adil Chapri, a taxi driver, said tourists had begun swarming to the Himalayan region just as temperatures soared in the rest of the country. There was a \"mad rush\" when he drove to Baisaran to drop some tourists off, Mr. Chapri said. \n He said that a hotelier friend of his had told him after the attack that guides who offer pony rides to tourists asked him not to send any more tourists their way. \n India and Pakistan have fought three wars over Kashmir. India has long accused Pakistan of fomenting separatist violence in the Muslim-majority region. Scores of civilians, including Hindu pilgrims, have been killed by militant groups over the decades. \n The bloodshed has declined in recent years, after Mr. Modi revoked Kashmir's special status as a semiautonomous region in 2019 and his government began directly administering the territory from New Delhi.",
      "ml_hf_summary": "A series of attacks targeting tourists in the Himalayan region of Kashmir have occurred, with the perpetrators being unidentified.  The attacks took place amidst a surge in tourist activity to the area as temperatures rose across India.  Local taxi drivers reported a \"mad rush\" of tourists visiting Baisaran, and guides for pony rides are reportedly refusing further bookings due to safety concerns. The region has a history of conflict between India and Pakistan over Kashmir, with militant groups causing civilian casualties.  Following the revocation of Kashmir's special status in 2019, violence has decreased. \n"
    },
    {
      "title": "Killing of Civilians Near Pahalgam in Kashmir Shatters Illusion of Calm",
      "link": "https://www.nytimes.com/2025/04/23/world/asia/kashmir-attack-india-pakistan.html",
      "published": "2025-04-23",
      "summary": "India announced a series of retaliatory actions, and hinted at the possibility of more, in response to what it called Pakistan’s support of terrorism on Indian soil.",
      "content": "One day after militants killed 26 people in a tourist group in Kashmir, the Indian government on Wednesday pointed a finger at its archnemesis, Pakistan, announcing a series of punitive actions against its neighbor and hinting at further retaliation. \n India has not officially blamed any group for the massacre, in which all but one of the dead were Indian citizens. But it described the aggressive moves outlined on Wednesday as a response to Pakistan's support of terrorist attacks on Indian soil. \n The Indian government suspended its participation in an important water treaty that since the 1960s has governed the flow of rivers that Pakistan's irrigation system depends on. India declared a key land border between the two nations shut. And it announced that it was downgrading diplomatic ties, expelling Pakistan's military advisers from the country's New Delhi mission, and further restricting already-limited visas for Pakistani citizens. \n The decision came at a cabinet meeting presided over by Prime Minister Narendra Modi, as coffins of the civilians slaughtered in the picturesque Kashmir Valley began arriving to emotional scenes around the country. The prime minister was briefed on \"the cross-border linkages of the terrorist attack,\" said India's foreign secretary, Vikram Misri, without offering details.",
      "ml_hf_summary": "Following a militant attack that killed 26 tourists in Kashmir, India suspended its participation in the Indus Water Treaty and closed its border with Pakistan.  India also downgraded diplomatic ties by expelling Pakistani military advisers from their New Delhi mission and restricting visas for Pakistani citizens. These actions were announced after a cabinet meeting led by Prime Minister Narendra Modi, who was briefed on the attack's connection to Pakistan. The Indian government has not officially blamed any group for the massacre but described the attacks as a response to Pakistan's support of terrorist activities in India. \n"
    },
    {
      "title": "Francis, the First Latin American Pope, Dies at 88",
      "link": "https://www.nytimes.com/2025/04/21/world/europe/pope-francis-dead.html",
      "published": "2025-04-22",
      "summary": "After decades of conservative leadership, Francis tried to reset the course of the Roman Catholic Church, emphasizing inclusion and care for the marginalized over doctrinal purity.",
      "content": "Conservative Catholics accused him of diluting church teachings and never stopped rallying against him. Simmering dissent periodically exploded into view in almost medieval fashion, with talk of schisms and heresy. \n But Francis also disappointed many liberals, who hoped that he might introduce progressive policies. His openness to frank discussion gave oxygen to debates about long-taboo subjects, including priestly celibacy, communion for divorced and remarried people, and greater roles for women in the church. While he opened doors to talking about such issues, he tended to balk at making major decisions. \n \"We are often chained like Peter in the prison of habit,\" he said of the church in 2022 in a speech in St. Peter's Basilica. \"Scared by change and tied to the chain of our customs.\" \n A New Style \n Perhaps the most surprising aspect of his papacy was that he became pope at all. \n Francis was elected in March 2013 after the resignation of Benedict, the first pontiff to step down in nearly six centuries, amid turmoil and intrigue about secret lobbies and financial chicanery. The cardinal electors sought a reformer with a strong administrative hand, but few anticipated how Francis, then the 76-year-old archbishop of Buenos Aires, would blend reformist zeal and folksy charm in a push to clean house and transform the church. \n \"Buona sera,\" good evening, Francis announced to the faithful in his first remarks as pope from the balcony overlooking St. Peter's Square, breaking the ice with unaffected style. He joked about being from Argentina, noting that in fulfilling their duty to produce a pope, \"it seems that my brother cardinals have gone almost to the ends of the Earth to get him.\"",
      "ml_hf_summary": "Pope Francis was elected in March 2013 following the resignation of Pope Benedict XVI.  He is known for his reformist approach and blending of traditional Catholic teachings with modern perspectives.  Francis' papacy has sparked debate on topics such as priestly celibacy, communion for divorced individuals, and women's roles within the church. Despite opening doors to discussion on these issues, he has been hesitant to make major decisions. Francis' election was marked by turmoil and intrigue surrounding financial practices and secret lobbies. \n"
    },
    {
      "title": "Catholics Expected a Revolution From Pope Francis, Just Not the One He Gave Them",
      "link": "https://www.nytimes.com/2025/04/23/world/europe/pope-francis-catholic-church-legacy.html",
      "published": "2025-04-23",
      "summary": "Liberals hoped he’d ordain women or allow gay marriage. Conservatives thought he’d tear up Church doctrine. But his papacy favored debate over radical action.",
      "content": "When Pope Francis convened Roman Catholic bishops at the Vatican in 2019 to discuss the ordination of married men in remote parts of South America, the meeting raised expectations about the possibility of revolutionizing the celibate priesthood. \n The bishops recommended he do it, and Francis himself had long said he wanted change in the church to come from the bottom up. \n But Francis ultimately balked, deciding that the church wasn't yet ready to lift a roughly 1,000-year-old restriction. Many of his supporters, who expected him to be a pope of radical change, felt let down. \n It was a salient example of how Francis, who died on Monday at 88, was a pope of great, often outsized, expectations. His revolutionary and freewheeling style led Catholics across the spectrum to invest him with their most ambitious -- at times unrealistic -- hopes and fears, sometimes independent of what he said or did.",
      "ml_hf_summary": "Pope Francis convened Roman Catholic bishops in 2019 to discuss the possibility of ordaining married men in remote South American areas.  The bishops recommended this change, reflecting a desire for reform from within the church. Pope Francis ultimately rejected this proposal, citing that the church was not yet ready to lift the long-standing celibacy requirement for priests. This decision disappointed many who expected him to implement significant changes. Despite his efforts to promote change from below, Pope Francis's legacy is marked by a combination of bold expectations and sometimes unmet promises. \n"
    },
    {
      "title": "Pope Francis Will Be Buried in Santa Maria Maggiore Basilica in Rome",
      "link": "https://www.nytimes.com/2025/04/22/world/europe/pope-francis-buried-rome-santa-maria-maggiore-basilica.html",
      "published": "2025-04-23",
      "summary": "For his final resting place, Francis chose simplicity in a place of beauty.",
      "content": "For his final resting place, Francis asked for the same simplicity with which he had lived his life. In his will, which the Vatican released Monday, Francis asked to be buried \"in the earth,\" in a simple, undecorated tomb with only the inscription \"Franciscus.\" \n He also asked that his \"last earthly journey\" end at the \"very ancient Marian shrine,\" of Santa Maria Maggiore, or St. Mary Major, in Rome. \n With St. Peter's, St. John Lateran, St. Paul Outside the Walls, it is one of four basilicas in Rome granted special status by the pope. In his will, he wrote that he had visited the Marian basilica at the beginning and the end of every apostolic trip he took during his 12-year papacy. \n He asked that his tomb be placed in the aisle next to the Pauline Chapel, where an important Marian icon, the Salus Populi Romani, is located. \n According to the basilica's website, since the Jesuit order was founded, Jesuits have \"fostered devotion to the icon\" and it was an image Francis was particularly devoted to. On his first day as pope in 2013, he slipped out of the Vatican to pray at the basilica.",
      "ml_hf_summary": "Pope Francis's will specifies a simple burial in an undecorated tomb with only the inscription \"Franciscus,\" and requests his final journey end at Santa Maria Maggiore (St. Mary Major) basilica in Rome.  He visited this basilica at the beginning and end of every apostolic trip during his 12-year papacy, according to his will. The basilica is one of four basilicas in Rome granted special status by the pope, and Francis's tomb will be placed in the aisle next to the Pauline Chapel, where a Marian icon, Salus Populi Romani, is located.  The Jesuit order has fostered devotion to this icon since its founding, and Pope Francis visited it on his first day as pope in 2013. \n"
    },
    {
      "title": "Trump Shuns Europe, and Its Defense Industry Tries to Capitalize",
      "link": "https://www.nytimes.com/2025/04/22/world/europe/europe-weapons-investment.html",
      "published": "2025-04-22",
      "summary": "Europe’s weapons makers are prospering as the continent reconsiders its post-Cold War stance of favoring domestic investment over military spending.",
      "content": "Fresh off the assembly line, the two Eurofighter jets screamed down Turin's runway at 186 miles per hour before lifting off against the snow-capped Alps. Their destination was Kuwait, a six-hour flight away. \n The Kuwaiti military is the first foreign customer to buy the supersonic jets from Leonardo, the Italian defense contractor that manufactures the Eurofighter as part of a consortium with producers in Britain, Germany and Spain. More such deals are likely, as Europe looks inward to build its defenses amid President Trump's trade war and his demands that Europe stop relying on the United States for its security. \n Demand for weapons spiked in Europe after Russia invaded Ukraine in 2022 and has persisted. With Europe producing more and better weapons, it is also looking to sell its wares more broadly on the global market. \n The new emphasis on arms production is evidence of a broader generational shift in Europe, which wound down its militaries after the Cold War in favor of social investments.",
      "ml_hf_summary": "Two Eurofighter jets manufactured by Leonardo were delivered to Kuwait for deployment. This marks the first foreign customer purchase of the supersonic jets from Leonardo, with more deals expected as European nations seek to bolster their defense capabilities independently of the United States.  The demand for weapons in Europe has surged following Russia's invasion of Ukraine in 2022 and is continuing to grow.  This trend reflects a shift towards increased military production within Europe, which aims to diversify its defense strategies and reduce reliance on external security providers. \n"
    },
    {
      "title": "‘The Two Popes,’ ‘Conclave’ and Francis’ Autobiography: The Papacy in Recent Culture",
      "link": "https://www.nytimes.com/2025/04/22/world/europe/francis-two-popes-movie-book.html",
      "published": "2025-04-22",
      "summary": "The Vatican — with its politics, its pageantry and its power — has long been a favorite subject for artists and thinkers.",
      "content": "Catholicism, for better or worse, has produced some of the greatest art in human history: Soaring cathedrals, stunning paintings and endless writings about humanity itself. \n Now, as the world reacts to the death of Pope Francis on Monday at age 88, here are some suggestions for an artistic reflection on the papacy and the pontiff's complex legacy. \n \"The Two Popes\" (movie) \n In the first few minutes of the 2019 film, cardinals assemble in Rome after the death of Pope John Paul II. It's all very somber. \n Then, in a bathroom, someone starts whistling. \n \"What's the hymn you are whistling?\" Cardinal Joseph Ratzinger (a brooding Anthony Hopkins) asks the whistler, speaking in Latin. \n \"Dancing Queen,\" answers Cardinal Jorge Bergoglio, who was played by Jonathan Pryce and would eventually become Pope Francis. \n Ratzinger looks up, his shocked reaction reflected in the bathroom mirror as Bergoglio washes his hands. \n \"By ABBA,\" Bergoglio says, clarifying. \n The film chronicles their friction, faith and friendship -- and also offers a mini-biopic of Francis. It was directed by Fernando Meirelles (\"City of God,\" \"The Constant Gardener\"). In the movie, Ratzinger became Pope Benedict XVI, then later shocked the world by resigning. And Bergoglio, who was the runner-up to his election, became Francis in an unusual power transfer. \n \"The filmmakers want us to see Bergoglio as a redemptive figure, a man who has faced up to his own failures with humility and whose ascension to the papacy portends an era of reform and renewal,\" A.O. Scott wrote in his review. \n Watch: \"The Two Popes\" is on Netflix. \n \"Hope: The Autobiography\" (book) \n Francis published his autobiography in January. He vividly writes about his childhood in Buenos Aires, but offers few insights into his papacy. \n Francis traces his strong support for migrants and his abhorrence of war to his own family. His parents immigrated to Argentina from Italy, and his grandfather lived through World War I. He writes about his youth with feeling, chronicling his \"bag-lady\" aunt, among other colorful relatives, as well as the migrants and prostitutes. \n But although his early years shine bright in \"Hope,\" the book is flatter on his time in the Vatican. The most newsworthy part concerned his time in Iraq. Francis wrote that he had survived two foiled assassination attempts, which Iraqi officials have denied. \n Read: The New York Times published an excerpt from the book, published by Penguin, in which Francis advocated for finding faith in humor. \n \"Conclave\" (movie) \n The 2024 movie, directed by Edward Berger, gave viewers a rare glimpse inside the Sistine Chapel during the selection of the next pope. \n That will begin soon, when cardinals younger than 80 gather in a conclave to choose a leader. \n The filmmakers spent a lot of effort trying to get the details right -- the process of destroying a pope's ring when he dies, the Latin oaths, the threading of the paper ballots and the need to sweep the Sistine Chapel for listening devices. \n Manohla Dargis called it a \"sly, sleek election potboiler about the selection of a new Catholic pope\" in her review for The New York Times. \n Watch: Berger narrates a sequence in the film, which stars Ralph Fiennes. It's available on many streaming services.",
      "ml_hf_summary": "Pope Francis passed away at age 88 on Monday.  \"The Two Popes,\" a 2019 film directed by Fernando Meirelles, chronicles the relationship between Pope John Paul II and Cardinal Jorge Bergoglio (who would become Pope Francis). The film depicts their complex dynamic, including Bergoglio's unexpected ascension to the papacy after the death of John Paul II.  Francis also published his autobiography \"Hope: The Autobiography\" in January, which details his childhood experiences and beliefs but offers limited insights into his papacy. A documentary titled \"Conclave,\" directed by Edward Berger, will provide a glimpse into the selection process for the next pope. \n"
    },
    {
      "title": "Even in Sickness, Pope Francis Reached Out to Gaza’s Christians",
      "link": "https://www.nytimes.com/2025/04/22/world/middleeast/pope-francis-gaza.html",
      "published": "2025-04-22",
      "summary": "For months, the pontiff spoke by telephone almost every night with people sheltering in a Catholic church in the battered enclave, a ritual he tried to keep up in the hospital.",
      "content": "Even as Pope Francis was hospitalized in the last months of his life, he still occasionally kept up what had been a near-nightly ritual: calling the hundreds of Palestinian Christians huddling in the only Roman Catholic church in the war-torn Gaza Strip. \n Amid fear and bombardment, the Rev. Gabriel Romanelli, the Argentine parish priest at Holy Family Church in Gaza City, had received a call from Francis almost every evening last year to check in on the well-being of his flock in the devastated enclave. \n It was an unusual amount of time for the spiritual leader of more than one billion Catholics to spend with such a small community. But Francis had long shown particular sympathy for Palestinian suffering, frequently calling for a cease-fire in Gaza. \n The video calls generally lasted for a few minutes, Father Romanelli said. He said that the calls had been less frequent after the pope became ill, but that they remained important for members of the community. Francis would inquire about the situation at the church, and Palestinians who had sought shelter there would ask for a blessing or voice a message that they hoped he would convey to world leaders. \n \"The evenings became known as the pope's time,\" Father Romanelli said. \"People would gather, even the young or teenagers, to see him.\"",
      "ml_hf_summary": "Pope Francis regularly called Palestinian Christians in Gaza City's Holy Family Church almost every evening for several months before his hospitalization.  These calls, lasting a few minutes, were initiated by Father Gabriel Romanelli, who received them from the Pope despite the ongoing conflict and Pope Francis' declining health. The calls provided comfort to the community during the war-torn enclave's devastation and allowed Palestinians seeking refuge at the church to express their hopes for peace and world leaders' intervention.  Pope Francis' frequent calls for a cease-fire in Gaza highlight his long-standing concern for Palestinian suffering. \n"
    },
    {
      "title": "Russia and Ukraine, Under Trump Pressure, Signal Openness to Direct Talks",
      "link": "https://www.nytimes.com/2025/04/22/world/europe/russia-ukraine-putin-zelensky.html",
      "published": "2025-04-22",
      "summary": "An unusual public back-and-forth suggested that both sides in the war were eager to at least appear interested in negotiations.",
      "content": "Both the Kremlin and President Volodymyr Zelensky of Ukraine suggested this week that they would be open to direct negotiations, making new but tentative diplomatic overtures as President Trump pushes for a peace deal. \n Mr. Zelensky said on social media late Monday that Ukraine was \"ready for any conversation\" about a cease-fire that would halt strikes on civilian infrastructure. Dmitri S. Peskov, the Kremlin's spokesman, said on Tuesday that there were \"nuances\" in the Ukrainian proposal \"that it makes sense to discuss\" with Kyiv. \n While Mr. Peskov said there were no concrete plans yet for direct talks between Moscow and Kyiv, the unusual public back-and-forth showed how both sides in the three-year war now seem eager to at least appear interested in negotiations -- not least because of Mr. Trump's eagerness for a deal to end the war. \n The American diplomatic push is expected to continue on Wednesday in London, where Mr. Zelensky said a Ukrainian delegation would meet with U.S. and European officials. Steve Witkoff, a White House envoy who has met with President Vladimir V. Putin three times since February, is expected to visit Moscow again later this week, the Russian state news agency Tass reported.",
      "ml_hf_summary": "President Zelensky of Ukraine stated his willingness for direct negotiations regarding a ceasefire and halting strikes on civilian infrastructure.  Dmitry Peskov, Kremlin spokesperson, acknowledged \"nuances\" in the Ukrainian proposal that warrant discussion. While no concrete plans for direct talks exist, both sides have shown interest in diplomacy, particularly due to former President Trump's push for a peace deal. A Ukrainian delegation will meet with U.S. and European officials in London on Wednesday, while Steve Witkoff, a White House envoy, is expected to visit Moscow later this week. \n"
    },
    {
      "title": "Venezuelan Immigrant Deported by Trump Administration Has Disappeared",
      "link": "https://www.nytimes.com/2025/04/22/us/venezuela-immigrant-disappear-deport-ice.html",
      "published": "2025-04-22",
      "summary": "The Venezuelan man did not appear on a list of people sent to a prison in El Salvador, and his family and friends had no idea of his whereabouts.",
      "content": "But Mr. Prada has not been heard from or seen. He is not on a list of 238 people who were deported to El Salvador that day. He does not appear in the photos and videos released by the authorities of shackled men with shaved heads. \n Image Mr. Prada in 2021. Credit... Hugo Prada \n \"He has simply disappeared,\" said Javier, a friend in Chicago, the last person with whom Mr. Prada had contact. The friend spoke about Mr. Prada on condition that he be identified only by his middle name, out of fear that he too could be targeted by the immigration authorities. \n Mr. Prada's brother, Hugo Prada, who is living in Venezuela, has also been trying to learn what happened. \"We know nothing, nothing,\" he said. \n Mr. Prada's disappearance has created concerns that more immigrants have been deported to El Salvador than previously known. It also raises the question of whether some deportees may have been sent to other countries with no record of it. U.S. authorities confirmed that he was removed from the United States. But to where? \n \"Ricardo's story by itself is incredibly tragic -- and we don't know how many Ricardos there are,\" said Ben Levey, a staff attorney with the National Immigrant Justice Center who tried to locate Mr. Prada. Immigration and Customs Enforcement officials ultimately confirmed to him that he had been deported but did not divulge his destination",
      "ml_hf_summary": "Ricardo Prada, an immigrant from the United States, disappeared after being deported from the US to El Salvador on a date unknown.  He is not listed among the deportees who were sent to El Salvador or in official photos and videos released by authorities. His brother Hugo, living in Venezuela, has been unable to learn any information about his whereabouts. The disappearance of Mr. Prada raises concerns that more immigrants may have been deported than previously known, and questions remain regarding the destination of those deported.  U.S. Immigration and Customs Enforcement officials confirmed Mr. Prada's deportation but did not disclose his final location. \n"
    },
    {
      "title": "After Trump Spares Apple, Other Businesses Want a Tariffs Break",
      "link": "https://www.nytimes.com/2025/04/22/us/politics/trump-tariffs-relief-apple.html",
      "published": "2025-04-22",
      "summary": "Retail executives huddled with the president amid fears that tariffs could result in higher prices.",
      "content": "On Monday, Vice President JD Vance met in India with the country's prime minister, Narendra Modi, as the White House races to try to clinch \"90 deals in 90 days,\" as some of Mr. Trump's aides have said. Without a deal, India could face a 26 percent \"reciprocal\" tariff rate. \n Even without any trade agreements in hand, Mr. Trump has highlighted his approach as a success, boasting that his policies have helped to attract trillions of dollars in private investments from companies including Apple, OpenAI and Nvidia. \n \"Since our announcement of LIBERATION DAY, many World Leaders and Business Executives have come to me asking for relief from Tariffs,\" the president posted on Truth Social on Sunday. \"It's good to see that the World knows we are serious, because WE ARE!\" \n Mr. Trump added, \"But for those who want the easiest path: Come to America, and build in America!\" \n But the reality is more complicated. Early indicators suggest that some companies have actually slowed their spending out of concern that tariffs could result in higher input prices. One survey from the Federal Reserve Bank of New York, released in April, found that manufacturing activity in the region had declined for the second consecutive month while firms generally said they expected \"conditions to worsen in the months ahead.\" \n Some business groups have echoed those fears, warning the White House that U.S. firms may not be able to meet their own domestic investment targets if the economics worsen. These companies may not be able to create new factories and jobs, as they have promised, without stable financial markets, available labor and access to raw materials and machinery -- all inputs that may be made more expensive by the president's recent tariffs.",
      "ml_hf_summary": "Vice President JD Vance met with Indian Prime Minister Narendra Modi in a bid to secure trade deals.  President Trump has claimed his tariff policies have attracted trillions of dollars in private investment, but early indicators suggest some companies are slowing spending due to potential increased input costs. The Federal Reserve Bank of New York reported declining manufacturing activity and expected worsening conditions. Business groups warn that the tariffs may hinder domestic investment targets without stable financial markets, available labor, and access to raw materials and machinery. \n"
    },
    {
      "title": "Tuesday Briefing: Tributes for Pope Francis",
      "link": "https://www.nytimes.com/2025/04/22/briefing/pope-francis-india-us-israel.html",
      "published": "2025-04-22",
      "summary": "Plus, making a difference on Earth Day.",
      "content": "The world paid tribute to Pope Francis \n Mourners, some in tears, gathered yesterday in St. Peter's Square after the Vatican announced the death of Pope Francis at age 88. The leadership of the Roman Catholic Church now faces a critical decision: choose a new pope who will follow his welcoming and global approach, or restore the more doctrinaire path of his predecessors. Here's the latest. \n Tributes poured in from global leaders. President Jose Ramos-Horta of East Timor said that Francis' death was the \"greatest loss for humanity at a time when the world is in turmoil for lack of wise and compassionate leadership.\" \n Here is an account of Francis' final days, as well as his full obituary. \n A report released by the Vatican listed the causes of death as a cerebral stroke, followed by a coma and \"irreversible cardiocirculatory collapse.\" He kept a busy schedule until the day before his death, defying doctors' orders to rest. Here's what else to know. \n A funeral date has not been set, but the Vatican said a public viewing might take place as early as tomorrow.",
      "ml_hf_summary": "Pope Francis died at age 88 on [Date] after suffering from a cerebral stroke and cardiocirculatory collapse.  The Vatican reported his death was caused by a combination of these events.  Global leaders, including President José Ramos-Horta of East Timor, expressed their condolences for the loss of Pope Francis' leadership during a time of global turmoil. The Vatican has not yet set a funeral date but a public viewing may take place as early as tomorrow. \n"
    },
    {
      "title": "Pope Francis’ Death Silences a Voice for the Voiceless",
      "link": "https://www.nytimes.com/2025/04/22/world/europe/pope-francis-politics-advocate.html",
      "published": "2025-04-22",
      "summary": "As democratic values and alliances were being turned upside down, the pope was a consistent moral guidepost. Who can play that role now?",
      "content": "As the world Pope Francis consistently called for -- one that cared for migrants, safeguarded the health of the planet and protected human rights -- collapsed around him in recent years, Francis would react to the newest setback by going quiet. \n When Francis was \"disappointed by certain political choices that governments are making,\" Archbishop Paul Gallagher, the Vatican's foreign minister and a close aide to Francis, said, \"Silence comes upon him.\" \n That silence is now permanent. The death of Pope Francis on Monday morning has now deprived the world of a persistent advocate for the downtrodden. As mass deportations become the norm, authoritarianism expands and the alliances that governed the post-World War II era are turned upside down, it is clear that Francis has left behind a world quite unlike the one he joined as pope in 2013.",
      "ml_hf_summary": "Pope Francis passed away on Monday morning.  He was known for advocating for migrants, environmental protection, and human rights throughout his papacy. Archbishop Paul Gallagher, the Vatican's foreign minister, described Pope Francis' reaction to political setbacks as \"silence.\" The world is now facing a significant shift in global affairs with the death of Pope Francis, who witnessed the decline of international cooperation and the rise of authoritarianism.  \n"
    },
    {
      "title": "Syria Makes Rare Arrests of Palestinian Militant Group Leaders",
      "link": "https://www.nytimes.com/2025/04/22/world/europe/syria-arrests-palestinian-militant-leaders.html",
      "published": "2025-04-22",
      "summary": "The arrests marked a pendulum swing for the government. Under the Assad regime, Syria served as a base of operations for several Palestinian armed factions.",
      "content": "Syrian authorities made a rare arrest of two senior members of the Palestinian armed faction Islamic Jihad, the group said on Tuesday, a move that signaled the shifting of alliances in the Middle East. \n The group, Islamic Jihad, is an Iran-backed ally of Hamas that took part in the Oct. 7, 2023, attack on Israel from Gaza, which triggered the war there. The group said on Tuesday that Khaled Khaled, its leader in Syria, and Yasser al-Zafari, another senior figure, had been in Syrian custody for five days. \n Syria's interior ministry confirmed their detention, but provided no reason for their arrest. Islamic Jihad said the two officials had been detained \"without any explanation\" and \"in a manner we would not have hoped to see from brothers.\" \n The arrest of senior Palestinian officials signaled a pendulum swing for Syria, which under President Bashar al-Assad was closely allied with Iran and historically served as a critical base of operations for several Palestinian armed groups.",
      "ml_hf_summary": "Islamic Jihad, an Iranian-backed group that participated in the October 7th attack on Israel from Gaza, announced the arrest of Khaled Khaled, its leader in Syria, and Yasser al-Zafari, another senior figure.  The arrests were made by Syrian authorities without explanation, according to Islamic Jihad. The two officials have been detained for five days. This event signifies a shift in alliances within the Middle East as Syria's relationship with Iran has evolved. Previously, Syria served as a critical base of operations for several Palestinian armed groups, including Hamas. \n"
    },
    {
      "title": "Scott Bessent Accuses IMF and World Bank of ‘Mission Creep’",
      "link": "https://www.nytimes.com/2025/04/23/business/bessent-imf-world-bank-overhauls.html",
      "published": "2025-04-23",
      "summary": "Treasury Secretary Scott Bessent argued in a speech that the multilateral economic institutions have veered away from their missions.",
      "content": "Treasury Secretary Scott Bessent on Wednesday called for major overhauls to the missions of the International Monetary Fund and the World Bank but said the United States remained committed to maintaining its leadership role at the global economic institutions. \n The comments, at a speech on the sidelines of the spring meetings of the I.M.F. and the World Bank, come at a moment of concern among policymakers that the Trump administration could withdraw the United States entirely from the fund and the bank. \n The United States has upended the global trading system in recent months, and the views of the Trump administration on climate change, international development and economic equity are often at odds with those of the other nations that are shareholders in the global institutions. \n On Tuesday, the I.M.F. downgraded its outlook for growth globally and in the United States as a result of President Trump's punishing tariffs. Trade tension between the United States and China, the world's largest economies, threaten to weigh on output this year and next.",
      "ml_hf_summary": "Treasury Secretary Scott Bessent called for significant changes to the International Monetary Fund (IMF) and World Bank's missions during a speech at the spring meetings of these institutions.  He emphasized the US commitment to maintaining its leadership role despite concerns about potential withdrawal from the IMF and World Bank, particularly in light of recent trade tensions and differing views on global economic policies between the US and other nations. The IMF downgraded its global growth outlook due to President Trump's tariffs and ongoing trade disputes with China, which are expected to negatively impact output this year and next. \n"
    },
    {
      "title": "Vance Outlines U.S. Plan for Ukraine That Sharply Favors Russia",
      "link": "https://www.nytimes.com/2025/04/23/world/europe/ukraine-cease-fire-talks-london.html",
      "published": "2025-04-23",
      "summary": "Vice President JD Vance said the cease-fire plan would freeze territory along the current front lines of the Russia-Ukraine conflict and that the U.S. would “walk away” if both parties did not agree.",
      "content": "Vice President JD Vance on Wednesday called on Ukraine to accept an American peace proposal that closely aligns with longstanding Russian goals, including a \"freeze\" of territorial lines in the three-year war, acceptance of the annexation of Crimea by Russia and a prohibition on Ukraine becoming part of the NATO alliance. \n It was the first time a U.S. official had publicly laid out a plan to end the war that favors Russia in such stark terms. \n A peace plan that leaves Russian forces deep inside eastern Ukraine would be welcome news in Moscow. President Vladimir V. Putin has said for almost year that he would accept a cease-fire in which Ukraine withdraws troops from the four regions that Russia has claimed as its own and drops its aspirations to join NATO. \n The comments by the vice president appeared designed to increase pressure on President Volodymyr Zelensky of Ukraine, who has long refused to accept Russian's occupation of his country's lands, including the seizure of Crimea in 2014 and territory taken by Russia after it invaded Ukraine in early 2022.",
      "ml_hf_summary": "Vice President JD Vance proposed a peace plan for the war in Ukraine that aligns with Russian goals. The plan includes a territorial freeze, acceptance of Crimea's annexation by Russia, and prohibition on Ukraine joining NATO. This is the first time a U.S. official has publicly presented such a plan favoring Russia.  President Vladimir Putin has previously stated his willingness to accept a ceasefire where Ukraine withdraws from four occupied regions and abandons its NATO aspirations. Vance's proposal aims to increase pressure on Ukrainian President Volodymyr Zelensky, who has consistently opposed Russian occupation of Ukrainian territories. \n"
    },
    {
      "title": "Prelude to a Funeral",
      "link": "https://www.nytimes.com/2025/04/23/world/europe/pope-francis-death-vatican-rituals.html",
      "published": "2025-04-23",
      "summary": "A single image captures the subtle changes in how the Roman Catholic Church buries a pope.",
      "content": "In One Image Prelude to a Funeral By Tomas Munita and Peter Robins \n The rituals of the Vatican can seem timeless, impervious to change. But look closer. \n The Swiss Guards accompanying Pope Francis on his final journey still wear the colors of the Medici family, 420 years after the last Medici pope. \n But the coffin has changed. This one is far plainer than the nested trio long used by popes -- a simplification ordered by Francis himself. \n And while the world has long followed papal transitions closely, much of it now does so in real time. \n Still, many of the faithful wanted to see Francis with their own eyes one last time on earth. Some came thousands of miles to throng St. Peter's Square. \n Even lost traditions leave traces. These pallbearers are a remnant of the papal sediari, who once carried the pope on a throne at public appearances. That ended under Pope John Paul II.",
      "ml_hf_summary": "Pope Francis' funeral procession saw traditional elements like the Swiss Guards in their Medici-era uniforms and a simpler coffin compared to previous ones. The simplification was ordered by Pope Francis himself.  Thousands of people traveled from far distances to witness his final farewell at St. Peter’s Square, reflecting the global interest in papal transitions.  The pallbearers were remnants of the papal sediari tradition, which once carried the pope on a throne during public appearances and ended under Pope John Paul II. \n"
    },
    {
      "title": "Jordan Cracks Down on Muslim Brotherhood",
      "link": "https://www.nytimes.com/2025/04/23/world/middleeast/jordan-muslim-brotherhood.html",
      "published": "2025-04-23",
      "summary": "The Arab monarchy had already taken steps toward disbanding the Islamist group in a 2020 court decision, but said it would now move to completely ban its activities.",
      "content": "Jordan's Interior Ministry said on Wednesday that it would enforce a widespread ban on the activities of the Muslim Brotherhood, an Islamist group that has been outlawed in several other Arab countries. \n The announcement came a week after Jordanian security services said that they had arrested 16 people accused of plotting threats to national security involving weapons, explosives and plans to manufacture drones and train combatants, both at home and abroad. \n The Jordanian interior minister, Mazin Al Farrayeh, suggested in a televised news conference on Wednesday that the plot was connected to the group, saying \"elements of the Muslim Brotherhood\" had \"worked in darkness to carry out activities that undermine stability and tamper with security and national unity.\" \n He said explosives and weapons had been discovered and added that the night the plot was announced, the Muslim Brotherhood had \"tried to smuggle and destroy a large number of documents.\" He also said authorities had discovered an explosives manufacturing operation connected to a son of one of the group's leaders.",
      "ml_hf_summary": "Jordan's Interior Ministry announced a nationwide ban on the activities of the Muslim Brotherhood, citing their alleged involvement in a plot to threaten national security.  The plot involved weapons, explosives, drone manufacturing, and training combatants both domestically and internationally.  16 individuals were arrested for allegedly plotting these acts, with authorities linking them to the group's activities. The ministry stated that explosives and documents related to the group's operations were discovered during the investigation. \n"
    },
    {
      "title": "Will Canada’s Next Prime Minister Solve the Million-Dollar Housing Crisis?",
      "link": "https://www.nytimes.com/2025/04/23/world/canada-election-housing-crisis.html",
      "published": "2025-04-23",
      "summary": "Soaring housing costs, with many homes nearing $1 million, have sparked an exodus from cities like Vancouver, and Canadians want their next prime minister to do something about it.",
      "content": "Janet Robertson had few choices after being evicted from her apartment of two decades in Vancouver, Canada's most expensive city. \n Even listings in nearby suburbs were out of reach after years of paying 900 Canadian dollars, or $650, monthly for her studio apartment. She kept going until she could find something she could afford and ended up renting in a town about 60 miles east of Vancouver. \n \"I really didn't have any other options but to come to Chilliwack,\" Ms. Robertson said. \n Chilliwack, a farming community encircled by snow-capped peaks, was once looked down on by city dwellers because of its rural and isolated character. Now, it has become a magnet for people from Vancouver who can no longer afford living there. \n Across Canada's urban centers, climbing housing prices are pushing renters out and making buying a home a distant dream, especially for first-time buyers. The housing problem, which many in Canada describe as a full-blown crisis, is a top concern for voters heading to the polls on April 28 to cast ballots in national elections.",
      "ml_hf_summary": "Janet Robertson was evicted from her Vancouver apartment after years of paying high rent, leading her to relocate to Chilliwack, BC, approximately 60 miles east.  This move reflects a broader trend across Canada where rising housing costs are pushing renters out and making homeownership unattainable for many, particularly first-time buyers. This issue is considered a major concern by voters ahead of the April 28th national election. Chilliwack has become a popular destination for Vancouver residents seeking affordable housing options due to its rural setting and proximity to the city.  \n"
    },
    {
      "title": "Odes to Mexican Drug Lords Are Pop Hits, but the Law Is Turning Against Them",
      "link": "https://www.nytimes.com/2025/04/23/world/americas/mexico-narcocorridos-ban.html",
      "published": "2025-04-23",
      "summary": "Mexican artists built enormous audiences singing about drug cartels and narco culture. Cities and states are now moving against the style.",
      "content": "Luis R. Conriquez took the stage at a popular fair in Texcoco, Mexico, as one of the headlining acts. \n Once called the \"Corridos King\" by Billboard magazine, the Mexican musician is renowned for his specialty of so-called narcocorridos, a version of the traditional Mexican ballads that celebrate drug cartels. \n But hours before performing earlier this month, Mr. Conriquez announced on social media that he wasn't going to perform several of his signature songs. Instead, he was joining a movement sweeping across Mexico to phase out this prominent genre of music, which its critics argue promotes the violence and criminal activity that have ravaged the country. \n The crowd booed Mr. Conriquez and trashed the instruments after he and his band left the stage. \n \"It feels bad not being able to sing what people want to hear,\" Mr. Conriquez said on social media, \"but we join the cause of zero corridos.\"",
      "ml_hf_summary": "Luis R. Conriquez, a Mexican musician known as \"Corridos King,\" was scheduled to perform at a fair in Texcoco, Mexico.  He announced he would not perform certain narcocorrido songs due to a movement advocating for their phasing out. This decision led to audience disapproval and the destruction of his instruments. Conriquez stated that he chose to join this cause despite feeling conflicted about not performing his usual material. The event highlights the ongoing debate surrounding the influence of narcocorridos on violence in Mexico. \n"
    },
    {
      "title": "Victims and Eyewitnesses in Kashmir Attack Describe Scenes of Chaos and Horror",
      "link": "https://www.nytimes.com/2025/04/23/world/asia/kashmir-pahalgam-attack-victims.html",
      "published": "2025-04-23",
      "summary": "Victims and eyewitnesses described scenes of chaos and horror when militants killed 26 people in Kashmir as families, couples and friends took in a picturesque valley.",
      "content": "At around two o'clock on Tuesday afternoon, when mild sunshine and a gentle chill wrapped the Baisaran Valley in Kashmir, two newlyweds, Shubham Dwivedi and Aishanya Pandey, rented horses and rode up a gentle hill. \n They wanted to catch what they had heard was a mesmerizing view: a lush meadow fringed by pine trees, with snow-capped Himalayan peaks gleaming in the distance. \n Less than an hour later, Mr. Dwivedi was dead. \n He was among 26 people killed by militants who approached a group of visiting sightseers and then opened fire. Another 17 were injured. \n The massacre, which occurred near Pahalgam, a town in the southern part of Indian-administered Kashmir, was one of the worst attacks on Indian civilians in decades.",
      "ml_hf_summary": "On Tuesday afternoon in Baisaran Valley, Kashmir, two newlyweds, Shubham Dwivedi and Aishanya Pandey, were riding horses to view a scenic meadow when they encountered militants. The attack resulted in 26 deaths and 17 injuries, making it one of the deadliest incidents against Indian civilians in recent history.  The incident occurred near Pahalgam, a town in southern Kashmir, where the militants opened fire on a group of sightseers. This massacre highlights the ongoing security concerns in the region. \n"
    },
    {
      "title": "Powerful Earthquake Shakes Istanbul, Sending People Into Streets",
      "link": "https://www.nytimes.com/2025/04/23/world/europe/turkey-earthquake.html",
      "published": "2025-04-23",
      "summary": "No deaths were reported after the magnitude-6.2 tremor, which rattled nerves in the wake of Turkey’s disastrous 2023 quake.",
      "content": "A powerful earthquake shook Istanbul on Wednesday, sending residents of Turkey's most populous city pouring into the streets as buildings swayed and onlookers screamed. \n The magnitude-6.2 tremor, which hit at 12:49 p.m. local time, rattled nerves in a country still traumatized by a devastating 2023 quake that struck the southeast. Turkey straddles two major fault lines and is regularly hit by earthquakes. The residents of Istanbul, in particular, have been bracing for a major quake that experts have warned for years is overdue in the ancient city. \n The city of 16 million seemed to have evaded the long-predicted threat on Wednesday, with no deaths reported by late afternoon. But widespread panic spurred many people to jump off their balconies, according to the local governor's office, which said 151 people had been injured doing so. \n More than 50 aftershocks followed and shook Istanbul and the area around it throughout the day, with Interior Minister Ali Yerlikaya saying the largest recorded a magnitude of 5.9. The governor's office said it would shut down schools for two days to house people afraid to return to their homes. Many people sought safety in Istanbul's parks.",
      "ml_hf_summary": "A magnitude-6.2 earthquake struck Istanbul, Turkey on Wednesday at 12:49 p.m. local time. The quake caused widespread panic and resulted in injuries as residents fled buildings and jumped from balconies.  While no deaths were reported by late afternoon, over 150 people sustained injuries jumping from their balconies.  The aftershocks continued throughout the day, with a largest recorded magnitude of 5.9. Schools in Istanbul will be closed for two days to provide shelter for those who are afraid to return home. \n"
    },
    {
      "title": "U.S. Tells Its Diplomats in Vietnam to Avoid War Anniversary Events",
      "link": "https://www.nytimes.com/2025/04/22/world/asia/us-diplomats-vietnam-war-anniversary-trump.html",
      "published": "2025-04-22",
      "summary": "The reversal adds another Trump administration blow to decades of reconciliation efforts.",
      "content": "The Trump administration has told its senior diplomats in Vietnam not to take part in events marking the 50th anniversary of the end of the war. \n Four U.S. officials who insisted on anonymity to describe sensitive diplomatic decision-making said that Washington had recently directed senior diplomats -- including Marc Knapper, the U.S. ambassador to Vietnam -- to stay away from activities tied to the anniversary on April 30. \n That includes a hotel reception on April 29 with senior government leaders and an elaborate parade the next day -- gatherings hosted by Vietnam in Ho Chi Minh City, also known as Saigon, where the war ended with South Vietnam's surrender. \n Veterans returning to Vietnam have also been told they're on their own, for public discussions they organize on war and reconciliation, and anniversary events. For many, it amounts to a sudden reversal after months of anticipation.",
      "ml_hf_summary": "The Trump administration has instructed U.S. senior diplomats in Vietnam not to participate in the 50th anniversary celebrations of the end of the Vietnam War.  These restrictions include staying away from events hosted by Vietnam on April 29 and 30, including a reception for government leaders and a parade in Ho Chi Minh City. The decision has impacted veterans who were planning to organize public discussions and participate in anniversary events. This move represents a reversal after months of anticipation and preparation by both veterans and the U.S. government.  \n"
    },
    {
      "title": "Why Did Pope Francis Never Return to Argentina?",
      "link": "https://www.nytimes.com/2025/04/22/world/americas/pope-francis-argentina.html",
      "published": "2025-04-23",
      "summary": "Francis never gave an explicit answer for not returning as pontiff to his native country, but some experts say he worried about having his presence used for political purposes.",
      "content": "As Argentines bid farewell to Pope Francis, the grief of the faithful has been deepened by a lingering sorrow, a question that has hung in the Buenos Aires air: Why did their native son never return home? \n \"I have to be honest, I didn't like that he never came to Argentina,\" Laura Aguirre, 50, a bakery cashier, said after attending a Mass honoring the first Latin American pontiff hours after his death. \n Outside the Basilica de San Jose de Flores, just blocks from Francis's childhood home in Buenos Aires, and the church where he said he first felt the calling to the priesthood, many speculated that avoiding politics was why Argentina was not among the 68 countries he visited during his 12-year papacy, even though every president and local Catholic leaders extended invitations. \n \"He didn't want any president to wrap themselves in his cloak, to say 'I'm the one who brought the pope,'\" said Sebastian Morales, 37.",
      "ml_hf_summary": "Pope Francis passed away on October 28th, 2023.  His death prompted a farewell ceremony in Buenos Aires, Argentina, where he was born. Despite numerous invitations from Argentine presidents and Catholic leaders during his 12-year papacy, Pope Francis did not visit the country. Speculation suggests that avoiding political involvement may have been a factor in his decision to not return home.  The absence of a papal visit to Argentina has left many Argentines feeling a sense of loss and questioning why their native son never returned. \n"
    },
    {
      "title": "Trump Team Races to Form Trade Deals After Tariffs Sow Global Chaos",
      "link": "https://www.nytimes.com/2025/04/23/business/economy/trump-tariffs-trade-deals.html",
      "published": "2025-04-23",
      "summary": "The president’s threats of tariffs have brought countries like Japan, South Korea and India rushing to negotiate, but they have sown chaos with bigger trading partners like China.",
      "content": "For a president who advertises himself as a paramount deal maker, the next 11 weeks will be a pivotal test, as his advisers race to accomplish what no other administration has done before and reach dozens of individual trade deals with other governments. \n President Trump has promised big gains for American trade, and officials from Japan, South Korea, India and elsewhere have been pushing for agreements as they look to forestall punishing tariffs. But trade experts say the administration has set up a seemingly impossible task, given that traditional trade deals typically take months or years to negotiate. \n Mr. Trump has tried to use tariffs as leverage to notch quick agreements, and his trade adviser, Peter Navarro, has promised \"90 deals in 90 days.\" But the levies are creating chaos and financial pain for many businesses, and they have not brought some of America's largest trading partners, including China, to the table. \n Some U.S. trade with China has ground to a halt after the countries imposed triple-digit tariffs on each others' products, and a wave of bankruptcies, especially among small U.S. businesses that rely on Chinese imports, appears to be looming if the trade barriers are maintained.",
      "ml_hf_summary": "President Trump aims to achieve numerous individual trade deals within 11 weeks, a feat unprecedented in his administration.  He has promised significant gains for American trade and is facing pressure from trading partners like Japan, South Korea, India, and others seeking to avoid tariffs. However, experts argue that this ambitious goal is unrealistic given the typical lengthy negotiation process for traditional trade agreements. Trump's use of tariffs as leverage has led to financial hardship for businesses and hampered negotiations with major trading partners such as China, resulting in a halt of some U.S.-China trade. \n"
    },
    {
      "title": "I Watched the Pope Visit the Forgotten and Convert the Skeptical",
      "link": "https://www.nytimes.com/2025/04/22/world/europe/pope-francis-death-legacy.html",
      "published": "2025-04-22",
      "summary": "Jim Yardley, a former Rome bureau chief for The New York Times, witnessed Pope Francis’ transformation from an unlikely papal contender to a beloved figure.",
      "content": "I remember the people. Thousands of them, sometimes hundreds of thousands, pressed together in aging stadiums, lining the streets of one place or another. \n In the Mexican state of Chiapas, so many people crowded in a local stadium in 2016 that it seemed to heave from the human swarm, everyone craning upward, squinting at the cloudless sky, as a helicopter slowly descended into clouds of dust, bearing Pope Francis. \n Earlier, in Morelia, it didn't matter that Francis was running late. A band played. Nuns waved pompoms. Priests and seminarians formed a conga line, hands on shoulders, knees pumping, punching the air and dancing until Francis appeared. \n From the moment he became an unexpected pope on a rainy night in Vatican City in 2013, Francis centered his papacy on what he called \"the peripheries,\" the places forgotten in a supposedly interconnected, globalized world. He talked about people \"on the margins,\" about immigrants and the poor, and when he traveled the globe, he always found them, and they found him.",
      "ml_hf_summary": "Pope Francis' papacy has been characterized by his focus on \"the peripheries,\" or marginalized communities often overlooked in a globalized world.  In 2016, thousands of people gathered in Chiapas, Mexico to welcome Pope Francis, who arrived via helicopter after a delay in Morelia, Mexico. The event included music, dancing, and processions led by priests and seminarians.  Pope Francis' papacy began in 2013 when he was elected as the new pope on a rainy night in Vatican City. He has consistently emphasized connecting with those experiencing hardship and marginalization, both during his travels and through his public statements. \n"
    },
    {
      "title": "How to Watch Pope Francis’ Funeral",
      "link": "https://www.nytimes.com/2025/04/23/world/europe/pope-francis-funeral-when-time-watch.html",
      "published": "2025-04-23",
      "summary": "World leaders and the Catholic faithful from around the globe will attend the funeral on Saturday. Here’s how to watch it and what to expect.",
      "content": "Mourners will bid a final farewell to Pope Francis on Saturday during his funeral Mass, which is expected to draw international leaders as well as cardinals, archbishops and priests from around the world to the Vatican. The rites will be broadcast by news networks around the globe. \n Until the funeral, his body, dressed in papal vestments, will lie in state at St. Peter's Basilica. \n Here's what to know. \n Where can I watch the funeral? \n The funeral will take place on Saturday at 10 a.m. local time (4 a.m. Eastern) in St. Peter's Square, the Vatican announced. \n The New York Times will stream the funeral as part of its live coverage on Saturday, and many U.S. television networks, including NBC, CBS, CNN and ABC, are planning to broadcast it as well. International broadcasters, such as the BBC in Britain, will also cover the funeral.",
      "ml_hf_summary": "Pope Francis' funeral Mass is scheduled for Saturday at 10 a.m. local time (4 a.m. Eastern) in St. Peter’s Square, Vatican City. The event will be broadcast globally by news networks including the New York Times and major U.S. television networks like NBC, CBS, CNN, and ABC.  His body is currently lying in state at St. Peter's Basilica until the funeral. International leaders and religious figures are expected to attend, with mourners from around the world participating in the final farewell. \n"
    },
    {
      "title": "Jared Kushner Targets Albania’s Adriatic Coast for Luxury Tourism",
      "link": "https://www.nytimes.com/2025/04/23/travel/albania-jared-kushner-tourism-trump.html",
      "published": "2025-04-23",
      "summary": "Two major proposals led by Jared Kushner and a new airport championed by the Albanian government focus on an area prized for its biodiversity. Are they a sign of things to come?",
      "content": "The bright waters of the Narta lagoon mirrored the sky -- until a massive white bird soared in from the Adriatic, skimming the surface with its dangling feet. \"It's a Dalmatian pelican,\" my guide, Julian Hoffman, said. \n It was my first time seeing the pelican in the wild, and I laughed with the joy of it. My introduction to the bird had come through a print by Edward Lear, the 19th-century naturalist and painter, that hung in my grandparents' house. With its exaggerated bill and cap of fluffy feathers, it looked like a happy-go-lucky cartoon character to my childhood self -- except for its eyes, which seemed sorrowful and questioning. \n The pelican slowed to a splashy stop. Soon it was joined by other birds: greater flamingos, gray herons, Eurasian spoonbills, a flock of little egrets. The creatures preened and fished, squawked and chortled.",
      "ml_hf_summary": "A visitor observed a Dalmatian pelican in the Narta lagoon near Croatia.  The bird was identified by guide Julian Hoffman, who noted its distinctive bill and appearance. The sighting occurred during a personal experience of observing wild birds, which included greater flamingos, gray herons, Eurasian spoonbills, and little egrets. The scene was described as lively with preening, fishing, squawking, and chortling by the various bird species. \n"
    },
    {
      "title": "Pope Francis’ Coffin Is Moved to St. Peter’s Basilica to Lie in State",
      "link": "https://www.nytimes.com/2025/04/23/world/europe/pope-francis-coffin-lying-in-state-st-peters.html",
      "published": "2025-04-23",
      "summary": "Crowds flocked to pay their respects and bid farewell to the pontiff, who died on Monday at the age of 88.",
      "content": "Latin chants sounded across the Vatican as a long procession of red-hatted cardinals, bishops in violet capes and Swiss Guards in striped uniforms accompanied Francis' body from his residency to St. Peter's Basilica on Wednesday. \n Death knells tolled, and thousands of people lined up for hours in the Vatican to see the pontiff, who died on Monday morning at 88. \n \"This pope was special, and I wanted to say goodbye,\" said Natalia Zoni, 51, who left her home in Tuscany at dawn to travel to Rome. Tears welled in her eyes as she stood in front of the pope's coffin, and she said, \"Thank you,\" to Francis, who lay in front of Bernini's giant bronze canopy. \n The pope wore simple black leather shoes -- which had become a hallmark of his unpretentious style -- as he lay beneath the golden vault of the basilica.",
      "ml_hf_summary": "Pope Francis died on Monday morning at age 88.  A procession of cardinals, bishops, and Swiss Guards accompanied his body from his residence to St. Peter's Basilica in Rome on Wednesday. Thousands of people lined up for hours to pay their respects as they heard Latin chants and the death knell tolled. Pope Francis was buried beneath the golden vault of St. Peter's Basilica, wearing simple black leather shoes. Natalia Zoni traveled from Tuscany to Rome to say goodbye to the pope. \n"
    },
    {
      "title": "Almost Half of Americans Breathe Unhealthy Air, Report Finds",
      "link": "https://www.nytimes.com/2025/04/23/climate/american-lung-association-air-report.html",
      "published": "2025-04-23",
      "summary": "Weakening or rolling back longstanding environmental regulations would worsen the problem, the American Lung Association assessment says.",
      "content": "Air quality in the United States has been generally improving since the Clean Air Act was enacted in 1970, with levels of key pollutants dropping by nearly 80 percent. But millions of Americans still breathe polluted air every day, leading to both acute and chronic health conditions that, in some cases, increase the risk of early death. \n At least 156.1 million people live with air that got the poorest grade of F for at least one pollutant, and at least 42 million people live in counties that failed all three pollutant standards. Of the 885 counties with air quality monitoring data, 480 counties failed at least one of the three measures. \n The Biden administration aimed to improve air quality with measures like tighter rules for vehicle emissions and on mercury and carbon emissions from power plants. The Trump administration is already working to reverse those regulations. \n President Trump has also directed the government to increase the mining and use of coal, including through an executive order earlier this month. \n \"We're slashing unnecessary regulations that targeted the beautiful, clean coal,\" Mr. Trump said when the order was signed. \"I'm also directing Secretary Wright to use billions of dollars of federal funding to invest in the next generation of coal technology,\" he added, referring to Energy Secretary Chris Wright.",
      "ml_hf_summary": "Air quality in the United States has shown significant improvement since the Clean Air Act of 1970, with pollutant levels dropping by nearly 80%. However, millions still breathe polluted air daily, leading to health issues and potential premature death.  At least 156.1 million people live in areas with poor air quality according to a report, while 42 million reside in counties failing all three pollutant standards. The Biden administration has implemented measures to improve air quality, but the Trump administration is reversing these regulations, including directing funding towards coal mining and technology.  \n"
    },
    {
      "title": "Mexico’s President Punches Back Against Kristi Noem’s Anti-Migrant Ads",
      "link": "https://www.nytimes.com/2025/04/22/world/americas/mexico-kristi-noem-sheinbaum-ads.html",
      "published": "2025-04-23",
      "summary": "The D.H.S. secretary’s appearances on Mexican television blaming migrants for societal ills in the U.S. have drawn a sharp rebuke from Mexico’s president, Claudia Sheinbaum.",
      "content": "The ad campaigns form part of a broader push that Mr. Trump put into motion at the start of his new term to curb migration to the United States and carry out mass deportations of migrants living in the country. Ms. Noem has emerged as a public face of this effort, drawing attention for appearing in a previous video at a prison where deportees are being held in El Salvador while wearing a $50,000 watch. \n Focusing on Mr. Trump's complaints about migration and illicit drugs, Ms. Sheinbaum has already deployed 10,000 troops to prevent migrants from reaching the border. Her government has also handed over to the U.S. dozens of cartel operatives and accepted intelligence from C.I.A. drone flights to track down others. \n Going further, Mexico's government is making record seizures of fentanyl, a powerful synthetic opioid, much of it manufactured in Mexico, that is responsible for tens of thousands of overdose deaths each year in the United States. Mexico is also imposing its own tariffs on imports from China. \n With Mexico's economy exceptionally dependent on trade with the United States, some in the country are questioning whether Ms. Sheinbaum is going too far in her response to the ads. \n Fernando Dworak, a political analyst based in Mexico City, called her reaction \"disproportionate\" and argued it was a part of a strategy that has sought to solidify support for Ms. Sheinbaum among her base of supporters.",
      "ml_hf_summary": "Mexican President Andrés Manuel López Obrador (AMLO) is implementing a multi-pronged approach to address the issue of migration and drug trafficking, including deploying 10,000 troops to prevent migrants from reaching the border, collaborating with the U.S. on intelligence sharing, and seizing record amounts of fentanyl.  Mexico's actions are in response to Donald Trump's campaign promises to curb immigration and deport undocumented migrants. The Mexican government is also imposing tariffs on Chinese imports as part of a broader strategy to reduce reliance on China. Some analysts question the effectiveness and proportionality of AMLO's approach, particularly its impact on Mexico's economy dependent on trade with the U.S. \n"
    },
    {
      "title": "Rubio Skipping Ukraine Talks as Zelensky Rebuffs U.S. on Crimea",
      "link": "https://www.nytimes.com/2025/04/22/world/europe/ukraine-cease-fire-talks.html",
      "published": "2025-04-23",
      "summary": "The decision by Secretary of State Marco Rubio to pull out of the meeting and an objection by Ukraine’s leader to a key U.S. proposal raised questions about the state of the negotiations.",
      "content": "Secretary of State Marco Rubio decided on Tuesday to skip the next stage of the Ukrainian cease-fire talks, while Ukraine rebuffed one of President Trump's key proposals for a deal that would halt the fighting with Russia. \n Negotiators from the United States, Europe and Ukraine will still meet in London on Wednesday to continue hammering out a cease-fire proposal. But the back-to-back developments are a double blow, raising fresh questions about how much progress is being made toward winding down the three-year war. \n Mr. Rubio took part in a meeting on Ukraine last week in Paris, but afterward warned that Mr. Trump was growing impatient with the peacemaking process and might move on to \"other priorities.\" \n While in Paris, two European officials said, the negotiators were briefed on the Trump administration's framework for a cease-fire deal, which includes demands that Ukraine recognize Russia's annexation of Crimea and rules out NATO membership for Ukraine.",
      "ml_hf_summary": "Secretary of State Marco Rubio skipped the next stage of Ukrainian ceasefire talks, while Ukraine rejected one of President Trump's proposals.  Negotiators from the US, Europe, and Ukraine will meet in London on Wednesday to continue working on a cease-fire proposal.  Mr. Rubio had previously warned that President Trump might shift focus to other priorities due to his impatience with the peacemaking process. The proposed deal includes demands for Ukraine to recognize Russia's annexation of Crimea and exclude NATO membership for Ukraine. \n"
    },
    {
      "title": "Costa Rica Tells Trump Deportees They Can Stay and Integrate, or Leave",
      "link": "https://www.nytimes.com/2025/04/22/world/americas/costa-rica-deported-migrants.html",
      "published": "2025-04-23",
      "summary": "The country is taking action to “protect” dozens of migrants from faraway nations who were deported from the United States and until recently, were indefinitely detained.",
      "content": "Costa Rican authorities this week said they would make it possible for dozens of migrants deported from the United States to legally stay in the country -- or leave if they so choose to. \n Omer Badilla, the head of Costa Rica's migration authority, said that starting on Monday, officials were returning passports and other personal documents to people who since February had been detained in a remote facility hours from the capital \n He also said that a resolution passed by the government on Monday would open up a path so that the deportees could stay and integrate into Costa Rican society. \n Mr. Badilla said in an interview with The New York Times that officials had only retained the passports as a protective measure. \"If the person has a well-founded fear of returning to their country, we will never send them back,\" he added. \"We will protect them.\"",
      "ml_hf_summary": "Costa Rican authorities are offering deported migrants from the United States the option to legally stay in the country or leave. Starting Monday, officials will return passports and other personal documents to individuals who were detained since February in a remote facility. A government resolution allows these deportees to integrate into Costa Rican society if they choose to stay. The decision is based on the principle of protecting migrants with legitimate fears of returning to their home countries. \n"
    },
    {
      "title": "How Pope Francis Catalyzed the Catholic Right in the U.S.",
      "link": "https://www.nytimes.com/video/world/europe/100000010121909/how-pope-francis-catalyzed-the-catholic-right-in-the-us.html",
      "published": "2025-04-22",
      "summary": "Pope Francis’ critics represent a minority of the American church but a powerful one. Ruth Graham, a reporter covering religion, faith and values for The New York Times, describes how his papacy galvanized a tide of conservative resistance in the American church hierarchy, in Washington and in the pews.",
      "content": "NOW PLAYING \n How Pope Francis Catalyzed the Catholic Right in the U.S. \n 3:12 \n Why Pope Francis Was Always a Surprise \n 2:27 \n Can a Judge Hold the White House in Contempt of Court? \n Advertisement SKIP ADVERTISEMENT \n 2:20 \n How Meta's News Ban Could Disrupt Canada's Election \n 1:46 \n How Fertilizer Poisoned So Much Farmland \n 3:01 \n How China and the E.U. Are Reacting to Trump's Tariffs \n Advertisement SKIP ADVERTISEMENT \n 2:42 \n For Sale: Burnt Lots in Pacific Palisades \n 3:05 \n The Conservative Christian Network Inside the White House \n 1:42 \n How Will Cuts to Climate Research Funding Affect Our Health? \n Advertisement SKIP ADVERTISEMENT \n 3:00 \n Can the Menendez Brothers Get Parole? \n 2:38 \n How the White House Press Briefing Is Changing \n 2:23",
      "ml_hf_summary": "The provided text appears to be a list of article titles and durations, not a news article. It seems to be from a website or platform that features various news articles and their associated video content.  There is no information about specific events, facts, numbers, key details, names, dates, locations, or background context within the provided text. \n"
    },
    {
      "title": "A Choice That Sent a Message: Looking Back at Francis’ 2013 Election as Pope",
      "link": "https://www.nytimes.com/2025/04/21/world/pope-francis-2013-election.html",
      "published": "2025-04-22",
      "summary": "Here is a look back at Francis’ appointment as pope in March 2013.",
      "content": "From the archives: A look back at Francis' appointment as pope in March 2013. \n When Jorge Mario Bergoglio, a cardinal from Argentina, was selected as the 266th pontiff of the Roman Catholic Church, he became the first South American to lead the church. \n Taking the name Francis, he was also the first non-European pope in more than 1,200 years and the first member of the Jesuit order to lead the church. \n In choosing the archbishop of Buenos Aires, who was 76 at the time, the cardinals sent a powerful message that the future of the church lay in the global south, home to the bulk of the world's Catholics. \n Born to Italian immigrant parents and raised in Buenos Aires, he was known as a humble man who spoke out for the poor and led an austere life in the Argentine capital.",
      "ml_hf_summary": "Jorge Mario Bergoglio, a cardinal from Argentina, was elected Pope Francis on March 13, 2013. This made him the first South American pope and the first non-European pope in over 1,200 years.  He chose to be known as Francis and was also the first Jesuit order member to lead the Catholic Church. The cardinals' selection of Bergoglio signaled a shift towards the global south, where most Catholics reside. Born to Italian immigrant parents in Buenos Aires, he led an austere life and was known for his work with the poor. \n"
    },
    {
      "title": "Aliza Magen, Highest-Ranking Woman in the Mossad, Dies at 87",
      "link": "https://www.nytimes.com/2025/04/22/world/middleeast/aliza-magen-dead.html",
      "published": "2025-04-22",
      "summary": "Her career at Israel’s national intelligence agency included working undercover before serving as deputy under three directors.",
      "content": "Aliza Magen, who spent some 40 years working for the Mossad, Israel's national intelligence agency, eventually serving as deputy under three of its directors, making her the highest-ranking woman in the organization's history, died on April 14 in Jerusalem. She was 87. \n Her death was announced in a statement by the Israeli prime minister's office. \n Mrs. Magen joined the Mossad directly after her mandatory military service and worked there her entire career. For more than 20 years she served undercover in various posts around Europe, where she was tasked with running agents and collecting intelligence. \n She participated in some of the Mossad's biggest operations, though many of the details of her work remain classified. She was fluent in German, and one of her first operations was a multiyear effort to undermine, assassinate or turn German scientists who were building missiles for Egypt, which could have devastated Israel during a war. \n From her base in Austria, she helped recruit a former top-ranking Nazi officer to become a Mossad asset.",
      "ml_hf_summary": "Aliza Magen, the highest-ranking woman in Israeli intelligence agency Mossad history, died on April 14th at age 87.  She dedicated over 40 years to the Mossad, serving as deputy director under three directors and working undercover for over two decades in Europe. Her work included running agents and collecting intelligence, with participation in several high-profile operations that remain classified. Magen's career involved efforts to undermine German scientists developing missiles for Egypt, potentially impacting Israel during a war.  She also recruited a former Nazi officer to join the Mossad as an asset. \n"
    }
  ]
}